abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.atq.1
h28575
s 00001/00001/00040
d D 6.2 86/05/10 19:52:36 mckusick 2 1
c syntax
e
s 00041/00000/00000
d D 6.1 85/04/29 21:48:14 mckusick 1 0
c manual page first distributed with 4.3BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH ATQ 1 "%Q%"
.UC 6
.SH NAME
D 2
atq - print the queue of jobs waiting to be run
E 2
I 2
atq \- print the queue of jobs waiting to be run
E 2
.SH SYNOPSIS
.B atq
[ -c ] [ -n ] [ name ... ]
.SH DESCRIPTION
.I Atq 
prints the queue of jobs that are waiting to be run
at a later date. These jobs were created with the
.IR at (1)
command.
With no flags, the queue is sorted in the order that
the jobs will be executed.
.PP
If the 
.B \-c 
flag is used, the queue is sorted by the time that the 
.I at 
command was given. 
.PP
The 
.B \-n 
flag prints only the total number of files that are currently
in the queue. 
.PP
If a name(s) is provided, only those files belonging to that user(s) are 
displayed.
.SH FILES
/usr/spool/at		spool area
.SH "SEE ALSO"
at(1),
atrm(1),
cron(8)
E 1
