abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.atrm.1
h37587
s 00001/00001/00047
d D 6.2 86/05/10 19:52:25 mckusick 2 1
c syntax
e
s 00048/00000/00000
d D 6.1 85/04/29 21:49:13 mckusick 1 0
c manual page first distributed with 4.3BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH ATRM 1 "%Q%"
.UC 6
.SH NAME
D 2
atrm - remove jobs spooled by at
E 2
I 2
atrm \- remove jobs spooled by at
E 2
.SH SYNOPSIS
.B atrm
[ -f ] [ -i ] [-] [[ job #] [ name ]... ]
.SH DESCRIPTION
.I Atrm 
removes jobs that were created with the
.IR at (1)
command.
With the
.B \-
flag, all jobs belonging to the person invoking
.I atrm
are removed.
If a job number(s) is specified, 
.I atrm
attempts to remove only that job number(s).
.PP
If the 
.B \-f 
flag is used, all information regarding the 
removal of the specified jobs is suppressed.
If the
.B \-i
flag is used, 
.I atrm
asks if a job should be removed; a response of 'y' causes the job to be removed.
.PP
If a user(s) name is specified, all 
jobs belonging to that user(s) are removed.
This form of invoking 
.I atrm
is useful only to the super-user.
.SH FILES
/usr/spool/at		spool area
.SH "SEE ALSO"
at(1),
atq(1),
cron(8)
E 1
