abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.binmail.1
h12863
s 00001/00001/00133
d D 6.1 85/04/29 17:40:29 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00022/00036/00112
d D 5.1 85/04/29 17:40:19 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00148/00000/00000
d D 4.1 85/04/29 17:40:13 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH BINMAIL 1 11/16/79
E 2
I 2
D 3
.TH BINMAIL 1 "16 November 1979"
E 3
I 3
.TH BINMAIL 1 "%Q%"
E 3
E 2
.AT 3
.SH NAME
D 2
mail \- send or receive mail among users
E 2
I 2
binmail \- send or receive mail among users
E 2
.SH SYNOPSIS
.B /bin/mail
[
.B +
] [
.B \-i
] [ person ] ...
.br
.B /bin/mail
.B "[ + ]"
[
.B \-i
]
.B \-f
file
.LP
.SH DESCRIPTION
D 2
Note: This is one of two mailers with the name
.I mail.
The default
E 2
I 2
Note: This is the old version 7 UNIX system mail program.  The default
E 2
.I mail
command is described in
D 2
.IR mail (1),
E 2
I 2
.IR Mail (1),
E 2
and its binary is in the directory
D 2
.I /usr/ucb.
E 2
I 2
.IR /usr/ucb .
E 2
.PP
D 2
.I Mail
with no argument
prints
a user's mail,
message-by-message,
in last-in, first-out order;
the optional argument
E 2
I 2
.I mail
with no argument prints a user's mail, message-by-message,
in last-in, first-out order; the optional argument
E 2
.B +
D 2
causes first-in, first-out order.
For each message,
it reads a line from the standard input
E 2
I 2
displays the mail messages in first-in, first-out order.
For each message, it reads a line from the standard input
E 2
to direct disposition of the message.
.TP
newline
Go on to next message.
.TP
d
Delete message and go on to the next.
.TP
p
Print message again.
.TP
\-
Go back to previous message.
.TP
.RI "s [" " file " "] ..."
Save the message in the named
.I files
(`mbox' default).
.TP
.RI "w [" " file " "] ..."
Save the message, without a header, in the named
.I files
(`mbox' default).
.TP
.RI "m [" " person " "] ..."
Mail the message to the named
.I persons
(yourself is default).
.TP
EOT (control-D)
Put unexamined mail back in the mailbox and stop.
.TP
q
Same as EOT.
.TP
.RI ! command
Escape to the Shell to do
.IR command .
.TP
*
Print a command summary.
.PP
D 2
.PP
An interrupt normally causes termination of the command;
the mail file is unchanged.
The optional argument
E 2
I 2
An interrupt normally terminates the 
.I mail
command; the mail file is unchanged.  The optional argument
E 2
.B \(mii
D 2
causes
E 2
I 2
tells
E 2
.I mail
to continue after interrupts.
.PP
When
.I persons
are named,
.I mail
D 2
takes the standard input up to an end-of-file
(or a line with just `.')
E 2
I 2
takes the standard input up to an end-of-file (or a line with just `.')
E 2
and adds it to each
.I person's
D 2
`mail' file.
The message is preceded by the sender's name and a postmark.
Lines that look like postmarks are
prepended with `>'.
A
E 2
I 2
`mail' file.  The message is preceded by the sender's name and a postmark.
Lines that look like postmarks are prepended with `>'.  A
E 2
.I person
is usually a user name recognized by
.IR  login (1).
To denote a recipient on a remote system, prefix 
.I person
by the system name and exclamation mark (see
D 2
.IR uucp (1)).
E 2
I 2
.IR uucp (1C)).
E 2
.PP
The
.B \-f
D 2
option causes the named file, e.g. `mbox',
E 2
I 2
option causes the named file, for example, `mbox',
E 2
to be printed as if it were the mail file.
.PP
D 2
When a user logs in he is informed of the presence
of mail.
E 2
I 2
When a user logs in he is informed of the presence of mail.
E 2
.SH FILES
.ta \w'/usr/spool/mail/*.lock 'u
/etc/passwd	to identify sender and locate persons
.br
.li
/usr/spool/mail/*	incoming mail for user *
.br
mbox		saved mail
.br
/tmp/ma*	temp file
.br
/usr/spool/mail/*.lock	lock for mail directory
.br
dead.letter	unmailable text
.br
.SH "SEE ALSO"
D 2
mail(1), write(1), uucp(1), uux(1), xsend(1), delivermail(8)
E 2
I 2
Mail(1), write(1), uucp(1C), uux(1C), xsend(1), sendmail(8)
E 2
.SH BUGS
D 2
Race conditions sometimes result
in a failure to remove a lock file.
E 2
I 2
Race conditions sometimes result in a failure to remove a lock file.
E 2
.PP
Normally anybody can read your mail, unless it is sent by
.IR xsend (1).
An installation can overcome this by making
.I mail
a set-user-id command that owns the mail directory.
E 1
