abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.from.1
h21702
s 00001/00001/00032
d D 6.2 86/04/20 05:19:01 lepreau 4 3
c prmail is gone
e
s 00001/00001/00032
d D 6.1 85/04/29 14:25:53 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00032
d D 5.1 85/04/29 14:25:46 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00033/00000/00000
d D 4.1 85/04/29 14:25:39 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH FROM 1
E 2
I 2
D 3
.TH FROM 1 "18 January 1983"
E 3
I 3
.TH FROM 1 "%Q%"
E 3
E 2
.UC 4
.SH NAME
from \- who is my mail from?
.SH SYNOPSIS
.B from
[
.B \-s
sender
]
[
user
]
.SH DESCRIPTION
.I From
prints out the mail header lines in your mailbox file
to show you who your mail is from.
If
.I user
is specified, then \fIuser\fP's mailbox is examined instead of your own.
If the -s option is given, then only headers for mail sent by
.I sender
are printed.
.SH FILES
/usr/spool/mail/*
.SH "SEE ALSO"
D 4
biff(1), mail(1), prmail(1)
E 4
I 4
biff(1), mail(1)
E 4
E 1
