abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.hostid.1
h13514
s 00001/00001/00030
d D 6.5 04/10/21 06:10:23 msokolov 6 5
c don't use bold in the NAME section
e
s 00010/00005/00021
d D 6.4 88/07/09 11:44:56 bostic 5 4
c install approved copyright notice
e
s 00016/00014/00010
d D 6.3 88/06/06 15:42:15 bostic 4 3
c add Berkeley specific header; not rc.local, netstart now; minor cleanup
e
s 00003/00002/00021
d D 6.2 86/05/05 16:19:07 bloom 3 2
c describe new argument format
e
s 00001/00001/00022
d D 6.1 85/04/29 21:09:36 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00023/00000/00000
d D 5.1 85/04/29 21:09:29 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
.\" Copyright (c) 1988 Regents of the University of California.
.\" All rights reserved.
E 4
.\"
I 4
.\" Redistribution and use in source and binary forms are permitted
D 5
.\" provided that this notice is preserved and that due credit is given
.\" to the University of California at Berkeley. The name of the University
.\" may not be used to endorse or promote products derived from this
.\" software without specific prior written permission. This software
.\" is provided ``as is'' without express or implied warranty.
E 5
I 5
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
.\"
E 4
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH HOSTID 1 "1 April 1983"
E 2
I 2
.TH HOSTID 1 "%Q%"
E 2
.UC 5
.SH NAME
D 4
hostid \- set or print identifier of current host system
E 4
I 4
D 6
\fBhostid\fP \- set or print identifier of current host system
E 6
I 6
hostid \- set or print identifier of current host system
E 6
E 4
.SH SYNOPSIS
D 4
.B hostid
[ identifier ]
E 4
I 4
\fBhostid\fP [hexnum or internet address]
E 4
.SH DESCRIPTION
D 4
The
.I hostid
command prints the identifier of the current host in hexadecimal.
This numeric value is expected to be unique across all hosts and
D 3
is normally set to the host's Internet address.
E 3
I 3
is commonly set to the host's Internet address.
E 3
The super-user can set the hostid by giving a hexadecimal
D 3
argument; this is usually done in the startup script /etc/rc.local.
E 3
I 3
argument or the hostname;
this is usually done in the startup script /etc/rc.local.
E 4
I 4
\fIHostid\fP prints the identifier of the current host in hexadecimal.
This numeric value is expected to be unique across all hosts and is
commonly set to the host's Internet address.  The super-user can set
the hostid by giving a hexadecimal argument or the hostname; this is
usually done in the startup script \fI/etc/netstart\fP.
E 4
E 3
.SH SEE ALSO
gethostid(2), sethostid(2)
E 1
