abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.hostname.1
h44351
s 00001/00001/00030
d D 6.4 04/10/21 06:10:24 msokolov 5 4
c don't use bold in the NAME section
e
s 00010/00005/00021
d D 6.3 88/07/09 11:44:57 bostic 4 3
c install approved copyright notice
e
s 00016/00012/00010
d D 6.2 88/06/06 15:28:03 bostic 3 2
c add -s flag, Berkeley header, hostname now run from /etc/netstart
e
s 00001/00001/00021
d D 6.1 85/04/29 21:09:54 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00022/00000/00000
d D 5.1 85/04/29 21:09:47 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
.\" Copyright (c) 1983, 1988 Regents of the University of California.
.\" All rights reserved.
E 3
.\"
I 3
.\" Redistribution and use in source and binary forms are permitted
D 4
.\" provided that this notice is preserved and that due credit is given
.\" to the University of California at Berkeley. The name of the University
.\" may not be used to endorse or promote products derived from this
.\" software without specific prior written permission. This software
.\" is provided ``as is'' without express or implied warranty.
E 4
I 4
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
.\"
E 3
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH HOSTNAME 1 "13 March 1982"
E 2
I 2
.TH HOSTNAME 1 "%Q%"
E 2
.UC 5
.SH NAME
D 3
hostname \- set or print name of current host system
E 3
I 3
D 5
\fBhostname\fP \- set or print name of current host system
E 5
I 5
hostname \- set or print name of current host system
E 5
E 3
.SH SYNOPSIS
D 3
.B hostname
[ nameofhost ]
E 3
I 3
\fBhostname\fP [-s] [nameofhost]
E 3
.SH DESCRIPTION
D 3
The
.I hostname
command prints the name of the current host, as given before the
``login'' prompt.
The super-user can set the hostname by giving an argument; this
is usually done in the startup script /etc/rc.local.
E 3
I 3
\fIHostname\fP prints the name of the current host.  The super-user can
set the hostname by supplying an argument; this is usually done in the
network initialization script \fI/etc/netstart\fP, normally run at boot
time.  The \fI-s\fP option trims any domain information from the printed
name.
E 3
.SH SEE ALSO
gethostname(2), sethostname(2)
E 1
