abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.iostat.1
h25311
s 00017/00004/00049
d D 6.1 85/04/29 14:27:02 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00004/00002/00049
d D 5.1 85/04/29 14:26:55 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00051/00000/00000
d D 4.1 85/04/29 14:26:48 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH IOSTAT 1
E 2
I 2
D 3
.TH IOSTAT 1 "18 January 1983"
E 3
I 3
.TH IOSTAT 1 "%Q%"
E 3
E 2
.UC 4
.SH NAME
iostat \- report I/O statistics
.SH SYNOPSIS
.B iostat
I 3
[ drives ]
E 3
[ interval [ count ] ]
.SH DESCRIPTION
.I Iostat
D 3
iteratively reports the number of characters read and written to terminals,
D 2
and, for each disk, the number of seeks and transfers per second,
E 2
I 2
and, for each disk, the number of seeks transfers per second, kilobytes
transfered per second,
E 3
I 3
iteratively reports the number of characters read and written to terminals
per second,
and, for each disk, the number of transfers per second, kilobytes
transferred per second,
E 3
E 2
and the milliseconds per average seek.
It also gives the percentage of time the system has
spent in user mode, in user mode running low priority (niced) processes,
in system mode, and idling.
.PP
To compute this information, for each disk, seeks and data transfer completions
and number of words transferred are counted;
for terminals collectively, the number
of input and output characters are counted.
Also, each sixtieth of a second,
the state of each disk is examined
and a tally is made if the disk is active.
From these numbers and given the transfer rates
of the devices it is possible to determine
average seek times for each device.
.PP
The optional
.I interval
argument causes
.I iostat
to report once each
.I interval
seconds.
The first report is for  all time since a reboot and each
subsequent report is for the last interval only.
.PP
The optional
.I count
argument restricts the number of reports.
I 3
.PP
If more than 4 disk drives are configured in the system,
.I iostat
displays only the first 4 drives, with priority given
to Massbus disk drives (i.e. if both Unibus and Massbus
drives are present and the total number of drives exceeds
4, then some number of Unibus drives will not be displayed
in favor of the Massbus drives).  To force
.I iostat
to display specific drives, their names may be supplied on
the command line.
E 3
.SH FILES
/dev/kmem
I 2
.br
E 2
/vmunix
.SH SEE ALSO
vmstat(1)
E 1
