abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.ruptime.1c
h43981
s 00007/00002/00049
d D 6.1 85/04/29 21:16:11 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00051/00000/00000
d D 5.1 85/04/29 21:16:01 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH RUPTIME 1C "8 March 1982"
E 2
I 2
.TH RUPTIME 1C "%Q%"
E 2
.UC 5
.SH NAME
ruptime \- show host status of local machines
.SH SYNOPSIS
.B ruptime
[
.B \-a
] [
I 2
.B \-r
] [
E 2
.B \-l
] [
.B \-t
] [
.B \-u
]
.SH DESCRIPTION
.I Ruptime
gives a status line like
.I uptime
for each machine on the local network;
these are formed from packets broadcast by each host
on the network once a minute.
.PP
Machines for which no
D 2
status report has been received for 5 minutes are shown as being down.
E 2
I 2
status report has been received for 11 minutes are shown as being down.
E 2
.PP
Users idle an hour or more are not counted unless the
.B \-a
flag is given.
.PP
Normally, the listing is sorted by host name.
The
.B \-l ,
.B \-t ,
and
.B \-u
flags specify sorting by
load average,
uptime,
and number of users, respectively.
I 2
The
.B \-r
flag reverses the sort order.
E 2
.SH FILES
.DT
/usr/spool/rwho/whod.*	data files
.SH SEE ALSO
rwho(1C)
E 1
