abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.rwho.1c
h40380
s 00001/00001/00043
d D 6.1 85/04/29 21:16:42 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00044/00000/00000
d D 5.1 85/04/29 21:16:24 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH RWHO 1C "23 March 1982"
E 2
I 2
.TH RWHO 1C "%Q%"
E 2
.UC 5
.SH NAME
rwho \- who's logged in on local machines
.SH SYNOPSIS
.B rwho
[
.B \-a
]
.SH DESCRIPTION
The
.I rwho
command produces output similar to
.I who,
but for all machines on the local network.
If no report has been
received from a machine for 5 minutes then
.I rwho
assumes the machine is down, and does not report users last known
to be logged into that machine.
.PP
If a users hasn't typed to the system for a minute or more, then
.I rwho
reports this idle time.  If a user hasn't typed to the system for
an hour or more, then
the user will be omitted from the output of
.I rwho
unless the
.B \-a
flag is given.
.SH FILES
/usr/spool/rwho/whod.*	information about other machines
.SH SEE ALSO
ruptime(1C),
rwhod(8C)
.SH BUGS
This is unwieldy when the number of machines
on the local net is large.
E 1
