abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.sendbug.1
h17849
s 00001/00003/00035
d D 6.3 87/07/26 14:37:11 bostic 4 3
c didn't mention bugfiler(8)
e
s 00007/00006/00031
d D 6.2 86/05/05 21:37:19 bloom 3 2
c add description of EDITOR environment variable
e
s 00001/00001/00036
d D 6.1 85/04/29 21:26:07 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00037/00000/00000
d D 5.1 85/04/29 21:25:48 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH SENDBUG 1 "11 May 1983"
E 2
I 2
.TH SENDBUG 1 "%Q%"
E 2
.UC 5
.ad
.SH NAME
sendbug \- mail a system bug report to 4bsd-bugs
.SH SYNOPSIS
.B sendbug [ address ]
.SH DESCRIPTION
.PP
D 3
Bug reports sent to `4bsd-bugs@BERKELEY' are intercepted
E 3
I 3
Bug reports sent to `4bsd-bugs@Berkeley.EDU' are intercepted
E 3
by a program which expects bug reports to conform to a standard format.
.I Sendbug
is a shell script to help the user compose and mail bug reports
in the correct format.
.I Sendbug
D 3
works by invoking
.IR vi (1)
E 3
I 3
works by invoking the editor specified by the environment variable
.I EDITOR
E 3
on a temporary copy of the bug report format outline. The user must fill in the
D 3
appropriate fields and exit
.IR vi .
E 3
I 3
appropriate fields and exit the editor.  The default editor is
.IR vi (1).
E 3
.I Sendbug
D 3
then mails the completed report to `4bsd-bugs@BERKELEY' or the address
E 3
I 3
then mails the completed report to `4bsd-bugs@Berkeley.EDU' or the address
E 3
specified on the command line.
.SH FILES
.nf
.ta \w'/usr/ucb/bugformat       'u
/usr/ucb/bugformat	contains the bug report outline
.fi
.SH "SEE ALSO"
D 4
vi(1),
I 3
environ(7),
E 3
sendmail(8)
E 4
I 4
vi(1), environ(7), bugfiler(8), sendmail(8)
E 4
E 1
