abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.sort.1
h26546
s 00001/00002/00155
d D 6.4 87/09/30 09:33:37 bostic 6 5
c remove ^H's; bug report 4.3BSD/man/4
e
s 00002/00001/00155
d D 6.3 87/04/25 14:17:28 bostic 5 4
c bug report 4.2BSd/man/34
e
s 00001/00001/00155
d D 6.2 86/07/07 11:12:35 bloom 4 3
c fix underlining
e
s 00001/00001/00155
d D 6.1 85/04/29 17:57:03 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00028/00051/00128
d D 5.1 85/04/29 17:56:48 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00179/00000/00000
d D 4.1 85/04/29 17:56:37 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH SORT 1 
E 2
I 2
D 3
.TH SORT 1 "10 February 1983"
E 3
I 3
.TH SORT 1 "%Q%"
E 3
E 2
.AT 3
.SH NAME
sort \- sort or merge files
.SH SYNOPSIS
.B sort
[
D 6
.if t \fB\-mubdf\&inrt\fIx\fR
D 4
.if n -mubdfinrt_________x
E 4
I 4
.if n -_m_u_b_d_f_i_n_r_tx
E 6
I 6
.I -mubdfinrtx
E 6
E 4
]
[ \fB+\fIpos1 \fR [ \fB\-\fIpos2 \fR]
] ...
[ 
.B \-o 
name ] [
.B \-T
directory ] [ name ] ...
.SH DESCRIPTION
.I Sort
D 2
sorts
lines of all the named files together
and writes the result on
the standard output.
The name `\-' means
the standard input.
E 2
I 2
sorts lines of all the named files together and writes the result on
the standard output.  The name `\-' means the standard input.
E 2
If no input files are named, the standard input is sorted.
D 2
.PP
E 2
I 2
.LP
E 2
The default sort key is an entire line.
D 2
Default ordering is
lexicographic by bytes in machine
collating sequence.
E 2
I 2
Default ordering is lexicographic by bytes in machine collating sequence.
E 2
The ordering is affected globally by the following options,
one or more of which may appear.
.TP 5
.B  b
Ignore leading blanks (spaces and tabs) in field comparisons.
.TP 5
.B  d
`Dictionary' order: only letters, digits and blanks
are significant in comparisons.
.TP 5
.B  f
D 2
Fold upper case
letters onto lower case.
E 2
I 2
Fold upper case letters onto lower case.
E 2
.TP 5
.B  i
D 2
Ignore characters outside the ASCII range 040-0176
in nonnumeric comparisons.
E 2
I 2
Ignore characters outside the ASCII range 040-0176 in nonnumeric comparisons.
E 2
.TP 5
.B  n
D 2
An initial numeric string,
consisting of optional blanks, optional minus sign,
E 2
I 2
An initial numeric string, consisting of optional blanks, optional minus sign,
E 2
and zero or more digits with optional decimal point,
D 2
is sorted by arithmetic value.
Option
E 2
I 2
D 5
is sorted by arithmetic value.  Option
E 5
I 5
is sorted by arithmetic value.  (Note that \fB-0\fP is considered equal
to \fB0\fP.) Option
E 5
E 2
.B n
implies option
.B b.
.TP 5
.B  r
Reverse the sense of comparisons.
.TP 5
.BI t x
`Tab character' separating fields is
.IR x .
D 2
.PP
E 2
I 2
.LP
E 2
The notation
.BI + "pos1 " "\-\fIpos2"
restricts a sort key to a field beginning at
.I pos1
and ending just before
.IR pos2 .
.I Pos1
and
.I pos2
each have the form
.IB m . n\fR,
optionally followed by one or more of the flags
.B bdf\&inr,
where
.I m
tells a number of fields to skip from the beginning of the line and
.I n
tells a number of characters to skip further.
If any flags are present they override all the global
D 2
ordering options for this key.
If the
E 2
I 2
ordering options for this key.  If the
E 2
.B b
option is in effect
.I n
is counted from the first nonblank in the field;
.B b
is attached independently to 
.IR pos2 .
D 2
A missing
\&\fB.\fIn\fR
means .0;
a missing
E 2
I 2
A missing \&\fB.\fIn\fR means .0; a missing
E 2
.BI \- pos2
D 2
means the end of the line.
Under the
E 2
I 2
means the end of the line.  Under the
E 2
.BI \-t x
option, fields are strings separated by
.IR x ;
D 2
otherwise fields are
nonempty nonblank strings separated by blanks.
.PP
E 2
I 2
otherwise fields are nonempty nonblank strings separated by blanks.
.LP
E 2
When there are multiple sort keys, later keys
D 2
are compared only after all earlier keys
compare equal.
Lines that otherwise compare equal are ordered
with all bytes significant.
.PP
E 2
I 2
are compared only after all earlier keys compare equal.
Lines that otherwise compare equal are ordered with all bytes significant.
.LP
E 2
These option arguments are also understood:
.TP 5
.B c
Check that the input file is sorted according to the ordering rules;
give no output unless the file is out of sort.
.TP 5
.B  m
Merge only, the input files are already sorted.
.TP 5
.B  o
The next argument is the name of an output file
to use instead of the standard output.
This file may be the same as one of the inputs.
.TP 5
.B T
The next argument is the name of a directory in which temporary files
should be made.
.TP 5
.B  u
D 2
Suppress all but one in each
set of equal lines.
Ignored bytes
and bytes outside keys
do not participate in
this comparison.
.PP
.B Examples.
Print in alphabetical order all the unique spellings
in a list of words.
E 2
I 2
Suppress all but one in each set of equal lines.
Ignored bytes and bytes outside keys do not participate in this comparison.
.SH EXAMPLES
.LP
Print in alphabetical order all the unique spellings in a list of words.
E 2
Capitalized words differ from uncapitalized.
D 2
.PP
E 2
I 2
.LP
E 2
.ti +8
sort \-u +0f +0 list
D 2
.PP
E 2
I 2
.LP
E 2
Print the password file
.RI ( passwd (5))
sorted by user id number (the 3rd colon-separated field).
D 2
.PP
E 2
I 2
.LP
E 2
.ti +8
sort \-t: +2n /etc/passwd
D 2
.PP
E 2
I 2
.LP
E 2
Print the first instance of each month in an already sorted file
of (month day) entries.
The options
.B \-um
with just one input file make the choice of a
unique representative from a set of equal lines predictable.
D 2
.PP
E 2
I 2
.LP
E 2
.ti +8
sort \-um +0 \-1 dates
.SH FILES
/usr/tmp/stm*, /tmp/*	first and second tries for
temporary files
.SH "SEE ALSO"
uniq(1),
comm(1),
rev(1),
join(1)
.SH DIAGNOSTICS
Comments and exits with nonzero status for various trouble
conditions and for disorder discovered under option
.BR \-c .
.SH BUGS
Very long lines are silently truncated.
E 1
