abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.tset.1
h63999
s 00017/00008/00410
d D 6.2 86/05/05 22:13:24 bloom 4 3
c add bug from reset manual page, document setable interrupt character, 
c fix summary of reset
e
s 00029/00020/00389
d D 6.1 85/04/29 19:42:23 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00269/00080/00140
d D 5.1 85/04/29 19:41:38 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00220/00000/00000
d D 4.1 85/04/29 19:40:56 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH TSET 1 4/1/81
E 2
I 2
D 3
.\"	@(#)tset.1	1.2
.TH TSET 1 "16 October 1982"
E 3
I 3
.TH TSET 1 "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 2
tset \- set terminal modes
E 2
I 2
tset \- terminal dependent initialization
E 2
.SH SYNOPSIS
.B tset
D 2
[
options
] [
E 2
I 2
[ options ] [
E 2
.B \-m
D 2
[\fIident\fP][\fItest
.IR baudrate ]:\fItype
E 2
I 2
[ident][test baudrate]:type ] \&... [ type ]
.sp 1
.B reset
E 2
D 4
\&...
E 4
I 4
[ options ] [
.B \-m
[ident][test baudrate]:type ] \&... [ type ]
E 4
D 2
] [
type
]
E 2
.SH DESCRIPTION
.I Tset
D 2
causes terminal dependent processing such as setting
E 2
I 2
sets up your terminal when you first log in to a UNIX system.
It does terminal dependent processing such as setting
E 2
erase and kill characters, setting or resetting delays,
I 2
sending any sequences needed to properly initialized the terminal,
E 2
and the like.
It first determines the
.I type
D 2
of terminal involved, names for which are specified by the
.I /etc/termcap
data base, and then
does necessary initializations and mode settings.
In the case where no argument types are specified,
E 2
I 2
of terminal involved,
and then does necessary initializations and mode settings.
The type of terminal attached to each \s-2UNIX\s0 port is specified in the
D 3
.I /etc/ttytype
E 3
I 3
.IR /etc/ttys (5)
E 3
database.
Type names for terminals may be found in the
.IR termcap (5)
database.
If a port is not wired permanently to a specific terminal (not hardwired)
it will be given an appropriate generic identifier such as
.IR dialup .
.PP
In the case where no arguments are specified,
E 2
.I tset
simply reads the terminal type out of the environment variable TERM
and re-initializes the terminal.  The rest of this manual concerns
D 2
itself with type initialization, done typically once at login, and options
E 2
I 2
itself with mode and environment initialization,
typically done once at login, and options
E 2
used at initialization time to determine the terminal type and set up
terminal modes.
.PP
D 2
When used in a startup script
.I \&.profile
(for
E 2
I 2
When used in a startup script (\fI\&.profile\fR for
E 2
.IR sh (1)
D 2
users) or
E 2
I 2
users or
E 2
.I \&.login
D 2
(for
E 2
I 2
for
E 2
.IR csh (1)
D 2
users) it is desirable to give information about the types of terminal
usually used on terminals which are not hardwired.
These ports are initially identified as being
E 2
I 2
users) it is desirable to give information about the type of terminal
you will usually use on ports which are not hardwired.
These ports are identified in
D 3
.I /etc/ttytype
E 3
I 3
.I /etc/ttys
E 3
as
E 2
.I dialup
or
.I plugboard
or
D 2
.I arpanet
E 2
I 2
.I arpanet,
E 2
etc.
To specify
D 2
what terminal type is usually used on these ports
E 2
I 2
what terminal type you usually use on these ports, the
E 2
.B \-m
D 2
is followed by the appropriate port type identifier,
an optional baud-rate specification,
and the terminal type to be used if the mapping conditions are satisfied.
E 2
I 2
(map) option flag is followed by the appropriate port type identifier,
an optional baud rate specification,
and the terminal type.
(The effect is to ``map'' from some conditions to a terminal type,
that is, to tell
.I tset
``If I'm on this kind of port, guess that I'm on that kind of terminal''.)
E 2
If more than one mapping is specified, the first applicable mapping prevails.
D 2
A missing type identifier matches all identifiers.
E 2
I 2
A missing port type identifier matches all identifiers.
Any of the alternate generic names given in
.I termcap
may be used for the identifier.
E 2
.PP
D 2
Baud rates are specified as with
E 2
I 2
A
.I baudrate
is specified as with
E 2
.IR stty (1),
D 2
and are compared with the
speed of the diagnostic output (which is almost always the control terminal).
The baud rate test may be any combination of:
.B >,
.B =,
.B <,
.B @,
E 2
I 2
and is compared with the
speed of the diagnostic output (which should be the control terminal).
The baud rate
.I test
may be any combination of:
.BR > ,
.BR @ ,
.BR < ,
E 2
and
D 2
.B !;
E 2
I 2
.BR ! ;
E 2
.B @
D 2
is a synonym for
.B =
E 2
I 2
means ``at''
E 2
and
.B !
inverts the sense of the test.  To avoid problems with metacharacters, it
is best to place the entire argument to
.B \-m
within ``\''' characters; users of
.IR csh (1)
must also put a ``\e'' before any ``!'' used here.
.PP
I 2
.KS
E 2
Thus
.IP
D 2
tset \-m  \'dialup>300:adm3a\'  \-m  dialup:dw2  \-m  \'plugboard:?adm3a\'
E 2
I 2
tset \-m \'dialup>300:adm3a\' -m dialup:dw2 -m \'plugboard:?adm3a\'
.KE
E 2
.LP
causes the terminal type to be set to an
.I adm3a
if the port in use is a dialup at a speed greater than 300 baud;
to a 
.I dw2
if the port is (otherwise) a dialup (i.e. at 300 baud or less).
I 2
(\fBNOTE:\fP the examples given here appear to take up more than
one line, for text processing reasons.  When you type in real
.I tset
commands, you must enter them entirely on one line.)
E 2
If the
.I type
D 2
above begins with a question mark,
E 2
I 2
finally determined by
.I tset
begins with a question mark,
E 2
the user is asked if s/he really wants that type.
A null response means to use that type;
otherwise, another type can be entered which will be used instead.
D 2
Thus, in this case, the user will be queried on a plugboard port
as to whether they are using an
.I adm3a.
For other ports the port type will be taken from the
/etc/ttytype file or a final, default
E 2
I 2
Thus, in the above case, the user will be queried on a plugboard port
as to whether they are actually using an
.IR adm3a .
.PP
If no mapping applies and a final
E 2
.I type
D 2
option may be given on the command line not preceded by a
.B \-m.
E 2
I 2
option, not preceded by a
.BR \-m ,
is given on the command line
then that type is used;
D 3
otherwise the identifier found in the
.I /etc/ttytype
E 3
I 3
otherwise the type found in the
.I /etc/ttys
E 3
database will be taken to be the terminal type.
This should always be the case for hardwired ports.
E 2
.PP
D 2
It is often desirable to return the terminal type, as specified by the
.B \-m
options, and information about the terminal
E 2
I 2
It is usually desirable to return the terminal type, as finally determined by
.IR tset ,
and information about the terminal's capabilities
E 2
to a shell's environment.  This can be done using the
D 2
.B \-s
E 2
I 2
.B \-
E 2
option; using the Bourne shell,
.IR sh (1):
.IP
D 2
eval \`tset \-s \fIoptions...\fR\`
E 2
I 2
export TERM; TERM=\`tset \- \fIoptions...\fR\`
E 2
.LP
or using the C shell,
.IR csh (1):
.IP
D 2
set noglob; eval \`tset \-s \fIoptions...\fR\`
E 2
I 2
setenv TERM \`tset - \fIoptions...\fR\`
E 2
.PP
I 2
With
.I csh
D 3
it is convenient to make an alias in your .cshrc:
E 3
I 3
it is preferable to use the following command in your .login file to
initialize the TERM and TERMCAP environment variables at the same time.
.IP
eval \`tset -s \fIoptions...\fR\`
E 3
.PP
D 3
.RS
alias tset \'setenv TERM \`tset \- \e!*\`\'
.RE
Either of these aliases allow the command
.RS
E 3
I 3
It is also convenient to make an alias in your .cshrc:
.IP
alias tset \'eval \`tset \-s \e!*\`\'
.PP
This allows the command:
.IP
E 3
tset 2621
D 3
.RE
to be invoked at any time from your login csh.
E 3
I 3
.PP
to be invoked at any time to set the terminal and environment.
E 3
.B "Note to Bourne Shell users:"
It is
.B not
possible to get this aliasing effect with a shell script,
because shell scripts cannot set the environment of their parent.
(If a process could set its parent's environment,
none of this nonsense would be necessary in the first place.)
.PP
E 2
These commands cause
.I tset
D 2
to generate as output a sequence of shell commands which place the variables
TERM and TERMCAP in the environment; see
.IR environ (5).
E 2
I 2
to place the name of your terminal in the variable
TERM in the environment; see
.IR environ (7).
E 2
.PP
Once the terminal type is known,
.I tset
D 2
engages in terminal mode setting.
E 2
I 2
engages in terminal driver mode setting.
E 2
This normally involves sending an initialization sequence to the
D 2
terminal and setting the single character erase (and optionally
the line-kill (full line erase)) characters.
E 2
I 2
terminal, setting the single character erase (and optionally
the line-kill (full line erase)) characters,
and setting special character delays.
Tab and newline expansion are turned off during transmission of
the terminal initialization sequence.
E 2
.PP
On terminals that can backspace but not overstrike
(such as a \s-2CRT\s0),
and when the erase character is the default erase character
(`#' on standard systems),
D 2
the erase character is changed to a Control-H
(backspace).
E 2
I 2
the erase character is changed to \s-2BACKSPACE\s0 (Control-H).
E 2
.PP
The options are:
.TP
D 2
.B \-e
E 2
I 2
.B \-e\fIc
E 2
set the erase character to be the named character
.I c
on all terminals,
the default being the backspace character on the terminal, usually ^H.
I 2
The character
.I c
can either be typed directly, or entered using the hat
notation used here.
E 2
.TP
D 2
.B \-k
E 2
I 2
.B \-k\fIc
E 2
is similar to
.B \-e
but for the line kill character rather than the erase character;
.I c
D 2
defaults to ^X (for purely historical reasons); ^U is the preferred setting.
No kill processing is done if
E 2
I 2
defaults to ^X (for purely historical reasons).
The kill characters is left alone if
E 2
.B \-k
is not specified.
I 2
The hat notation can also be used for this option.
E 2
.TP
I 4
.B \-i\fIc
is similar to
.B \-e
but for the interrupt character rather than the erase character;
.I c
defaults to ^C.  The hat notation can also be used for this option.
.TP
E 4
I 2
.B \-
The name of the terminal finally decided upon is output on the
standard output.
This is intended to be captured by the shell and placed in the
environment variable TERM.
.TP
I 3
.B \-s
Print the sequence of
.I csh
commands to initialize the environment variables TERM and TERMCAP based on
the name of the terminal finally decided upon.
.TP
E 3
.B \-n
On systems with the Berkeley 4BSD tty driver,
specifies that the new tty driver modes should be initialized for this terminal.
For a \s-2CRT\s0,
the CRTERASE and CRTKILL
modes are set only if the baud rate is 1200 or greater.
See tty(4) for more detail.
.TP
E 2
.B \-I
D 2
supresses outputting terminal initialization strings.
E 2
I 2
suppresses transmitting terminal initialization strings.
E 2
.TP
.B \-Q
D 2
supresses printing the
E 2
I 2
suppresses printing the
E 2
``Erase set to'' and ``Kill set to'' messages.
D 2
.TP
.B \-S
Outputs the strings to be assigned to
TERM and TERMCAP in the environment rather than commands for a shell.
E 2
I 2
.PP
If
.B tset
is invoked as
.BR reset ,
it will set cooked and echo modes, turn off cbreak and raw modes,
turn on newline translation, and restore special characters
to a sensible state before any terminal dependent processing is done.
Any special character that is found to be \s-2NULL\s0
D 4
or ``\-1'' is reset to its default value.
E 4
I 4
or ``\-1'' is reset to its default value.  All arguments to
.I tset
may be used with reset.
E 4
.PP
This is most useful after a program dies leaving a terminal in a funny
state. You may have to type ``\s-2<LF>\s0reset\s-2<LF>\s0'' to get it to work
since \s-2<CR>\s0 may not work in this state. Often none of this will echo.
.SH EXAMPLES
.PP
These examples all assume the Bourne shell and use the - option.
If you use
.IR csh ,
use one of the variations described above.
Note that a typical use of
.I tset
in a .profile or .login will also use the
.B \-e
and
.B \-k
options, and often the
.B \-n
or
.B \-Q
options as well.
These options have not been included here to keep the examples small.
(\fBNOTE:\fP some of the examples given here appear to take up more than
one line, for text processing reasons.  When you type in real
.I tset
commands, you must enter them entirely on one line.)
.PP
At the moment, you are on a 2621.
This is suitable for typing by hand but
not for a .profile, unless you are
.I always
on a 2621.
.IP
export TERM; TERM=\`tset \- 2621\`
.PP
You have an h19 at home which you dial up on, but your office terminal
D 3
is hardwired and known in /etc/ttytype.
E 3
I 3
is hardwired and known in /etc/ttys.
E 3
.IP
export TERM; TERM=\`tset \- \-m dialup:h19\`
.PP
You have a switch which connects everything to everything, making
it nearly impossible to key on what port you are coming in on.
You use a vt100 in your office at 9600 baud, and dial up to switch
ports at 1200 baud from home on a 2621.
Sometimes you use someone elses terminal at work,
so you want it to ask you to make sure what terminal
type you have at high speeds, but at 1200 baud you are
always on a 2621.
Note the placement of the question mark, and the quotes
to protect the greater than and question mark from
interpretation by the shell.
.IP
export TERM; TERM=\`tset \- \-m 'switch>1200:?vt100' \-m 'switch<=1200:2621'
.PP
All of the above entries will fall back on the terminal type
specified in
D 3
.I /etc/ttytype
E 3
I 3
.I /etc/ttys
E 3
if none of the conditions hold.
The following entry is appropriate if
you always dial up, always at the same baud rate,
on many different kinds of terminals.
Your most common terminal is an adm3a.
It always asks you what kind of terminal you are on,
defaulting to adm3a.
.IP
export TERM; TERM=\`tset \- \?adm3a\`
.PP
If the file
D 3
.I /etc/ttytype
E 3
I 3
.I /etc/ttys
E 3
is not properly installed and you want to
key entirely on the baud rate, the following can be used:
.IP
export TERM; TERM=\`tset \- \-m '>1200:vt100' 2621\`
.PP
Here is a fancy example to illustrate the power of
.I tset
and to hopelessly confuse anyone who has made it this far.
You dial up at 1200 baud or less on a concept100,
sometimes over switch ports and sometimes over regular dialups.
You use various terminals at speeds higher than 1200 over switch ports,
most often the terminal in your office, which is a vt100.
However, sometimes you log in from the university you used to go to,
over the ARPANET; in this case you are on an ALTO emulating a dm2500.
You also often log in on various hardwired ports, such as the console,
all of which are properly entered in
D 3
.IR /etc/ttytype .
E 3
I 3
.IR /etc/ttys .
E 3
You want your erase character set to control H,
your kill character set to control U,
and don't want
.I tset
to print the ``Erase set to Backspace, Kill set to Control U'' message.
.IP
export TERM; TERM=\`tset \-e \-k^U \-Q \- \-m 'switch<=1200:concept100' \-m 'switch:?vt100' \-m dialup:concept100 \-m arpanet:dm2500\`
E 2
.SH FILES
.DT
D 2
/etc/ttytype		terminal id to type map database
E 2
I 2
D 3
/etc/ttytype	port name to terminal type mapping database
E 3
I 3
/etc/ttys	port name to terminal type mapping database
E 3
E 2
.br
/etc/termcap	terminal capability database
.SH SEE\ ALSO
D 2
csh(1), setenv(1), sh(1), stty(1), environ(5), ttytype(5), termcap(5)
.SH AUTHOR
E 2
I 2
D 3
csh(1), sh(1), stty(1), ttytype(5), termcap(5), environ(7)
E 3
I 3
csh(1), sh(1), stty(1), ttys(5), termcap(5), environ(7)
E 3
D 4
.SH AUTHORS
E 2
Eric Allman
I 2
.br
David Wasley
.br
Mark Horton
E 4
E 2
.SH BUGS
D 2
Should be merged with
.IR stty (1).
E 2
I 2
.PP
The
.I tset
command is one of the first commands a user must master when getting
started on a UNIX system.
Unfortunately, it is one of the most complex,
largely because of the extra effort the user must go through
to get the environment of the login shell set.
Something needs to be done to make all this simpler,
either the
.IR login (1)
program should do this stuff,
or a default shell alias should be made,
or a way to set the environment of the parent should exist.
I 4
.PP
This program can't intuit personal choices for erase, interrupt
and line kill characters, so it leaves these set to the local system
standards.
E 4
.ig
E 2
.SH NOTES
For compatibility with earlier versions of
.I tset
a number of flags are accepted whose use is discouraged:
.TP 10
\fB\-d\fR type
equivalent to
.B \-m
dialup:type
.TP 10
\fB\-p\fR type
equivalent to
.B \-m
plugboard:type
.TP 10
\fB\-a\fR type
equivalent to
.B \-m
arpanet:type
.TP 10
\fB\-E\fR c
Sets the erase character to
.I c
only if the terminal can backspace.
.TP 10
\fB\-\fR
prints the terminal type on the standard output
.TP 10
\fB\-r\fR
prints the terminal type on the diagnostic output.
I 2
..
E 2
E 1
