abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.uptime.1
h10857
s 00001/00001/00022
d D 6.1 85/04/29 15:06:31 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00002/00003/00021
d D 5.1 85/04/29 15:06:24 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00024/00000/00000
d D 4.1 85/04/29 15:06:15 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH UPTIME 1 11/13/79
E 2
I 2
D 3
.TH UPTIME 1 "13 November 1979"
E 3
I 3
.TH UPTIME 1 "%Q%"
E 3
E 2
.UC
.SH NAME
uptime \- show how long system has been up
.SH SYNOPSIS
.B uptime
.SH DESCRIPTION
Uptime prints the current time, the length of time the system has been up,
and the average number of jobs in the run queue over the last 1, 5 and
15 minutes.
It is, essentially, the first line of a
D 2
.I w
(1)
E 2
I 2
.IR w (1)
E 2
command.
.SH FILES
/vmunix	system name list
.SH SEE ALSO
w(1)
E 1
