abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.uulog.1c
h39128
s 00057/00000/00000
d D 6.1 86/04/24 19:30:40 mckusick 1 0
c from rfg
e
u
U
t
T
I 1
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH UULOG 1C "%Q%"
.UC 6
.SH NAME
uulog \- display \s-1UUCP\s0 log files
.SH SYNOPSIS
.B uulog
[
.B \-s
.I sys
] [
.B \-u
.I user
]
.SH DESCRIPTION
.I Uulog
queries a log
of 
.IR uucp (1C)
and
.IR uux (1C)
transactions in the file
.B /usr/spool/uucp/\s-1LOGFILE.\s0
.PP
The options command 
.I uulog
to print logging information:
.TP 8
.BI \-s sys\^
Print information about work involving system
.IR sys .
.TP 8
.BI \-u user\^
Print information about work done for the specified
.IR user .
.SH FILES
/usr/spool/uucp/\s-1LOGFILE\s0
.SH SEE ALSO
uucp(1C), uux(1C).
.SH NOTES
Very early releases of \s-1UUCP\s0 used separate log files
for each of the \s-1UUCP\s0 utilities;
.I uulog
was used to merge the individual logs into a master file.
This capability has not been necessary for some time and is
no longer supported.
.SH BUGS
\s-1UUCP\s0's recording of which user issued a request is unreliable.
.PP
.I Uulog
is little more than an overspecialized version of
.IR grep (1).
E 1
