abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.uucp.1c
h01377
s 00087/00058/00102
d D 6.3 86/04/24 19:58:37 mckusick 5 4
c update from rfg
e
s 00035/00001/00125
d D 6.2 85/06/23 16:06:53 bloom 4 3
c update from rick adams
e
s 00001/00001/00125
d D 6.1 85/04/29 20:22:06 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00003/00003/00123
d D 5.1 85/04/29 20:21:41 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00126/00000/00000
d D 4.1 85/04/29 20:21:20 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH UUCP 1C
E 2
I 2
D 3
.TH UUCP 1C "18 January 1983"
E 3
I 3
.TH UUCP 1C "%Q%"
E 3
E 2
.AT 3
.SH NAME
D 5
uucp, uulog \- unix to unix copy
E 5
I 5
uucp \- unix to unix copy
E 5
.SH SYNOPSIS
.B uucp
D 5
[ option ] ...
source-file ...  destination-file
.PP
.B uulog
[ option ] ...
E 5
I 5
[
.B \-acCdfmr
] [
.BI \-n user
] [
.BI \-g grade
] [
.BI \-s spool
] [
.BI \-x debug
] source-file....  destination-file
E 5
.SH DESCRIPTION
.I Uucp
copies files named by the source-file arguments
to the destination-file argument.
D 5
A file name may be a path name on your machine, or may 
E 5
I 5
A file name may be a pathname on your machine, or may 
E 5
have the form
.IP
system-name!pathname
.LP
where `system-name' is taken from a list of system names
D 5
which
E 5
I 5
that
E 5
.I uucp
knows about.
Shell metacharacters ?*[] appearing in the pathname part
will be expanded on the appropriate system.
.PP
D 5
Pathnames may be one of
E 5
I 5
Pathnames may be one of:
E 5
.IP (1)
a full pathname;
.IP (2)
a pathname preceded by
D 5
.IR ~user ;
E 5
I 5
.BI ~ user;
E 5
where
.I user
is a userid on the specified system
and is replaced by that user's login directory;
.IP (3)
D 5
anything else is prefixed by the current directory.
E 5
I 5
a pathname prefixed by
.BR ~ ,
where
.B ~
is expanded into the system's public directory (usually /usr/spool/uucppublic);
.IP (4)
a partial pathname, which is prefixed by the current directory.
E 5
.PP
D 5
If the result is an erroneous pathname for the remote system
E 5
I 5
If the result is an erroneous pathname for the remote system,
E 5
the copy will fail.
If the destination-file is a directory, the last part of the
source-file name is used.
.ig
If a simple
.I ~user
destination is inaccessible to 
D 5
.I uucp,
E 5
I 5
.IR uucp ,
E 5
data is copied to a spool directory and the user
is notified by
.IR mail (1).
..
.PP
.I Uucp
preserves execute permissions across the transmission
and gives 0666 read and write permissions (see
.IR chmod (2)).
.PP
The following options are interpreted by
.IR uucp .
D 5
.TP 
.B \-d
Make all necessary directories for the file copy.
I 4
(This is the default.)
E 5
.TP
D 5
.B \-f
Don't make intermediate directories for the file copy.
E 5
I 5
.B \-a
Avoid doing a
.I getwd
to find the current directory.
(This is sometimes used for efficiency.)
E 5
E 4
.TP 
.B \-c
Use the source file when copying out rather than
copying the file to the spool directory.
I 4
(This is the default.)
.TP
.B \-C
Copy the source file to the spool directory and transmit
the copy.
E 4
.TP 
I 5
.B \-d
Make all necessary directories for the file copy.
(This is the default.)
.TP
.B \-f
Do not make intermediate directories for the file copy.
.TP
.BI \-g grade
.I Grade
is a single letter/number; lower ASCII sequence characters
will cause a job to be transmitted earlier during a particular conversation.
Default is `n'. By way of comparison,
.IR uux (1C)
defaults to `A'; mail is usually sent at `C'.
.TP 
E 5
.B \-m
Send mail to the requester when the copy is complete.
I 4
.TP
D 5
.B \-a
Avoid doing a getwd to find the current directory.
(This is sometimes used for efficiency.)
.TP
E 5
.BI \-n user
Notify
.I user
D 5
on remote system that a file was sent.
E 5
I 5
on remote system (i.e., send
.I user
mail) that a file was sent.
E 5
.TP
.B \-r
D 5
Don't start the transfer, just queue the job.
E 5
I 5
Do not start the transfer, just queue the job.
E 5
.TP
D 5
.BI \-g grade
Grade is a single letter/number; lower ASCII sequence characters
will cause a job to be transmitted earlier during a particular conversation.
.TP
E 5
.BI \-s spool
Use
.I spool
as the spool directory instead of the default.
.TP
.BI \-x debug
Turn on the debugging at level
.I debug.
E 4
D 5
.PP
.I Uulog
maintains a summary log
of 
.I uucp
and
D 2
.IR uux (1)
E 2
I 2
.IR uux (1C)
E 2
transactions in the file
`/usr/spool/uucp/LOGFILE' by gathering
information from partial log files named `/usr/spool/uucp/LOG.*.?'.
D 4
It removes the partial log files.
E 4
I 4
It removes the partial log files. [This feature is no longer necessary.]
E 4
.PP
The options cause 
.I uulog 
to print logging information:
.TP
.BI \-s sys
Print information about work involving system
.I sys.
.TP
.BI \-u user
Print information about work done for the specified
.I user.
E 5
.SH FILES
/usr/spool/uucp - spool directory
.br
/usr/lib/uucp/* - other data and program files
.SH SEE ALSO
D 2
uux(1), mail(1)
E 2
I 2
uux(1C), mail(1)
E 2
D 5
.br
E 5
I 5
.PP
D. A. Nowitz and M. E. Lesk,
.IR "A Dial-Up Network of UNIX Systems" .
.PP
E 5
D. A. Nowitz,
D 5
.I Uucp Implementation Description
E 5
I 5
.IR "Uucp Implementation Description" .
E 5
.SH WARNING
The domain of remotely accessible files can
(and for obvious security reasons, usually should)
be severely restricted.
You will very likely not be able to fetch files
by pathname;
ask a responsible person on the remote system to
send them to you.
For the same reasons you will probably not be able
to send files to arbitrary pathnames.
.SH BUGS
.br
All files received by
.I uucp
D 5
will be owned by uucp.
.br
The \-m option will only work sending files or receiving
E 5
I 5
will be owned by the uucp administrator (usually UID 5).
.PP
The 
.B \-m
option will only work sending files or receiving
E 5
a single file.
(Receiving multiple files specified by special shell
characters ?*[] will not activate
D 5
the \-m option.)
E 5
I 5
the
.B \-m
option.)
.PP
At present
.I uucp
cannot copy to a system several "hops" away, that is, a command of
the form
.PP
.nf
	uucp myfile system1!system2!system3!yourfile
.fi
.PP
is not permitted. Use
.IR uusend (1C)
instead.
.PP
When invoking
.I uucp
from
.IR csh (1),
the `!' character must be prefixed by the `\e' escape to inhibit
.IR csh 's
history mechanism. (Quotes are not sufficient.)
.PP
.I Uucp
refuses to copy a file that does not give read access to ``other'';
that is, the file must have at least 0444 modes.
E 5
E 1
