abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.uux.1c
h47432
s 00086/00036/00130
d D 6.3 86/04/24 19:57:41 mckusick 6 5
c update from rfg
e
s 00125/00047/00041
d D 6.2 85/06/24 12:35:07 bloom 5 3
c update from rick adams
e
s 00125/00047/00041
d R 6.2 85/06/24 12:29:17 bloom 4 3
c update from rick adams
e
s 00001/00001/00087
d D 6.1 85/04/29 20:24:27 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00007/00006/00081
d D 5.1 85/04/29 20:24:08 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00087/00000/00000
d D 4.1 85/04/29 20:23:43 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH UUX 1C
E 2
I 2
D 3
.TH UUX 1C "18 January 1983"
E 3
I 3
.TH UUX 1C "%Q%"
E 3
E 2
.AT 3
.SH NAME
uux \- unix to unix command execution
.SH SYNOPSIS
.B uux
[
D 5
.B \-
E 5
I 5
D 6
options
E 6
I 6
.B -
] [
.B -cClLnprz
] [
.BI -a name
] [
.BI -g grade
] [
.BI -x debug
E 6
E 5
]
command-string
.SH DESCRIPTION
D 5
.I Uux
will gather 0 or more files from various systems,
E 5
I 5
.I Uux\^
will gather zero or more files from various systems,
E 5
execute a command on a specified system
D 5
and send standard output to a file on a specified
E 5
I 5
and then send standard output to a file on a specified
E 5
system.
I 5
D 6
Note that, for security reasons, many installations will
limit the list of
commands executable on behalf of an incoming request from
.IR uux .
Many sites will permit little more than
the receipt of mail (see
.IR mail (1))
via 
.IR uux .
E 6
E 5
.PP
D 5
The command-string is made up of one or more arguments that look
like a shell command line,
E 5
I 5
D 6
The \fIcommand-string\fP is made up of one or more arguments that look
E 6
I 6
The
.I command-string
is made up of one or more arguments that look
E 6
like a Shell command line,
E 5
except that the command and file names
D 5
may be prefixed by system-name!.
A null system-name is interpreted as the local system.
E 5
I 5
may be prefixed by
.IB system-name !\fR.\fP
A null \fIsystem-name\fP is interpreted as the local system.
E 5
.PP
File names may be one of
.IP
D 5
(1) a full pathname;
E 5
I 5
(1) a full path name;
E 5
.IP
D 5
(2) a pathname preceded by
.IR ~xxx ;
E 5
I 5
(2) a path name preceded by
D 6
.BI ~ xxx\^
E 6
I 6
.BI ~ user
E 6
E 5
where
D 5
.I xxx
is a userid on the specified system
E 5
I 5
D 6
.I xxx\^
E 6
I 6
.I user
E 6
is a login name on the specified system
E 5
and is replaced by that user's login directory;
D 6
.br
E 6
.IP
D 6
(3) anything else is prefixed by the current directory.
E 6
I 6
(3) a path name prefixed by
.BR ~;
where
.B ~
is expanded to the system's public directory (usually /usr/spool/uucppublic);
.IP
(4) a partial pathname, which is prefixed by the current directory.
E 6
.PP
D 5
The `\-' option will cause the standard input to the
.I uux
command to be the standard input to the command-string.
.PP
For example, the command
E 5
I 5
As an example, the command
E 5
.IP
D 5
uux "!diff usg!/usr/dan/f1 pwba!/a4/dan/f1 > !fi.diff"
E 5
I 5
uux "\^!diff usg!/usr/dan/file1 pwba!/a4/dan/file2 > !~/dan/file.diff\^"
E 5
.PP
D 5
will get the f1 files from the usg and pwba machines,
E 5
I 5
will get the \fBfile1\fP and \fBfile2\fP files
from the ``usg'' and ``pwba'' machines,
E 5
execute a
D 5
.I diff
E 5
I 5
D 6
.I diff\^
E 6
I 6
.IR diff (1)
E 6
E 5
command
D 5
and put the results in f1.diff in the local directory.
E 5
I 5
and put the results in \fBfile.diff\fP in the 
D 6
local PUBDIR/dan/ directory.
E 6
I 6
local /usr/spool/uucppublic/dan/ directory.
E 6
E 5
.PP
D 5
Any special shell characters such as <>;| should be quoted either
by quoting the entire command-string, or quoting the special
E 5
I 5
D 6
Any special shell characters such as \fB<>;|\fP should be quoted either
E 6
I 6
Any special shell characters, such as \fB<>;|\fP, should be quoted either
E 6
by quoting the entire \fIcommand-string\fP, or quoting the special
E 5
characters as individual arguments.
I 5
.PP
D 6
.I Uux\^
E 6
I 6
.I Uux
E 6
will attempt to get all files to the execution system.
For files that are output files, the file name must be escaped using
parentheses.
For example, the command
.IP
uux a!wc b!/usr/file1 \\(c!/usr/file2 \\)
.PP
get \fB/usr/file1\fP from system ``b'' and send it to system ``a'',
perform a \fIwc\fP command on that file
and send the result of the 
.I wc
command to system ``c''.
.PP
.I Uux\^
will notify you by mail if the requested command on the remote
system was disallowed.
This notification can be turned off by the \fB\-n\fP option.
.PP
The following \fIoptions\fP are interpreted by
.IR uux :
.TP .5i
.B \-
The standard input to
.I uux
is made the standard input to the
.IR command-string .
.TP .5i
.BI \-a name
Use
.I name
as the user identification replacing the initiator user-id.
.TP .5i
.B \-c
D 6
Don't copy local file to the spool directory for transfer to the remote
machine (This is the default).
E 6
I 6
Do not copy local file to the spool directory for transfer to the remote
machine (this is the default).
E 6
.TP .5i
.B \-C
Force the copy of local files to the spool directory for transfer.
.TP .5i
.BI \-g grade
D 6
Grade is a single letter/number;
lower ASCII sequence characters will cause the job to be transmitted
earlier during a particular conversation.
E 6
I 6
.I Grade
is a single letter/number, from
.B 0
to
.BR 9 ,
.B A
to
.BR Z ,
or
.B a
to
.BR z ;
.B 0
is the highest, and
.B z
is the lowest grade.
The default is 
.BR A ;
by comparison
.IR uucp (1C)
defaults to
.B n
and mail is usually sent at grade
.BR C .
Lower grades should be specified for high-volume jobs, such as news.
E 6
.TP .5i
.B \-l
Try and make a link from the original file to the spool directory.
D 6
If the link can not be made, copy the file.
E 6
I 6
If the link cannot be made, copy the file.
E 6
.TP .5i
.B \-n
D 6
Do not notify the user if the comand fails.
E 6
I 6
Do not notify the user when the command completes.
E 6
.TP .5i
.B \-p
Same as \-:
The standard input to
.I uux
is made the standard input to the
.IR command-string .
.TP .5i
.B \-r
D 6
Don't start the file transfer, just queue the job.
E 6
I 6
Do not start the file transfer, just queue the job.
E 6
.TP .5i
.BI \-x debug
Produce debugging output on stdout.
The debug is a number between 0 and 9;
D 6
higher numbers give more detailed information.
E 6
I 6
higher numbers give more detailed information. Debugging is permitted
only for privileged users (specifically, those with read access to
.IR L.sys (5) .
E 6
.TP .5i
.B \-z
D 6
Notify the user if the command succeeds.
E 6
I 6
Notify the user only if the command fails.
E 6
.TP .5i
.B \-L
D 6
Start up uucico with the \fI-L\fP flag. This will force
calls to be made to local sites only. (See \fIuucico(8C)\fP)
\fI-L\fP can be used as a alternative to \fI-r\fP if
you are trying to save some money on phone costs.
E 6
I 6
Start up
.I uucico
with the \fB-L\fP flag. This will force
calls to be made to local sites only (see
.IR uucico (8C)).
E 6
E 5
.SH FILES
D 2
/usr/uucp/spool - spool directory
E 2
I 2
D 5
.DT
/usr/spool/uucp	spool directory
E 2
.br
D 2
/usr/uucp/* - other data and programs
E 2
I 2
/usr/lib/uucp/*	other data and programs
E 5
I 5
.PD 0
.TP 22
/usr/spool/uucp
spool directories
.TP
/usr/lib/uucp/\(**
D 6
other data and programs
E 6
I 6
UUCP configuration data and daemons
E 6
.PD
E 5
E 2
.SH SEE ALSO
D 2
uucp(1)
E 2
I 2
D 5
uucp(1C)
E 2
.br
D. A. Nowitz,
.I Uucp Implementation Description
.SH WARNING
An installation may, and for security reasons
generally will, limit the list of
commands executable on behalf of an incoming request from
D 2
.I uux.
E 2
I 2
.IR uux .
E 2
Typically, a restricted site will permit little other than
the receipt of mail via 
D 2
.I uux.
E 2
I 2
.IR uux .
E 5
I 5
D 6
uucp(1C).
E 6
I 6
uucp(1C), uucico(8C), uuxqt(8C).
.SH WARNING
For security reasons, many installations will
limit the list of
commands executable on behalf of an incoming request from
.IR uux .
Many sites will permit little more than
the receipt of mail (see
.IR mail (1))
via 
.IR uux .
E 6
E 5
E 2
.SH BUGS
Only the first command of a shell pipeline may
D 5
have a system-name!.
E 5
I 5
have a
.IB system-name !\fR.
E 5
All other commands are executed on the system of the first
command.
D 6
.br
E 6
I 6
.PP
E 6
The use of the shell metacharacter
D 5
.B *
E 5
I 5
.B \(**
E 5
will probably not do what you want it to do.
I 6
.PP
E 6
D 5
.br
The shell tokens << and >> are not implemented.
.br
There is no notification of denial of execution
on the remote machine.
E 5
I 5
The shell tokens
.B <<
and
.B >>
are not implemented.
I 6
.PP
When invoking
.I uux
from
.IR csh (1),
the `!' character must be prefixed by the `\\' escape to inhibit
.IR csh 's
history mechanism. (Quotes are not sufficient.)
E 6
E 5
E 1
