abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.whereis.1
h61650
s 00000/00002/00081
d D 6.2 86/05/07 13:30:07 mckusick 4 3
c delete author
e
s 00001/00001/00082
d D 6.1 85/04/29 15:11:29 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00082
d D 5.1 85/04/29 15:11:22 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00083/00000/00000
d D 4.1 85/04/29 15:11:14 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH WHEREIS 1 2/24/79
E 2
I 2
D 3
.TH WHEREIS 1 "24 February 1979"
E 3
I 3
.TH WHEREIS 1 "%Q%"
E 3
E 2
.UC
.SH NAME
whereis \- locate source, binary, and or manual for program
.SH SYNOPSIS
.B whereis
[
.B \-sbm
] [
.B \-u
] [
.B \-SBM
dir ...
.B \-f
] name ...
.SH DESCRIPTION
.I Whereis
locates source/binary and manuals sections for specified files.
The supplied names are first stripped of leading pathname components
and any (single) trailing extension of the form ``.ext'', e.g. ``.c''.
Prefixes of ``s.'' resulting from use of source code control are also
dealt with.
.I Whereis
then attempts to locate the desired program in a list of standard places.
If any of the
.B \-b,
.B \-s
or
.B \-m
flags are given then
.I whereis
searches only for binaries, sources or manual sections respectively
(or any two thereof).
The
.B \-u
flag may be used to search for unusual entries.
A file is said to be unusual if it does not have one entry of
each requested type.
Thus ``whereis -m -u *'' asks for those files in the current
directory which have no documentation.
.sp
Finally, the
.B \-B
.B \-M
and
.B \-S
flags may be used to change or otherwise limit the places where
.I whereis
searches.
The
.B \-f
file flags is used to terminate the last such directory list
and signal the start of file names.
.SH EXAMPLE
The following finds all the files in /usr/bin which are not documented
in /usr/man/man1 with source in /usr/src/cmd:
.IP
cd /usr/ucb
.br
whereis \-u \-M /usr/man/man1 \-S /usr/src/cmd \-f *
.SH FILES
/usr/src/*
.br
/usr/{doc,man}/*
.br
/lib, /etc, /usr/{lib,bin,ucb,old,new,local}
D 4
.SH AUTHOR
William Joy
E 4
.SH BUGS
Since the program uses
.IR chdir (2)
to run faster, pathnames given with the
.B \-M
.B \-S
and
.B \-B
must be full; i.e. they must begin with a ``/''.
E 1
