abs0/4.3BSD-Quasijarus/man/man1/SCCS/s.xsend.1
h49688
s 00001/00001/00045
d D 6.1 85/04/29 18:09:56 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00002/00001/00044
d D 5.1 85/04/29 18:09:47 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00045/00000/00000
d D 4.1 85/04/29 18:09:38 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH XSEND 1
E 2
I 2
D 3
.TH XSEND 1 "18 January 1983"
E 3
I 3
.TH XSEND 1 "%Q%"
E 3
E 2
.AT 3
.SH NAME
xsend, xget, enroll \- secret mail
.SH SYNOPSIS
.B xsend
person
.br
.B xget
.br
.B enroll
.SH DESCRIPTION
These commands implement a secure communication
channel;
it is like
.IR mail (1),
but no one can read the messages except the intended recipient.
The method embodies a public-key cryptosystem using knapsacks.
.PP
To receive messages, use
.IR enroll ;
it asks you for a password that you must subsequently quote
in order to receive secret mail.
.PP
To receive secret mail,
use
.IR xget .
It asks for your password, then gives you the messages.
.PP
To send secret mail, use
.IR xsend
in the same manner as the ordinary mail command.
(However, it will accept only one target).
A message announcing the receipt of secret mail is also sent
by ordinary mail.
.SH FILES
/usr/spool/secretmail/*.key: keys
I 2
.br
E 2
/usr/spool/secretmail/*.[0-9]: messages
.SH SEE ALSO
mail (1)
.SH BUGS
It should be integrated with ordinary mail.
The announcement of secret mail makes traffic analysis possible.
E 1
