abs0/4.3BSD-Quasijarus/old/vpr/man/SCCS/s.vpr.1
h07815
s 00001/00001/00182
d D 6.1 85/04/29 19:45:13 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00007/00021/00176
d D 5.1 85/04/29 19:44:39 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00197/00000/00000
d D 4.1 85/04/29 19:44:20 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH VPR 1 2/21/80
E 2
I 2
D 3
.TH VPR 1 "27 July 1983"
E 3
I 3
.TH VPR 1 "%G%"
E 3
E 2
.UC 4
.SH NAME
vpr, vprm, vpq, vprint \- raster printer/plotter spooler
.SH SYNOPSIS
.B vpr
[
.B \-W
] [
.B \-l
] [
.B \-v
] [
.B \-t
[
.B \-1234
font ]
] [
.B \-w
] [
\fB\-w\fIwidth\fR
] [
.B \-m
] [ name ... ]
.br
.B vprm
[
id ...
] [
filename ...
] [
owner ...
]
.br
.B vpq
.br
.B vprint
[
.B \-W
]
file ...
.SH DESCRIPTION
.I Vpr 
causes the
named files
to be queued for printing or typeset simulation on one of the available
raster printer/plotters.
If no files are named, the standard input is read.
By default the input is assumed to be line printer-like text.
For very wide plotters, the input is run through the filter
.I /usr/lib/sidebyside
giving it an argument of
.B \-w106
which arranges it four pages adjacent with 90 column lines (the rest is for the
left margin).  Since there are 8 lines per inch in the default printer font,
.I vpr
thus produces 86 lines per page (the top and bottom lines are left blank).
.PP
The following options are available:
.TP 15
.B \-l
Print the input in a more literal manner.
Page breaks are not inserted, and most
control characters (except format effectors: \\n, \\f, etc.)
are printed
(many control characters print
special graphics not in the ASCII character set.)
Tab and underline processing is still done.
If this option is not given,
control characters which are not format effectors are ignored,
and page breaks are inserted after an appropriate number of lines
have been printed on a page.
.TP 15
.B \-W
Queues files for printing on a wide output device, if available.
Normally, files are queued for printing on a narrow output device.
.TP 15
.B \-1234
Specifies a font to be mounted on font position \fIi\fR.  The daemon
will construct a \fI.railmag\fR file referencing
\fI/usr/lib/vfont/name.size\fR.
.TP 15
.B \-m
Report by
.IR mail (1)
when printing is complete.
.TP
.B \-w
(Applicable only to wide output devices.)
Do not run the input through
sidebyside.
Such processing has been done already, or full (440 character) printer
width is desired.
.TP
\fB\-w\fIwidth\fR
Use width
.I width
rather than 90 for
.I sidebyside.
.TP
.B \-v
Use the filter
.I /usr/lib/vrast
to convert the vectors to raster. The named files must be a parameter and
vector file (in that order) created by
D 2
.IR versaplot (3x)
E 2
I 2
.IR plot (3X)
E 2
routines.
.TP
.B \-t
Use the filter
.I /usr/lib/vcat
to typeset the input on the printer/plotter.
The input must have been generated by
.IR troff (1)
run with the
.B \-t
option.
D 2
.B "This is not normally run directly"
E 2
I 2
This is not normally run directly
E 2
to wide output devices, since it is wasteful to run only one page across.
The program
.IR vtroff (1)
is normally used and arranges,
using
D 2
.IR vsort (1)
E 2
I 2
.I vsort
E 2
for printing to occur four pages across, conserving paper.
.PP
.I Vprm
removes entries from the raster device queues.
The id, filename or owner should be that reported by
.I vpq.
D 2
All apropriate files will be removed.
E 2
I 2
All appropriate files will be removed.
E 2
Both queues are always searched.
The id of each file removed from the queue will be printed.
.PP
.I Vpq
prints the queues.
Each entry in the queue is printed showing the owner of the queue entry,
an identification number,
the size of the entry in characters,
and the file which is to be printed.
The
.I id
is useful for removing a specific entry from the printer queue using
.I vprm
.PP
.I Vprint
is a shell script which
.I pr's
a copy of each named file on one of the electrostatic printer/plotters.
The files are normally printed on a narrow device;
.B \-W
option causes them to be printed on a wide device.
.SH FILES
.ta 2i
/usr/spool/v?d/*	device spool areas
.br
/usr/lib/v?d	daemons
.br
/usr/lib/vpd	Versatec daemon
.br
/usr/lib/vpf	filter for printer simulation
.br
/usr/lib/*vcat	filter for typeset simulation
.br
D 2
/usr/lib/vrast	filter for versaplot
E 2
I 2
/usr/lib/vrast	filter for plot
E 2
.br
/usr/lib/sidebyside	filter for wide output
.SH "SEE ALSO"
troff(1), vfont(5), vp(4), pti(1),
D 2
vtroff(1), versaplot(3x)
E 2
I 2
vtroff(1), plot(3X)
E 2
.SH BUGS
D 2
You can't run bit maps in a queued fashion to the plotters.
This is because the volume of the data (more than 1 Megabyte per
vertical foot) is unwieldy.
Instead you must follow the instructions in
.IR vp (4)
and run your program when the plotter is idle,
or run it in the background and have it wait for the device to become idle.
.PP
Queued jobs print in directory (seemingly random) order.
The plotters are fast enough that this is not a real problem.
.PP
E 2
The 1's (one's) and l's (lower-case el's) in a Benson-Varian's
standard character set look very similar; caution is advised.
D 2
.PP
.I Vprm
should have options allowing just one of the queues to be searched.
E 2
.PP
A versatec's hardware character set is rather ugly.
.I Vprint
should use one of the constant width fonts to produce prettier listings.
E 1
