abs0/4.3BSD-Quasijarus/old/vpr/man/SCCS/s.vpac.8
h14014
s 00055/00000/00000
d D 4.1 85/04/27 13:55:12 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH VPAC 8 2/21/80
.UC 4
.SH NAME
vpac \- print raster printer/ploter accounting information
.SH SYNOPSIS
.B /etc/vpac
[
.B \-W
] [
.B \-s
] [
.B \-r
] [
.B \-t
] [ name ... ]
.SH DESCRIPTION
.I Vpac
reads the raster printer/plotter accounting files, accumulating the number
of pages (for narrow fan-fold devices) or feet (for wide, roll paper devices)
of paper consumed by each user, and printing out
how much each user consumed in pages or feet and dollars (billed at
2 cents / page or 8 cents / foot).  If any
.I names
are specified, then statistics are only printed for those users;
usually, statistics are printed for every user who has used any paper.
.PP
The
.B \-W
flag causes accounting to be done for a wide roll paper device.  The default is
to do accounting for a narrow, fan-fold device.
The
.B \-t
flag causes the output to be sorted by feet of paper; usually the
output is sorted alphabetically by name.  The
.B \-r
flag reverses the sorting order.
The
.B \-s
flag causes the accounting information to be summarized on the
summary accounting file; this summarization is necessary since on a
busy system, the accounting file can grow by several lines per day.
.SH FILES
.ta 2i
/usr/adm/v?acct	raw accounting files
.br
/usr/adm/v?_sum	summary accounting files
.SH BUGS
The relationship between the computed price and reality is
as yet unknown.
E 1
