abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.aliases.5
h57694
s 00014/00003/00054
d D 6.2 88/10/25 15:07:51 bostic 4 3
c add manual pages, correct copyright notices
e
s 00001/00001/00056
d D 6.1 85/05/15 18:18:11 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00028/00028/00029
d D 5.1 85/05/15 18:17:53 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00057/00000/00000
d D 4.1 85/05/15 18:17:33 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
.\" Copyright (c) 1985 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH ALIASES 5
E 2
I 2
D 3
.TH ALIASES 5 "15 January 1983"
E 3
I 3
.TH ALIASES 5 "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 2
aliases \- aliases file for delivermail
E 2
I 2
aliases \- aliases file for sendmail
E 2
.SH SYNOPSIS
.B /usr/lib/aliases
.SH DESCRIPTION
D 2
This file describes user id aliases
that will be used
by
.I /etc/delivermail.
It is formatted as a series of lines
of the form
E 2
I 2
This file describes user id aliases used by
.I /usr/lib/sendmail.
It is formatted as a series of lines of the form
E 2
.in +0.5i
D 2
name:addr1,addr2,...addrn
E 2
I 2
name: name_1, name2, name_3, . . .
E 2
.in
The
.I name
D 2
is the name to alias,
and the
.I addri
are the addresses to send the message to.
Lines beginning with white space
are continuation lines.
Lines beginning with `\|#\|'
are comments.
E 2
I 2
is the name to alias, and the
.I name_n
are the aliases for that name.
Lines beginning with white space are continuation lines.
Lines beginning with `\|#\|' are comments.
E 2
.PP
Aliasing occurs only on local names.
D 2
Loops can not occur,
since no message will be sent to any person
more than once.
E 2
I 2
Loops can not occur, since no message will be sent to any person more than once.
.LP
After aliasing has been done, local and valid recipients who have a
``.forward'' file in their home directory have messages forwarded to the
list of users defined in that file.
E 2
.PP
This is only the raw data file; the actual aliasing information is
placed into a binary format in the files
D 2
/usr/lib/aliases.dir
E 2
I 2
.I /usr/lib/aliases.dir
E 2
and
D 2
/usr/lib/aliases.pag
E 2
I 2
.I /usr/lib/aliases.pag
E 2
using the program
D 2
.IR newaliases (5).
E 2
I 2
.IR newaliases (1).
E 2
A
.I newaliases
command should be executed each time the aliases file is changed for the
change to take effect.
D 2
.SH SEE\ ALSO
newaliases(1), dbm(3), delivermail(8)
E 2
I 2
.SH "SEE  ALSO"
newaliases(1), dbm(3X), sendmail(8)
.br
SENDMAIL Installation and Operation Guide.
.br
SENDMAIL An Internetwork Mail Router.
E 2
.SH BUGS
Because of restrictions in
D 2
.IR dbm (3)
E 2
I 2
.IR dbm (3X)
E 2
a single alias cannot contain more than about 1000 bytes of information.
D 2
You can get longer aliases by ``chaining''; i.e. make the last name in
the alias by a dummy name which is a continuation alias.
E 2
I 2
You can get longer aliases by ``chaining''; that is, make the last name in
the alias be a dummy name which is a continuation alias.
E 2
E 1
