abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.dm.config.5
h00504
s 00010/00005/00057
d D 5.4 88/07/09 11:37:52 bostic 4 3
c install approved copyright notice
e
s 00009/00003/00053
d D 5.3 88/03/26 11:02:13 bostic 3 2
c add Berkeley specific header
e
s 00040/00021/00016
d D 5.2 87/10/08 18:01:22 bostic 2 1
c change to keyword search
e
s 00037/00000/00000
d D 5.1 87/10/08 12:45:31 bostic 1 0
c date and time created 87/10/08 12:45:31 by bostic
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1987 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
.\" Copyright (c) 1988 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
D 4
.\" provided that this notice is preserved and that due credit is given
.\" to the University of California at Berkeley. The name of the University
.\" may not be used to endorse or promote products derived from this
.\" software without specific prior written permission. This software
.\" is provided ``as is'' without express or implied warranty.
E 4
I 4
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
E 3
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH DM.CONFIG 5 "%Q%"
.UC 5
.SH NAME
dm.config \- dm configuration file
.SH DESCRIPTION
D 2
\fIDm.config\fP is the configuration file for the \fIdm\fP(8) program.  It
consists of three parts, each separated by percent signs (``%'')
occurring as the first two characters in a line.  Blank lines and lines
preceded by a hash mark (``#'') are ignored.
E 2
I 2
\fIDm.config\fP is the configuration file for the \fIdm\fP(8) program.
It consists of lines beginning with one of three keywords, ``badtty'',
``game'', and ``time''.  All other lines are ignored.
E 2
.PP
D 2
The first part of the file sets the standard games hours on a day-by-day
basis.  Entries consist of three white-space separated fields: the
unabbreviated day of the week and the beginning and ending time of the
period of the day when games may not be played.  The time fields are in a
0 based, 24-hour clock.  Any of the time fields may be a non-numeric
character, resulting in no time limitations for that day.
E 2
I 2
Any tty listed after the keyword ``badtty'' may not have games played on
it.  Entries consist of two white-space separated fields: the string
``badtty'' and the ttyname as returned by \fIttyname\fP(3).  For example,
to keep the uucp dialout, ``tty19'', from being used for games, the
entry would be:
E 2
.PP
D 2
The second part sets the tty limitations.  Entries consist of two white-space
separated fields: the string "badtty", and the ttyname as returned by
\fIttyname\fP(3).  Games may not be played on tty's listed in this section.
E 2
I 2
.RS
	badtty	/dev/tty19
.RE
E 2
.PP
D 2
The third, and final, part sets specific game limitations.  Entries consist
of four white-space separated fields: the name of a game, the highest system
load average at which the game may be played, the maximum users allowed
if the game is to be played, and the priority at which the game is to be run.
Any of these fields may be a non-numeric character, resulting in no game
limitation or priority based on the field.  The game "default" controls the
settings for any game not otherwise listed.  Priorities may not be negative.
E 2
I 2
Any day/hour combination listed after the keyword ``time'' will disallow
games during those hours.  Entries consist of four white-space separated
fields: the string ``time'', the unabbreviated day of the week and the
beginning and ending time of a period of the day when games may not be
played.  The time fields are in a 0 based, 24-hour clock.  For example,
the following entry allows games playing before 8AM and after 5PM on
Mondays.
.PP
.RS
	time		Monday	8	17
.RE
.PP
Any game listed after the keyword ``game'' will set parameters for a specific
game.  Entries consist of five white-space separated fields: the keyword
``game'', the name of a game, the highest system load average at which the
game may be played, the maximum users allowed if the game is to be played,
and the priority at which the game is to be run.  Any of these fields may
start with a non-numeric character, resulting in no game limitation or
priority based on that field.  The game "default" controls the settings for
any game not otherwise listed, and must be the last ``game'' entry in the
file.  Priorities may not be negative.  For example, the following entries
limits the game ``hack'' to running only when the system has 10 or less
users and a load average of 5 or less; all other games may be run any time
the system has 15 or less users.
.PP
.RS
	game		hack		5	10	*
	game		default	*	15	*
.RE
E 2
.SH "SEE ALSO"
setpriority(2), ttyname(3), dm(8)
D 2

E 2
E 1
