abs0/4.3BSD-Quasijarus/man/man5/SCCS/S.environ.5
h36233
s 00086/00000/00000
d D 4.1 85/05/15 18:26:01 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH ENVIRON 5
.UC 4
.SH NAME
environ \- user environment
.SH SYNOPSIS
.B extern char **environ;
.SH DESCRIPTION
An array of strings called the `environment' is
made available by
.IR exec (2)
when a process begins.
By convention these strings have the form
.RI ` name = value '.
The following names are used by various commands:
.TP "\w'TERMCAP 'u"
PATH
The sequence of directory prefixes that
.I sh, time,
.IR nice (1),
etc.,
apply in searching for a file known by an incomplete path name.
The prefixes are separated by `:'.
.IR Login (1)
sets PATH=:/usr/ucb:/bin:/usr/bin.
.TP
HOME
A user's login directory, set by
.IR login (1)
from the password file
.IR passwd (5).
.TP
TERM
The kind of terminal for which output is to be prepared.
This information is used by commands, such as
.I nroff
or
.IR plot (1),
which may exploit special terminal capabilities.
See
.I /etc/termcap
.RI ( termcap (5))
for a list of terminal types.
.TP
SHELL
The file name of the users login shell.
.TP
TERMCAP
The string describing the terminal in TERM,
or the name of the termcap file, see
.IR termcap (5), termlib (3).
.TP
EXINIT
A startup list of commands read by
.IR ex (1),
.IR edit (1),
and
.IR vi (1).
.TP
USER
The login name of the user.
.PP
Further names may be placed in the environment by
the
.I export
command and `name=value' arguments in
.IR sh (1),
or by the
.I setenv
command if you use
.IR csh (1).
Arguments may also be placed in the environment at the point of an
.IR exec (2).
It is unwise to conflict with
certain 
.IR sh (1)
variables that are frequently exported by
`.profile' files:
MAIL, PS1, PS2, IFS.
.SH SEE ALSO
csh(1), ex(1), login(1), sh(1), exec(2), system(3), termlib(3), termcap(5), term(7)
E 1
