abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.group.5
h32743
s 00001/00001/00043
d D 6.1 85/05/15 18:14:59 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00002/00002/00042
d D 5.1 85/05/15 18:14:53 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00044/00000/00000
d D 4.1 85/05/15 18:14:47 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH GROUP 5 
E 2
I 2
D 3
.TH GROUP 5  "15 January 1983"
E 3
I 3
.TH GROUP 5  "%Q%"
E 3
E 2
.AT 3
.SH NAME
group \- group file
.SH DESCRIPTION
.I Group
contains for each group the
following information:
.HP 10
group name
.br
.ns
.HP 10
encrypted password
.br
.ns
.HP 10
numerical group ID
.br
.ns
.HP 10
a comma separated list of all users allowed in the group
.PP
This is an ASCII file.
The fields are separated
by colons;
Each group is separated from the next by a new-line.
If the password field is null, no password is demanded.
.PP
This file resides in directory /etc.
Because of the encrypted
passwords, it can and does have general read
permission and can be used, for example,
to map numerical group ID's to names.
.SH FILES
/etc/group
.SH "SEE ALSO"
D 2
newgrp(1), crypt(3), passwd(1), passwd(5)
E 2
I 2
setgroups(2), initgroups(3X), crypt(3), passwd(1), passwd(5)
E 2
.SH BUGS
The
.IR passwd (1)
command won't change the passwords.
E 1
