abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.hosts.5
h55353
s 00019/00013/00045
d D 6.3 86/05/14 19:45:23 bloom 4 3
c emphasis name server more, fix formatting
e
s 00010/00004/00048
d D 6.2 86/05/06 15:44:12 kjd 3 2
c Changes for name server
e
s 00001/00001/00051
d D 6.1 85/05/15 18:55:05 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00052/00000/00000
d D 5.1 85/05/15 18:54:48 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH HOSTS 5  "15 January 1983"
E 2
I 2
.TH HOSTS 5  "%Q%"
E 2
.UC 5
.SH NAME
hosts \- host name data base
.SH DESCRIPTION
The
.I hosts
file contains information regarding
D 4
the known hosts on the DARPA Internet.
E 4
I 4
the known hosts on the network.
E 4
For each host a single line should be present
with the following information:
.HP 10
official host name
.br
.ns
.HP 10
Internet address
.br
.ns
.HP 10
aliases
.PP
Items are separated by any number of blanks and/or
tab characters.  A ``#'' indicates the beginning of
a comment; characters up to the end of the line are
not interpreted by routines which search the file.
D 4
This file is normally created from the official host
E 4
I 4
.PP
When using the name server
.IR named (8),
this file provides a backup when the name server
is not running.
For the name server, it is suggested that only a few addresses
be included in this file.
These include  address for the local interfaces that 
.IR ifconfig (8C)
needs at boot time and a few machines on the local network.
.PP
This file may be created from the official host
E 4
data base maintained at the Network Information Control
Center (NIC), though local changes may be required
to bring it up to date regarding unofficial aliases
D 4
and/or unknown hosts.
E 4
I 4
and/or unknown hosts.  As the data base maintained at NIC
is incomplete, use of the name server is recommend for
sites on the DARPA Internet.
E 4
.PP
Network addresses are specified in the conventional
``.'' notation using the \fIinet_addr\fP() routine
from the Internet address manipulation library,
.IR inet (3N).
Host names may contain any printable
character other than a field delimiter, newline,
or comment character.
I 3
D 4
.PP
When using the name server this file is used as a backup for when 
.IR named (8)
is not running.
For the name server it is suggested that only a few addresses
be included in this file.
These include  address for the local interfaces that 
.IR ifconfig (8C)
needs at boot time and a few machines on the local network.
E 4
E 3
.SH FILES
/etc/hosts
.SH "SEE ALSO"
D 3
gethostent(3N)
.SH BUGS
A name server should be used instead of a static file.
A binary indexed file format should be available for fast access.
E 3
I 3
D 4
gethostent(3N), ifconfig(8C), named(8), Name Server Operations Guide for BIND
E 4
I 4
gethostbyname(3N), ifconfig(8C), named(8)
.br
Name Server Operations Guide for BIND
E 4
E 3
E 1
