abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.L-dialcodes.5
h57314
s 00105/00000/00000
d D 6.1 86/04/24 22:12:33 mckusick 1 0
c from rfg
e
u
U
t
T
I 1
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH L-DIALCODES 5 "%Q%"
.UC 6
.SH NAME
L-dialcodes \- UUCP phone number index file 
.SH DESCRIPTION
The
.I L-dialcodes
file defines the mapping of strings from the phone number field of
.IR L.sys (5)
to actual phone numbers.
.PP
Each line in L-dialcodes has the form:
.PP
.nf
	alpha_string  phone_number
.fi
.PP
The two items can be separated by any number of blanks or tabs. Lines beginning
with a `#' character are comments.
.PP
A phone number in
.I L.sys
can be preceded by an arbitrary alphabetic character string; the string
is matched against the list of
.IR alpha_string s
in
.IR L-dialcodes .
If a match is found,
.I phone_number
is substituted for it. If no match is found, the string is discarded.
.PP
.I L-dialcodes
is commonly used either of two ways:
.TP 4
(1)
The alphabetic strings are used as prefixes to denote area codes, zones,
and other commonly used sequences. For example, if
.I L-dialcodes
included the following lines:
.PP
.nf
	chi	1312
.br
	mv	1415
.fi
.PP
In
.I L.sys
you could enter:
.PP
.nf
	chivax Any ACU 1200 chi5551234  ogin:--ogin: nuucp
.br
	mvpyr  Any ACU 1200 mv5556001   ogin:--ogin: Uuucp

instead of

	chivax Any ACU 1200 13125551234  ogin:--ogin: nuucp
.br
	mvpyr  Any ACU 1200 14155556001  ogin:--ogin: Uuucp
.fi
.TP 4
(2)
All phone numbers are placed in
.IR L-dialcodes ,
one for each remote site.
.I L.sys
then refers to these by name. For example, if
.I L-dialcodes
contains the following lines:
.PP
.nf
	chivax	13125551234
.br
	mvpyr	14155556601
.fi
.PP
then
.I L.sys
could have:
.PP
.nf
	chivax Any ACU 1200 chivax  ogin:--ogin: nuucp
.br
	mvpyr  Any ACU 1200 mvpyr   ogin:--ogin: Uuucp
.fi
.PP
This scheme allows a site administrator to give users read access to the
table of phone numbers, while still protecting the login/password sequences
in
.IR L.sys .
.SH FILES
.nf
.ta \w'/usr/lib/uucp/UUAIDS/L-dialcodes   'u
/usr/lib/uucp/L-dialcodes
/usr/lib/uucp/UUAIDS/L-dialcodes	L-dialcodes example
.fi
.SH SEE ALSO
uucp(1C), uux(1C), L.sys(5), uucico(8C).
E 1
