abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.L.cmds.5
h28465
s 00082/00000/00000
d D 6.1 86/04/24 22:13:25 mckusick 1 0
c from rfg
e
u
U
t
T
I 1
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH L.CMDS 5 "%Q%"
.UC 6
.SH NAME
L.cmds \- UUCP remote command permissions file
.SH DESCRIPTION
The
.I L.cmds
file contains a list of commands, one per line, that are permitted
for remote execution via
.IR uux (1C).
.PP
The default search path is /bin:/usr/bin:/usr/ucb. To change the path,
include anywhere in the file a line of the form:
.PP
.nf
	PATH=/bin:/usr/bin:/usr/ucb
.fi
.PP
Normally, an acknowledgment is mailed back to the requesting
site after the command completes. If a command name is suffixed with
.BR ,Error ,
then an acknowledgment will be mailed only if the command fails.
If the command is suffixed with
.BR ,No ,
then no acknowledgment will ever be sent. (These correspond with
the
.B \-z
and
.B \-n
options of
.IR uux ,
respectively.)
.PP
For most sites,
.I L.cmds
should only include the lines:
.PP
.nf
	rmail
	ruusend
.fi
.PP
News sites should add:
.PP
.nf
	PATH=/bin:/usr/bin:/usr/ucb:/usr/new
	rnews,Error
.fi
.PP
While file names supplied as arguments to
.I uux
commands will be checked against the list of accessible directory trees in
.IR USERFILE (5),
this check can be easily circumvented and should not be depended upon.
In other words, it is unwise to include any commands in
.I L.cmds
that accept local file names. In particular,
.IR sh (1)
and
.IR csh (1)
are extreme risks.
.PP
It is common (but hazardous) to include
.IR uucp (1C)
in
.IR L.cmds ;
see the NOTES section of
.IR USERFILE .
.SH FILES
.ta \w'/usr/lib/uucp/UUAIDS/L.cmds   'u
.nf
/usr/lib/uucp/L.cmds
/usr/lib/uucp/UUAIDS/L.cmds	L.cmds example.
.fi
.SH SEE ALSO
uucp(1C), uux(1C), USERFILE(5), uucico(8C), uuxqt(8C)
E 1
