abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.L.aliases.5
h64522
s 00001/00001/00058
d D 6.2 86/05/10 20:17:39 mckusick 2 1
c format
e
s 00059/00000/00000
d D 6.1 86/04/24 22:12:57 mckusick 1 0
c from rfg
e
u
U
t
T
I 1
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH L.ALIASES 5 "%Q%"
D 2
.SH NAME
E 2
.UC 6
I 2
.SH NAME
E 2
L.aliases \- UUCP hostname alias file
.SH DESCRIPTION
The
.I L.aliases
file defines mapping (aliasing) of system names for uucp.
This is intended for compensating for systems that have
changed names, or do not provide their entire machine name
(like most USG systems). It is also useful when a machine's name
is not obvious or commonly misspelled.
.PP
Each line in
.I L.aliases
is of the form:
.PP
.nf
	real_name alias_name
.fi
.PP
Any amount of whitespace may separate the two items.
Lines beginning with a `#' character are comments.
.PP
All occurrences of
.I alias_name
are mapped to
.I real_name
by
.IR uucico (8C),
.IR uucp (1),
and
.IR uux (1).
The mapping occurs regardless of whether the name was typed in by a user
or provided by a remote site. An exception is the
.B -s
option of
.IR uucico ;
only the site's real hostname (the name in
.IR L.sys (5))
will be accepted there.
.PP
Aliased system names should not be placed in
.IR L.sys ;
they will not be used.
.SH FILES
.ta \w'/usr/lib/uucp/UUAIDS/L.aliases   'u
.nr
/usr/lib/uucp/L.aliases
/usr/lib/uucp/UUAIDS/L.aliases	L.aliases example
.fi
.SH SEE ALSO
uucp(1C), uux(1C), L.sys(5), uucico(8C)
E 1
