abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.phones.5
h10769
s 00003/00002/00032
d D 6.2 86/05/16 11:31:56 mckusick 3 2
c note that only ``,'' and \n are terminators
e
s 00001/00001/00033
d D 6.1 85/05/15 18:59:08 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00034/00000/00000
d D 5.1 85/05/15 18:59:00 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH PHONES 5 "15 January 1983"
E 2
I 2
.TH PHONES 5 "%Q%"
E 2
.UC 5
.SH NAME
phones \- remote host phone number data base
.SH DESCRIPTION
The file /etc/phones contains the system-wide
private phone numbers for the
.IR tip (1C)
program.  This file is normally unreadable, and so may contain
privileged information.  The format of the file is a series of lines
of the form: <system-name>[\ \et]*<phone-number>.  The system name is
one of those defined in the
.IR remote (5)
D 3
file and the phone number is
constructed from [0123456789-=*%].  The ``='' and ``*'' characters are
E 3
I 3
file and the phone number is constructed from any sequence of
characters terminated only by ``,'' or the end of the line.
The ``='' and ``*'' characters are
E 3
indicators to the auto call units to pause and wait for a second dial
tone (when going through an exchange).  The ``='' is required by the
DF02-AC and the ``*'' is required by the BIZCOMP 1030.
.PP
Only one phone number per line is permitted.  However, if more than
one line in the file contains the same system name
.IR tip (1C)
will attempt to dial each one in turn, until it establishes a connection.
.SH FILES
/etc/phones
.SH "SEE ALSO"
tip(1C),
remote(5)
E 1
