abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.protocols.5
h51158
s 00000/00001/00041
d D 6.2 86/05/06 16:13:30 kjd 3 2
c Fix bugs section
e
s 00001/00001/00041
d D 6.1 85/05/15 18:56:18 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00042/00000/00000
d D 5.1 85/05/15 18:55:59 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH PROTOCOLS 5  "15 January 1983"
E 2
I 2
.TH PROTOCOLS 5  "%Q%"
E 2
.UC 5
.SH NAME
protocols \- protocol name data base
.SH DESCRIPTION
The
.I protocols
file contains information regarding the known protocols used in the DARPA
Internet.  For each protocol a single line should be present
with the following information:
.HP 10
official protocol name
.br
.ns
.HP 10
protocol number
.br
.ns
.HP 10
aliases
.PP
Items are separated by any number of blanks and/or
tab characters.  A ``#'' indicates the beginning of
a comment; characters up to the end of the line are
not interpreted by routines which search the file.
.PP
Protocol names may contain any printable
character other than a field delimiter, newline,
or comment character.
.SH FILES
/etc/protocols
.SH "SEE ALSO"
getprotoent(3N)
.SH BUGS
A name server should be used instead of a static file.
D 3
A binary indexed file format should be available for fast access.
E 3
E 1
