abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.services.5
h15506
s 00002/00003/00049
d D 6.2 86/11/25 21:29:08 bostic 4 2
c fixed BUGS section -- kjd
e
s 00000/00001/00051
d R 6.2 86/05/06 16:13:34 kjd 3 2
c Fix bugs section
e
s 00001/00001/00051
d D 6.1 85/05/15 18:59:47 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00052/00000/00000
d D 5.1 85/05/15 18:59:39 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH SERVICES 5  "15 January 1983"
E 2
I 2
.TH SERVICES 5  "%Q%"
E 2
.UC 5
.SH NAME
services \- service name data base
.SH DESCRIPTION
The
.I services
file contains information regarding
the known services available in the DARPA Internet.
For each service a single line should be present
with the following information:
.HP 10
official service name
.br
.ns
.HP 10
port number
.br
.ns
.HP 10
protocol name
.br
.ns
.HP 10
aliases
.PP
Items are separated by any number of blanks and/or
tab characters.  The port number and protocol name
are considered a single 
.IR item ;
a ``/'' is used to
separate the port and protocol (e.g. ``512/tcp'').
A ``#'' indicates the beginning of
D 4
a comment; characters up to the end of the line are
not interpreted by routines which search the file.
E 4
I 4
a comment; subsequent characters up to the end of the line are
not interpreted by the routines which search the file.
E 4
.PP
Service names may contain any printable
character other than a field delimiter, newline,
or comment character.
.SH FILES
/etc/services
.SH "SEE ALSO"
getservent(3N)
.SH BUGS
A name server should be used instead of a static file.
D 4
A binary indexed file format should be available for fast access.
E 4
E 1
