abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.stab.5
h40164
s 00003/00044/00176
d D 6.3 86/05/19 15:50:12 donn 5 4
c Deleted reference to type bitfields; since the compilers use shifts and
c masks, a bitfield description will have byte order dependencies.  Substituted
c a reference to pcc.h instead.
e
s 00000/00006/00220
d D 6.2 86/05/13 18:50:40 karels 4 3
c rm sdb bug; more sdb left
e
s 00001/00001/00225
d D 6.1 85/05/15 18:12:45 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00015/00011/00211
d D 5.1 85/05/15 18:12:33 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00222/00000/00000
d D 4.1 85/05/15 18:12:24 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH STAB 5
E 2
I 2
D 3
.TH STAB 5 "1 April 1983"
E 3
I 3
.TH STAB 5 "%Q%"
E 3
E 2
.UC 4
.SH NAME
stab \- symbol table types
.SH SYNOPSIS
.B "#include <stab.h>"
.SH DESCRIPTION
.I Stab.h
defines some values of the n_type field of the symbol table of a.out files.
These are the types for permanent symbols (i.e. not local labels, etc.)
D 2
used by the debugger
.IR sdb (1)
E 2
I 2
used by the old debugger
.I sdb
E 2
and the Berkeley Pascal compiler
.IR pc (1).
Symbol table entries can be produced by the
.I .stabs
assembler directive.
This allows one to specify a double-quote delimited name, a symbol type,
one char and one short of information about the symbol, and an unsigned
long (usually an address).
To avoid having to produce an explicit label for the address field,
the
.I .stabd
directive can be used to implicitly address the current location.
If no name is needed, symbol table entries can be generated using the
.I .stabn
directive.
The loader promises to preserve the order of symbol table entries produced
by
.I .stab
directives.
D 2
As described in a.out(5), an element of the symbol table
E 2
I 2
As described in
.IR a.out (5),
an element of the symbol table
E 2
consists of the following structure:
.PP
.nf
/*
.ti +\w'/'u
* Format of a symbol table entry.
.ti +\w'/'u
*/
.ta \w'#define\ 'u +\w'unsigned 'u +\w'char\ \ 'u +\w'n_name;\ \ 'u
struct nlist {
	union {
		char	*n_name;	/* for use when in-core */
		long	n_strx;		/* index into file string table */
	} n_un;
	unsigned char	n_type;		/* type flag */
	char		n_other;	/* unused */
	short		n_desc;		/* see struct desc, below */
	unsigned	n_value;	/* address or offset or line */
};
.fi
.DT
.PP
The low bits of the n_type field are used to place a symbol into
at most one segment, according to 
the following masks, defined in
D 2
.BR <a.out.h> .
E 2
I 2
.RI < a.out.h >.
E 2
A symbol can be in none of these segments by having none of these segment
bits set.
.PP
.nf
/*
.ti +\w'/'u
* Simple values for n_type.
.ti +\w'/'u
*/
.ta \w'#define\ 'u +\w'N_FNAME\ 'u +\w'0x0\ \ \ 'u
#define	N_UNDF	0x0	/* undefined */
#define	N_ABS	0x2	/* absolute */
#define	N_TEXT	0x4	/* text */
#define	N_DATA	0x6	/* data */
#define	N_BSS	0x8	/* bss */

#define	N_EXT	01	/* external bit, or'ed in */
.DT
.fi
.PP
The n_value field of a symbol is relocated by the linker,
D 2
.IR ld (5)
E 2
I 2
.IR ld (1)
E 2
as an address within the appropriate segment.
N_value fields of symbols not in any segment are unchanged by the linker.
In addition, the linker will discard certain symbols, according to rules
of its own, unless the n_type field has one of the following bits set:
.PP
.nf
/*
.ti +\w'/'u
* Other permanent symbol table entries have some of the N_STAB bits set.
.ti +\w'/'u
* These are given in <stab.h>
.ti +\w'/'u
*/
.ta \w'#define\ 'u +\w'N_FNAME\ 'u +\w'0x0\ \ \ 'u
#define	N_STAB		0xe0		/* if any of these bits set, don't discard */

.DT
.fi
.PP
This allows up to 112 (7 \(** 16) symbol types, split between the various
segments.
Some of these have already been claimed.
D 2
The symbolic debugger,
.IR sdb (1),
E 2
I 2
The old symbolic debugger,
.IR sdb ,
E 2
uses the following n_type values:
.PP
.nf
.ta \w'#define\ 'u +\w'N_FNAME\ 'u +\w'0x0\ \ \ 'u
#define	N_GSYM	0x20	/* global symbol: name,,0,type,0 */
#define	N_FNAME	0x22	/* procedure name (f77 kludge): name,,0 */
#define	N_FUN	0x24	/* procedure: name,,0,linenumber,address */
#define	N_STSYM	0x26	/* static symbol: name,,0,type,address */
#define	N_LCSYM	0x28	/* .lcomm symbol: name,,0,type,address */
#define	N_RSYM	0x40	/* register sym: name,,0,type,register */
#define	N_SLINE	0x44	/* src line: 0,,0,linenumber,address */
#define	N_SSYM	0x60	/* structure elt: name,,0,type,struct_offset */
#define	N_SO	0x64	/* source file name: name,,0,0,address */
#define	N_LSYM	0x80	/* local sym: name,,0,type,offset */
#define	N_SOL	0x84	/* #included file name: name,,0,0,address */
#define	N_PSYM	0xa0	/* parameter: name,,0,type,offset */
#define	N_ENTRY	0xa4	/* alternate entry: name,linenumber,address */
#define	N_LBRAC	0xc0	/* left bracket: 0,,0,nesting level,address */
#define	N_RBRAC	0xe0	/* right bracket: 0,,0,nesting level,address */
#define	N_BCOMM	0xe2	/* begin common: name,, */
#define	N_ECOMM	0xe4	/* end common: name,, */
#define	N_ECOML	0xe8	/* end common (local name): ,,address */
#define	N_LENG	0xfe	/* second stab entry with length information */
.fi
.PP
D 2
where the comments give the
E 2
I 2
where the comments give
E 2
.I sdb
conventional use for
.IR .stab s
and the n_name, n_other, n_desc, and n_value fields
of the given n_type. 
.I Sdb
uses the n_desc field to hold a type specifier in the form used
by the Portable C Compiler,
D 5
.IR cc (1),
in which a base type is qualified in the following structure:
.PP
.nf
.ta \w'#define\ 'u +\w'short\ \ 'u
struct desc {
	short	q6:2,
		q5:2,
		q4:2,
		q3:2,
		q2:2,
		q1:2,
		basic:4;
};
.DT
.fi
.PP
There are four qualifications, with q1 the most significant and q6 the least
significant:
.nf
	0	none
	1	pointer
	2	function
	3	array
.fi
The sixteen basic types are assigned as follows:
.nf
	0	undefined
	1	function argument
	2	character
	3	short
	4	int
	5	long
	6	float
	7	double
	8	structure
	9	union
	10	enumeration
	11	member of enumeration
	12	unsigned character
	13	unsigned short
	14	unsigned int
	15	unsigned long
.fi
E 5
I 5
.IR cc (1);
see the header file \fIpcc.h\fP
for details on the format of these type values.
E 5
.PP
The Berkeley Pascal compiler,
.IR pc (1),
uses the following n_type value:
.PP
.nf
#define	N_PC	0x30	/* global pascal symbol: name,,0,subtype,line */
.fi
.PP
and uses the following subtypes to do type checking across separately
compiled files:
.nf
	1	source file name
	2	included file name
	3	global label
	4	global constant
	5	global type
	6	global variable
	7	global function
	8	global procedure
	9	external function
	10	external procedure
I 2
	11	library variable
	12	library routine
E 2
.fi
.SH "SEE ALSO"
D 2
as(1), ld(1), sdb(1), a.out(5)
E 2
I 2
as(1), ld(1), dbx(1), a.out(5)
E 2
.SH BUGS
.PP
D 2
.IR Sdb (1)
E 2
I 2
D 4
.I Sdb
E 2
assumes that a symbol of type N_GSYM with name
.I name
is located at address
.IR _\|name .
.PP
E 4
More basic types are needed.
E 1
