abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.utmp.5
h05595
s 00001/00001/00054
d D 6.3 86/12/09 18:52:37 bostic 5 4
c added last to "see also" list
e
s 00001/00001/00054
d D 6.2 85/06/23 17:08:30 bloom 4 3
c make agree with date(1) and ac(8)
e
s 00001/00001/00054
d D 6.1 85/05/15 18:13:33 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00006/00013/00049
d D 5.1 85/05/15 18:13:23 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00062/00000/00000
d D 4.1 85/05/15 18:13:15 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH UTMP 5 
E 2
I 2
D 3
.TH UTMP 5  "26 July 1983"
E 3
I 3
.TH UTMP 5  "%Q%"
E 3
E 2
.UC 4
.SH NAME
utmp, wtmp \- login records
.SH SYNOPSIS
.B #include <utmp.h>
.SH DESCRIPTION
The
.I utmp
D 2
file allows one to discover information about who is currently
using UNIX.
E 2
I 2
file records information about who is currently using the system.
E 2
The file is a sequence of entries with the following
structure declared in the include file:
.RS
.PP
.nf
.so /usr/include/utmp.h
.fi
.RE
.PP
This structure gives the name of the special file
associated with the user's terminal, the user's login name,
and the time of the login in the form of
D 2
.IR time (2).
E 2
I 2
.IR time (3C).
E 2
.PP
The
.I wtmp
file records all logins and logouts.
D 2
Its format is exactly like
.I utmp
except that
a null user name indicates a logout on the associated
terminal.
E 2
I 2
A null user name indicates a logout on the associated terminal.
E 2
Furthermore, the terminal name `~' indicates that the
system was rebooted at the indicated time;
the adjacent pair of entries with terminal names
D 2
`\^|\^' and `}' indicate the system-maintained time
just before and just after a
E 2
I 2
D 4
`\^|\^' and `}' indicate the system-maintained time just before and just after a
E 4
I 4
`\^|\^' and `{' indicate the system-maintained time just before and just after a
E 4
E 2
.I date
command has changed the system's idea of the time.
.PP
.I Wtmp
is maintained by
.IR login (1)
and
.IR init (8).
Neither of these programs creates the file,
D 2
so if it is removed record-keeping is turned off.
It is summarized by
E 2
I 2
so if it is removed record-keeping is turned off.  It is summarized by
E 2
.IR ac (8).
.SH FILES
/etc/utmp
.br
/usr/adm/wtmp
.SH "SEE ALSO"
D 5
login(1), init(8), who(1), ac(8)
E 5
I 5
last(1), login(1), who(1), ac(8), init(8)
E 5
E 1
