abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.uuencode.5
h56582
s 00000/00000/00051
d R 6.2 86/04/24 22:06:06 mckusick 4 3
c update from rfg
e
s 00001/00001/00050
d D 6.1 85/05/15 18:42:31 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00005/00005/00046
d D 5.1 85/05/15 18:42:10 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00051/00000/00000
d D 4.1 85/05/15 18:41:27 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH UUENCODE 5 6/1/80
E 2
I 2
D 3
.TH UUENCODE 5 "1 June 1980"
E 3
I 3
.TH UUENCODE 5 "%Q%"
E 3
E 2
.AT 3
.SH NAME
uuencode \- format of an encoded uuencode file
.SH DESCRIPTION
Files output by
D 2
.I uuencode(1)
E 2
I 2
.I uuencode(1C)
E 2
consist of a header line,
followed by a number of body lines,
and a trailer line.
D 2
.I Uudecode(1)
E 2
I 2
.I Uudecode(1C)
E 2
will ignore any lines preceding the header or
following the trailer.
Lines preceding a header must not, of course,
look like a header.
.PP
The header line is distinguished by having the first
6 characters \*(lqbegin\ \*(rq.
The word
.I begin
is followed by a mode (in octal),
and a string which names the remote file.
A space separates the three items in the header line.
.PP
The body consists of a number of lines, each at most 62 characters
long (including the trailing newline).
These consist of a character count,
followed by encoded characters,
followed by a newline.
The character count is a single printing character,
and represents an integer, the number of bytes
the rest of the line represents.
Such integers are always in the range from 0 to 63 and can
be determined by subtracting the character space (octal 40)
from the character.
.PP
Groups of 3 bytes are stored in 4 characters, 6 bits per character.
All are offset by a space to make the characters printing.
The last line may be shorter than the normal 45 bytes.
If the size is not a multiple of 3, this fact can be determined
by the value of the count on the last line.
Extra garbage will be included to make the character count a multiple
of 4.
The body is terminated by a line with a count of zero.
This line consists of one ASCII space.
.PP
The trailer line consists of \*(lqend\*(rq on a line by itself.
D 2
.SH SEE\ ALSO
uuencode(1), uudecode(1), uusend(1), uucp(1), mail(1)
E 2
I 2
.SH "SEE ALSO"
uuencode(1C), uudecode(1C), uusend(1C), uucp(1C), mail(1)
E 2
E 1
