abs0/4.3BSD-Quasijarus/man/man5/SCCS/s.vgrindefs.5
h32840
s 00001/00001/00123
d D 6.2 87/09/30 08:38:27 bostic 3 2
c typo; bug report 4.3BSD/man/16
e
s 00001/00001/00123
d D 6.1 85/05/15 18:57:40 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00124/00000/00000
d D 5.1 85/05/15 18:57:18 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.tr ||
D 2
.TH VGRINDEFS 5 "11 February 1981"
E 2
I 2
.TH VGRINDEFS 5 "%Q%"
E 2
.UC 5
.SH NAME
vgrindefs \- vgrind's language definition data base
.SH SYNOPSIS
.B /usr/lib/vgrindefs
.SH DESCRIPTION
.I Vgrindefs
contains all language definitions for vgrind.  The data base is
very similar to 
.IR termcap (5).
.SH FIELDS
The following table names and describes each field.  
.PP
.nf
.ta \w'k0-k9  'u +\w'Type  'u
\fBName	Type	Description\fR
pb	str	regular expression for start of a procedure
bb	str	regular expression for start of a lexical block
be	str	regular expression for the end of a lexical block
cb	str	regular expression for the start of a comment
ce	str	regular expression for the end of a comment
sb	str	regular expression for the start of a string
se	str	regular expression for the end of a string
lb	str	regular expression for the start of a character constant
le	str	regular expression for the end of a character constant
tl	bool	present means procedures are only defined at the top 
		lexical level
oc	bool	present means upper and lower case are equivalent
kw	str	a list of keywords separated by spaces
.fi
.PP
.B Example
.PP
The following entry, which describes the C language, is 
typical of a language entry.
.PP
.nf
C|c:\
	:pb=^\ed?*?\ed?\ep\ed?\(\ea?\):bb={:be=}:cb=/*:ce=*/:sb=":se=\ee":\e
	:lb=':le=\ee':tl:\e
	:kw=asm auto break case char continue default do double else enum\e
	extern float for fortran goto if int long register return short\e
	sizeof static struct switch typedef union unsigned while #define\e
	#else #endif #if #ifdef #ifndef #include #undef # define else endif\e
	if ifdef ifndef include undef:
.fi
.PP
Note that the first field is just the language name (and any variants
of it).  Thus the C language could be specified to
.IR vgrind (1)
as "c" or "C".
.PP
Entries may continue onto multiple lines by giving a \e as the last
character of a line.
Capabilities in
.I vgrindefs
are of two types:
Boolean capabilities which indicate that the language has
some particular feature
and string
capabilities which give a regular expression or 
keyword list.
.PP
.B REGULAR EXPRESSIONS
.PP
.I Vgrindefs
uses regular expression which are very similar to those of 
.IR ex (1)
and
.IR lex (1).
The characters `^', `$', `:' and `\e'
are reserved characters and must be
"quoted" with a preceding \e if they
are to be included as normal characters.
The metasymbols and their meanings are:
.IP $
the end of a line
.IP ^
the beginning of a line
.IP \ed
a delimiter (space, tab, newline, start of line)
.IP \ea
matches any string of symbols (like .* in lex)
.IP \ep
matches any alphanumeric name.  In a procedure definition (pb) the string
that matches this symbol is used as the procedure name.
.IP ()
grouping
.IP |
alternation
.IP ?
last item is optional
.IP \ee
preceding any string means that the string will not match an
input string if the input string is preceded by an escape character (\e).
This is typically used for languages (like C) which can include the
D 3
string delimiter in a string b escaping it.
E 3
I 3
string delimiter in a string by escaping it.
E 3
.PP
Unlike other regular expressions in the system,  these match words
and not characters.  Hence something like "(tramp|steamer)flies?"
would match "tramp", "steamer", "trampflies", or "steamerflies".
.PP
.B KEYWORD LIST
.PP
The keyword list is just a list of keywords in the language separated
by spaces.  If the "oc" boolean is specified, indicating that upper
and lower case are equivalent, then all the keywords should be 
specified in lower case.
.SH FILES
.DT
/usr/lib/vgrindefs	file containing terminal descriptions
.SH SEE ALSO
vgrind(1), troff(1)
.SH AUTHOR
Dave Presotto
.SH BUGS
E 1
