abs0/4.3BSD-Quasijarus/man/man7/SCCS/s.hier.7
h12886
s 00001/00001/00668
d D 6.1 85/05/20 20:28:33 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00155/00053/00514
d D 5.1 85/05/20 20:28:03 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00567/00000/00000
d D 4.1 85/05/20 20:27:42 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH HIER 7
E 2
I 2
D 3
.TH HIER 7 "1 February 1983"
E 3
I 3
.TH HIER 7 "%Q%"
E 3
E 2
.UC 4
.SH NAME
hier \- file system hierarchy
.SH DESCRIPTION
D 2
The following outline gives a quick tour through
a representative directory hierarchy.
E 2
I 2
The following outline gives a quick tour through a representative
directory hierarchy.
E 2
.na
.nh
.IP /
root
.PD 0
.IP /vmunix
the kernel binary (UNIX itself)
.IP /lost+found
directory for connecting detached files for
D 2
.IR fsck (5)
E 2
I 2
.IR fsck (8)
E 2
.IP /dev/
devices (4)
.RS
I 2
.IP MAKEDEV
shell script to create special files
.IP MAKEDEV.local
site specific part of MAKEDEV
E 2
.IP console
main console,
.IR tty (4)
.IP tty*
terminals,
.IR tty (4)
D 2
.IP rp*
E 2
I 2
.IP hp*
E 2
disks,
.IR hp (4)
D 2
.IP rrp*
E 2
I 2
.IP rhp*
E 2
raw disks,
.IR hp (4)
.IP up*
UNIBUS disks
.IR up (4)
.IP ...
.RE
.IP /bin/
utility programs, cf /usr/bin/ (1)
.RS
.IP as
assembler
.IP cc
D 2
C compiler executive,
cf /lib/ccom, /lib/cpp, /lib/c2
E 2
I 2
C compiler executive, cf /lib/ccom, /lib/cpp, /lib/c2
E 2
.IP csh
C shell
.IP ...
.RE
.IP /lib/
object libraries and other stuff, cf /usr/lib/
.RS
.IP libc.a
system calls, standard I/O, etc. (2,3,3S)
.IP ...
.IP ccom
C compiler proper
.IP cpp
C preprocessor
.IP c2
C code improver
.IP ...
.RE
.IP /etc/
D 2
essential data and maintenance utilities;
sect (8)
E 2
I 2
essential data and maintenance utilities; sect (8)
E 2
.RS
.IP dump
dump program
.IR dump (8)
.IP passwd
password file,
.IR passwd (5)
.IP group
group file,
.IR group (5)
.IP motd
message of the day,
.IR login (1)
.IP termcap
description of terminal capabilities,
.IR termcap (5)
.IP ttytype
table of what kind of terminal is on each port,
.IR ttytype (5)
.IP mtab
mounted file table,
.IR mtab (5)
.IP dumpdates
dump history,
.IR dump (8)
.IP fstab
D 2
file system configurtion table
E 2
I 2
file system configuration table
E 2
.IR fstab (5)
I 2
.IP disktab
disk characteristics and partition tables,
.IR disktab (5)
.IP hosts
host name to network address mapping file,
.IR hosts (5)
.IP networks
network name to network number mapping file,
.IR networks (5)
.IP protocols
protocol name to protocol number mapping file,
.IR protocols (5)
.IP services
network services definition file,
.IR services (5)
.IP remote
names and description of remote hosts for 
.IR tip (1C),
.IR remote (5)
.IP phones
private phone numbers for remote hosts, as described in
.IR phones (5)
E 2
.IP ttys
properties of terminals,
.IR ttys (5)
.IP getty
part of
.IR login ,
.IR getty (8)
.IP init
the parent of all processes,
D 2
.IR init.vm (8)
E 2
I 2
.IR init (8)
E 2
.IP rc
shell program to bring the system up
I 2
.IP rc.local
site dependent portion of 
.I rc
E 2
.IP cron
the clock daemon,
.IR cron (8)
.IP mount
.IR mount (8)
D 2
.IP wall
.IR wall (8)
E 2
.IP ...
.RE
I 2
.IP /sys/
system source
.RS
.IP h/
header (include) files
.RS
.IP acct.h
.IR acct (5)
.IP stat.h
.IR stat (2)
.IP ...
.RE
.IP sys/
machine independent system source 
.RS
.IP init_main.c
.IP uipc_socket.c
.IP ufs_syscalls.c
.IP ...
.RE
.IP conf/
site configuration files
.RS
.IP GENERIC
.IP ...
.RE
.IP net/
general network source
.IP netinet/
DARPA Internet network source
.IP netimp/
network code related to use of an IMP
.RS
.IP if_imp.c
.IP if_imphost.c
.IP if_imphost.h
.IP ...
.RE
.IP vax/
source specific to the VAX
.RS
.IP locore.s
.IP machdep.c
.IP ...
.RE
.IP vaxuba/
device drivers for hardware which resides on the UNIBUS
.RS
.IP uba.c
.IP dh.c
.IP up.c
.IP ...
.RE
.IP vaxmba/
device drivers for hardware which resides on the MASBUS
.RS
.IP mba.c
.IP hp.c
.IP ht.c
.IP ...
.RE
.IP vaxif
network interface drivers for the VAX
.RS
.IP if_en.c
.IP if_ec.c
.IP if_vv.c
.IP ...
.RE
.RE
E 2
.IP /tmp/
temporary files, usually on a fast device, cf /usr/tmp/
.RS
.IP e*
used by
.IR ed (1)
.IP ctm*
used by 
.IR cc (1)
.IP ...
.RE
.IP /usr/
general-pupose directory, usually a mounted file system
.RS
.IP adm/
administrative information
.RS
.IP wtmp
login history,
.IR utmp (5)
.IP messages
hardware error messages
.IP tracct
phototypesetter accounting,
.IR troff (1)
.IP lpacct
line printer accounting
.IR lpr (1)
.IP "vaacct, vpacct"
varian and versatec accounting
.IR vpr (1),
.IR vtroff (1),
D 2
.IR vpac (1)
E 2
I 2
.IR pac (8)
E 2
.RE
.RE
.IP /usr\t/bin
.RS
utility programs, to keep /bin/ small
.IP tmp/
temporaries, to keep /tmp/ small
.RS
.IP stm*
used by
.IR sort (1)
.IP raster
used by
D 2
.IR plot (1)
E 2
I 2
.IR plot (1G)
E 2
.RE
.IP dict/
word lists, etc.
.RS
.IP words
principal word list, used by
.IR look (1)
.IP spellhist
history file for
.IR spell (1)
.RE
.IP games/
.RS
.IP hangman
.IP lib/
library of stuff for the games
.RS
.IP quiz.k/
what
.IR quiz (6)
knows
.RS
.IP index
category index
.IP africa
countries and capitals
.IP ...
.RE
.IP ...
.RE
.IP ...
.RE
.IP include/
standard #include files
.RS
.IP a.out.h
object file layout,
.IR a.out (5)
.IP stdio.h
standard I/O,
D 2
.IR stdio (3)
E 2
I 2
.IR intro (3S)
E 2
.IP math.h
(3M)
.IP ...
.IP sys/
D 2
system-defined layouts, cf /usr/sys/h
E 2
I 2
system-defined layouts, cf /sys/h
.IP net/
symbolic link to sys/net
.IP machine/
symbolic link to sys/machine
.IP ...
E 2
.RE
.IP lib/
object libraries and stuff, to keep /lib/ small
.RS
.IP atrun
scheduler for
.IR at (1)
.IP lint/
utility files for lint
.RS
.IP lint[12]
subprocesses for
.IR lint (1)
.IP llib-lc
dummy declarations for /lib/libc.a, used by
.IR lint (1)
.IP llib-lm
dummy declarations for /lib/libc.m
.IP ...
.RE
.IP struct/
passes of
.IR struct (1)
.IP ...
.IP tmac/
macros for
.IR troff (1)
.RS
.IP tmac.an
macros for
.IR man (7)
.IP tmac.s
macros for
.IR ms (7)
.IP ...
.RE
.IP font/
fonts for
.IR troff (1)
.RS
.IP ftR
Times Roman
.IP ftB
Times Bold
.IP ...
.RE
.IP uucp/
programs and data for
D 2
.IR uucp (1)
E 2
I 2
.IR uucp (1C)
E 2
.RS
.IP L.sys
remote system names and numbers
.IP uucico
the real copy program
.IP ...
.RE
.IP units
conversion tables for
.IR units (1)
.IP eign
list of English words to be ignored by
.IR ptx (1)
.RE
.RE
.br
.ne 5
.IP /usr/\tman/
.RS
volume 1 of this manual,
.IR man (1)
.RS
.IP man0/
general
.RS
.IP intro
introduction to volume 1,
.IR ms (7)
format
.IP xx
template for manual page
.RE
.IP man1/
chapter 1
.RS
.IP as.1
.IP mount.1m
.IP ...
.RE
.IP ...
.IP cat1/
preformatted pages for section 1
.IP ...
.RE
.IP msgs/
messages, cf
.IR msgs (1)
.RS
.IP bounds
highest and lowest message
.RE
.IP new/
binaries of new versions of programs
.IP preserve/
editor temporaries preserved here after crashes/hangups
.IP public/
binaries of user programs - write permission to everyone
.IP spool/
delayed execution files
.RS
.IP at/
used by 
.IR at (1)
.IP lpd/
used by
.IR lpr (1)
.RS
.IP lock
present when line printer is active
.IP cf*
copy of file to be printed, if necessary
.IP df*
daemon control file,
.IR lpd (8)
.IP tf*
transient control file, while 
.I lpr
is working
.RE
.IP uucp/
work files and staging area for 
D 2
.IR uucp (1)
E 2
I 2
.IR uucp (1C)
E 2
.RS
.IP LOGFILE
summary log
.IP LOG.*
log file for one transaction
.RE
.IP mail/
mailboxes for
.IR mail (1)
.RS
.TP
.I name
mail file for user
.I name
.TP
.IR name .lock
lock file while
.I name
is receiving mail
.RE
.IP secretmail/
like
.IR mail /
.IP uucp/
work files and staging area for 
D 2
.IR uucp (1)
E 2
I 2
.IR uucp (1C)
E 2
.RS
.IP LOGFILE
summary log
.IP LOG.*
log file for one transaction
I 2
.IP mqueue/
mail queue for 
.IR sendmail (8)
E 2
.RE
.RE
.TP
.I wd
initial working directory of a user,
typically
.I wd
is the user's login name
.RS
.TP
.BR . profile
set environment for
.IR sh (1),
D 2
.IR environ (5)
E 2
I 2
.IR environ (7)
E 2
.TP
.BR . project
what you are doing (used by (
.IR finger (1)
)
.TP
.BR . cshrc
startup file for
.IR csh (1)
.TP
.BR . exrc
startup file for
.IR ex (1)
.TP
.BR . plan
what your short-term plans are (used by
.IR finger (1)
)
.TP
.BR . netrc
D 2
startup file for
.IR net (1)
E 2
I 2
startup file for various network programs
E 2
.TP
.BR . msgsrc
startup file for
.IR msgs (1)
.TP
.BR . mailrc
startup file for
.IR mail (1)
.IP calendar
user's datebook for
.IR calendar (1)
.RE
.IP doc/
papers, mostly in volume 2 of this manual, typically in
.IR ms (7)
format
.RS
.IP as/
assembler manual
.IP c
C manual
.IP ...
.RE
.RE
.RE
.IP /usr/\tsrc/
.RS
.IP
source programs for utilities, etc.
.RS
D 2
.IP cmd/
source of commands
E 2
I 2
.IP bin/
source of commands in /bin
E 2
.RS
.IP as/
assembler
.IP ar.c
source for
.IR ar (1)
.IP ...
I 2
.RE
.IP usr.bin/
source for commands in /usr/bin
.RS
E 2
.IP troff/
source for
.I nroff
and
.IR troff (1)
.RS
.IP font/
source for font tables, /usr/lib/font/
.RS
.IP ftR.c
Roman
.IP ...
.RE
.IP term/
terminal characteristics tables, /usr/lib/term/
.RS
.IP tab300.c
DASI 300
.IP ...
.RE
.IP ...
.RE
.RE
I 2
.IP ucb
source for programs in /usr/ucb
E 2
.IP games/
source for /usr/games
I 2
.IP lib/
source for programs and archives in /lib
.RS
E 2
.IP libc/
D 2
source for functions in /lib/libc.a
E 2
I 2
C runtime library
E 2
.RS
D 2
.IP crt/
C runtime support
E 2
.IP csu/
startup and wrapup routines needed with every C program
.RS
.IP crt0.s
regular startup
.IP mcrt0.s
modified startup for
.I cc \-p
.RE
.IP sys/
system calls (2)
.RS
.IP access.s
D 2
.IP alarm.s
E 2
I 2
.IP brk.s
E 2
.IP ...
.RE
I 2
.RE
E 2
.IP stdio/
standard I/O functions (3S)
.RS
.IP fgets.c
.IP fopen.c
.IP ...
.RE
.IP gen/
other functions in (3)
.RS
.IP abs.c
.IP ...
.RE
I 2
.IP net/
network functions in (3N)
.RS
.IP gethostbyname.c
.IP ...
E 2
.RE
I 2
.RE
E 2
.IP local/
source which isn't normally distributed
.IP new/
source for new versions of commands and library routines
.IP old/
source for old versions of commands and library routines
D 2
.IP sys/
system source
.RS
.IP h/
header (include) files
.RS
.IP acct.h
.IR acct (5)
.IP stat.h
.IR stat (2)
.IP ...
.RE
.IP sys/
system source proper
.RS
.IP main.c
.IP pipe.c
.IP sysent.c
system entry points
.RE
.RE
.RE
E 2
.IP ucb/
binaries of programs developed at UCB
.RS
.IP ...
.IP edit
editor for beginners
.IP ex
command editor for experienced users
.IP ...
.IP mail
mail reading/sending subsystem
.IP man
on line documentation
.IP ...
.IP pi
Pascal translator
.IP px
Pascal interpreter
.IP ...
.IP vi
visual editor
.RE
.RE
.ad
.SH SEE ALSO
D 2
ls(1), apropos(1), whatis(1), whereis(1), finger(1), which (1), ncheck(8), find(1), grep(1)
E 2
I 2
ls(1),
apropos(1),
whatis(1),
whereis(1),
finger(1),
which(1),
ncheck(8),
find(1),
grep(1)
E 2
.SH BUGS
The position of files is subject to change without notice.
E 1
