abs0/4.3BSD-Quasijarus/man/man7/SCCS/s.hostname.7
h02551
s 00050/00000/00000
d D 6.1 87/11/21 14:33:27 karels 1 0
c date and time created 87/11/21 14:33:27 by karels
e
u
U
t
T
I 1
.\" Copyright (c) 1987 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH HOSTNAME 7 "%Q%"
.UC 5
.SH NAME
hostname \- host name resolution description
.SH DESCRIPTION
Hostnames are domains, where a domain is a hierarchical, dot-separated
list of subdomains; for example, the machine monet, in the Berkeley
subdomain of the EDU subdomain of the ARPANET would be represented as
.br
		monet.Berkeley.EDU
.br
(with no trailing dot).
.PP
Hostnames are often used with network client and server programs,
which must generally translate the name to an address for use.
(This function is generally performed by the library routine
.IR gethostbyname (3).)
Hostnames are resolved by the internet name resolver in the following
fashion.
.PP
If the name consists of a single component, i.e. contains no dot,
and if the environment variable ``HOSTALIASES'' is set to the name of a file,
that file is searched for an string matching the input hostname.
The file should consist of lines made up of two white-space separated strings,
the first of which is the hostname alias,
and the second of which is the complete hostname
to be substituted for that alias.
If a case-sensitive match is found between the hostname to be resolved
and the first field of a line in the file, the substituted name is looked
up with no further processing.
.PP
If the input name ends with a trailing dot,
the trailing dot is removed,
and the remaining name is looked up with no further processing.
.PP
If the input name does not end with a trailing dot, it is looked up in
the local domain and its parent domains until either a match is found
or fewer than 2 components of the local domain remain.  For example,
in the domain CS.Berkeley.EDU, the name lithium.CChem will be checked first
as lithium.CChem.CS.Berkeley.EDU and then as lithium.CChem.Berkeley.EDU.
Lithium.CChem.EDU will not be tried, as the there is only one component
remaining from the local domain.
.SH SEE ALSO
gethostbyname(3), resolver(5), mailaddr(7), named(8), RFC883
E 1
