abs0/4.3BSD-Quasijarus/man/man7/SCCS/s.me.7
h61647
s 00001/00001/00289
d D 6.3 86/05/06 15:07:48 anne 5 4
c spelling, grammar, diction
e
s 00014/00000/00276
d D 6.2 86/03/27 12:14:21 eric 4 3
c document .bu and .sm
e
s 00001/00001/00275
d D 6.1 85/05/20 20:30:41 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00002/00002/00274
d D 5.1 85/05/20 20:29:37 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00276/00000/00000
d D 4.1 85/05/20 20:29:02 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.hc %
D 2
.TH ME 7 11/16/79
E 2
I 2
D 3
.TH ME 7 "16 November 1979"
E 3
I 3
.TH ME 7 "%Q%"
E 3
E 2
.UC 3
.SH NAME
me \- macros for formatting papers
.SH SYNOPSIS
.B "nroff \-me"
[ options ]
file ... 
.br
.B "troff \-me"
[ options ]
file ... 
.SH DESCRIPTION
This package of 
.I nroff
and
.I troff
macro definitions provides a canned formatting
facility for tech%nical papers in various formats.
When producing 2-column output on a terminal, filter
the output through
.IR  col (1).
.PP
The macro requests are defined below.
Many
.I nroff
and
.I troff
requests are unsafe in conjunction with
D 5
this package, however these requests may be used with
E 5
I 5
this package, however, these requests may be used with
E 5
impunity after the first .pp:
.nf
.IP
.ta \w'.sz +n  'u
\&.bp	begin new page
\&.br	break output line here
\&.sp n	insert n spacing lines
\&.ls n	(line spacing) n=1 single, n=2 double space
\&.na	no alignment of right margin
\&.ce n	center next n lines
\&.ul n	underline next n lines
\&.sz +n	add n to point size
.fi
.PP
Output of the
.I eqn,
.I neqn,
.I refer,
and
.IR  tbl (1)
preprocessors
for equations and tables is acceptable as input.
.SH FILES
/usr/lib/tmac/tmac.e
.br
/usr/lib/me/*
.SH "SEE ALSO"
eqn(1), troff(1), refer(1), tbl(1)
.br
\-me Reference Manual, Eric P. Allman
.br
Writing Papers with Nroff Using \-me
.tr &.
.SH REQUESTS 
In the following list,
\*(lqinitialization\*(rq
refers to the first .pp, .lp, .ip, .np, .sh, or .uh macro.
This list is incomplete;
see
.I "The \-me Reference Manual"
for interesting details.
.PP
.ta \w'.eh \'x\'y\'z\'  'u +\w'Initial 'u +\w'Cause 'u
.br
.di x
			\ka
.br
.di
.in \nau
.ti0
Request	Initial	Cause	Explanation
.ti0
	Value	Break
.br
.in \nau
.ti0
\&.(c	-	yes	Begin centered block
.ti0
\&.(d	-	no	Begin delayed text
.ti0
\&.(f	-	no	Begin footnote
.ti0
\&.(l	-	yes	Begin list
.ti0
\&.(q	-	yes	Begin major quote
.ti0
\&.(x \fIx\fR	-	no	Begin indexed item in index
.I x
.ti0
\&.(z	-	no	Begin floating keep
.ti0
\&.)c	-	yes	End centered block
.ti0
\&.)d	-	yes	End delayed text
.ti0
\&.)f	-	yes	End footnote
.ti0
\&.)l	-	yes	End list
.ti0
\&.)q	-	yes	End major quote
.ti0
\&.)x	-	yes	End index item
.ti0
\&.)z	-	yes	End floating keep
.ti 0
\&.++ \fIm H\fR	-	no	Define paper section.
.I m
defines the part of the paper, and can be
.B C
(chapter),
.B A
(appendix),
.B P
(preliminary, e.g., abstract, table of contents, etc.),
.B B
(bibliography),
.B RC
(chapters renumbered from page one each chapter),
or
.B RA
(appendix renumbered from page one).
.ti 0
\&.+c \fIT\fR	-	yes	Begin chapter (or appendix, etc., as
set by .++).
.I T
is the chapter title.
.ti0
\&.1c	1	yes	One column format on a new page.
.ti0
\&.2c	1	yes	Two column format.
.ti0
\&.EN	-	yes	Space after equation
produced by
.I eqn
or
.IR neqn .
.ti0
\&.EQ \fIx y\fR	-	yes	Precede equation; break out and
add space.
Equation number is
.IR y .
The optional argument \fIx\fR
may be
.I I
to indent equation (default),
.I L
to left-adjust the equation, or
.I C
to center the equation.
.ti0
I 4
\&.GE	-	yes	End \fIgremlin\fP picture.
.ti0
\&.GS	-	yes	Begin \fIgremlin\fP picture.
.ti0
\&.PE	-	yes	End \fIpic\fP picture.
.ti0
\&.PS	-	yes	Begin \fIpic\fP picture.
.ti0
E 4
\&.TE	-	yes	End table.
.ti0
\&.TH	-	yes	End heading section of table.
.ti0
\&.TS \fIx\fR	-	yes	Begin table; if \fIx\fR is
.I H
table has repeated heading.
.ti 0
\&.ac \fIA N\fR	-	no	Set up for ACM style output.
.I A
is the Author's name(s),
.I N
is the total number of pages.
Must be given before the first initialization.
.ti0
\&.b \fIx\fR	no	no	Print
.I x
in boldface; if no argument switch to boldface.
.ti 0
\&.ba \fI+n\fR	0	yes	Augments the base indent by
.I n.
This indent is used to set the indent on regular text
(like paragraphs).
.ti0
\&.bc	no	yes	Begin new column
.ti0
\&.bi \fIx\fR	no	no	Print
.I x
in bold italics (nofill only)
.ti0
I 4
\&.bu	-	yes	Begin bulleted paragraph
.ti0
E 4
\&.bx \fIx\fR	no	no	Print \fIx\fR in a box (nofill only).
.ti 0
\&.ef \fI\'x\'y\'z\'\fR	\'\'\'\'	no	Set even footer to x  y  z
.ti 0
\&.eh \fI\'x\'y\'z\'\fR	\'\'\'\'	no	Set even header to x  y  z
.ti 0
\&.fo \fI\'x\'y\'z\'\fR	\'\'\'\'	no	Set footer to x  y  z
.ti 0
D 2
\&.hx	-	no	Supress headers and footers on next page.
E 2
I 2
\&.hx	-	no	Suppress headers and footers on next page.
E 2
.ti0
\&.he \fI\'x\'y\'z\'\fR	\'\'\'\'	no	Set header to x  y  z
.ti0
\&.hl	-	yes	Draw a horizontal line
.ti0
\&.i \fIx\fR	no	no	Italicize
.I x;
if
.I x
missing, italic text follows.
.ti0
\&.ip \fIx y\fR	no	yes	Start indented paragraph,
with hanging tag
.IR x .
Indentation is
.I y
ens (default 5).
.ti0
\&.lp	yes	yes	Start left-blocked paragraph.
.ti 0
\&.lo	-	no	Read in a file of local macros of the
form
.BI \&.* x.
Must be given before initialization.
.ti0
\&.np	1	yes	Start numbered paragraph.
.ti 0
\&.of \fI\'x\'y\'z\'\fR	\'\'\'\'	no	Set odd footer to x  y  z
.ti 0
\&.oh \fI\'x\'y\'z\'\fR	\'\'\'\'	no	Set odd header to x  y  z
.ti 0
\&.pd	-	yes	Print delayed text.
.ti0
\&.pp	no	yes	Begin paragraph.
First line indented.
.ti0
\&.r	yes	no	Roman text follows.
.ti 0
\&.re	-	no	Reset tabs to default values.
.ti 0
\&.sc	no	no	Read in a file of special characters
and diacritical marks.
Must be given before initialization.
.ti0
\&.sh \fIn x\fR	-	yes	Section head follows,
font automatically bold.
.I n
is level of section,
.I x
is title of section.
.ti 0
\&.sk	no	no	Leave the next page blank.
Only one page is remembered ahead.
I 4
.ti0
\&.sm \fIx\fR	-	no	Set
.I x
in a smaller pointsize.
E 4
.ti 0
\&.sz \fI+n\fR	10p	no	Augment the point size by
.I n
points.
.ti 0
\&.th	no	no	Produce the paper in thesis format.
Must be given before initialization.
.ti 0
\&.tp	no	yes	Begin title page.
.ti0
\&.u \fIx\fR	-	no	Underline argument (even in \fItroff\fR).
(Nofill only).
.ti0
\&.uh	-	yes	Like .sh but unnumbered.
.ti0
\&.xp \fIx\fR	-	no	Print index
.I x.
E 1
