abs0/4.3BSD-Quasijarus/man/man4/tahoe/SCCS/s.ace.4
h23214
s 00001/00001/00061
d D 6.2 87/06/30 21:22:13 sam 2 1
c update addresses to reflect change form 24 to 32 bit addresses 
c in config file; rewrite cy.4 and vd.4 as well as vx.4
e
s 00062/00000/00000
d D 6.1 86/11/29 12:14:56 sam 1 0
c date and time created 86/11/29 12:14:56 by sam
e
u
U
t
T
I 1
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH ACE 4 "May 16, 1986"
.UC 5
.SH NAME
ace \- ACC 10 Mb/s Ethernet interface
.SH SYNOPSIS
D 2
.B "device ace0 at vba? csr 0xff0000 flags 0xfff80000 vector acecint acerint"
E 2
I 2
.B "device ace0 at vba? csr 0xffff0000 flags 0xfff80000 vector acecint acerint"
E 2
.SH DESCRIPTION
The
.I ace
interface provides access to a 10 Mb/s Ethernet network through
an ACC controller.
.PP
The hardware has 32 kilobytes of dual-ported memory on the VERSAbus. 
This memory
is used for internal buffering by the board, and the interface code reads
the buffer contents directly through the VERSAbus.
The address of this memory is given in the \fIflags\fP field
in the configuration file.
.PP
Each of the host's network addresses
is specified at boot time with an SIOCSIFADDR
ioctl.  The
.I ace
interface employs the address resolution protocol described in
.IR arp (4P)
to dynamically map between Internet and Ethernet addresses on the local
network.
.PP
The interface normally tries to use a ``trailer'' encapsulation
to minimize copying data on input and output.
The use of trailers is negotiated with ARP.
This negotiation may be disabled, on a per-interface basis,
by setting the IFF_NOTRAILERS
flag with an SIOCSIFFLAGS ioctl.
.PP
The device implements an exponential backoff algorithm
when notified of a collision on the cable.  This algorithm utilizes
a table of random numbers setup by the system at boot time.
The delay is done in the controller.
.SH DIAGNOSTICS
.BR "ace%d: stray xmit interrupt, xnct %d" .
An unexpected transmission complete interrupt was received;
the interrupt is ignored.
.BR "ace%d: can't handle af%d" .
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.SH SEE ALSO
intro(4N), inet(4F), arp(4P)
.SH BUGS
The hardware is not capable of talking to itself.  The software
implements local sending and broadcast by sending such packets to the
loop interface.  This is a kludge.
.PP
The device doesn't autoconfigure its interrupt vector; it is set
at 0x90 + eight times the unit number.
E 1
