abs0/4.3BSD-Quasijarus/man/man4/tahoe/SCCS/s.autoconf.4
h03706
s 00032/00010/00037
d D 6.2 87/06/30 21:22:15 sam 2 1
c update addresses to reflect change form 24 to 32 bit addresses 
c in config file; rewrite cy.4 and vd.4 as well as vx.4
e
s 00047/00000/00000
d D 6.1 86/11/24 18:19:27 mckusick 1 0
c from CCI
e
u
U
t
T
I 1
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH AUTOCONF 4 "%Q%"
.UC 7
.SH NAME
D 2
autoconf \- diagnostics from autoconfiguartion code
E 2
I 2
autoconf \- diagnostics from autoconfiguration code
E 2
.SH DESCRIPTION
When UNIX bootstraps it probes the innards of the machine it is running
on and locates controllers, drives, and other devices, printing out
what it finds on the console.  This procedure is driven by a system
configuration table which is processed by
.IR config (8)
and compiled into each kernel.
.PP
D 2
VERSABUS devices are located by probing to see if their control-status
E 2
I 2
VERSAbus devices are located by probing to see if their control-status
E 2
registers respond.  If not, they are silently ignored.  If the control
status register responds but the device cannot be made to interrupt,
a diagnostic warning will be printed on the console and the device
will not be available to the system.
.PP
A generic system may be built which picks its root device at boot time
as the ``best'' available device.
If such a system is booted with the RB_ASKNAME option of (see
.IR reboot (2v)),
then the name of the root device is read from the console terminal at boot
time, and any available device may be used.
.SH SEE ALSO
config(8)
.SH DIAGNOSTICS
I 2
\fBvba%d at %x\fR.  A VERSAbus adapter was found and mapped into the
address space of the operating system starting at virtual address %x.
UNIX will call it vba%d.
E 2
.PP
D 2
\fB%s%d at vba address %o vec %o\fR.  The device %s%d, e.g. fsd0
was found on the bus at control-status register address %o and with
device vector %o.
E 2
I 2
\fB%s%d at vba%d drive %d\fR.  A tape formatter or a disk was found
on the VERSAbus; for disks %s%d will look like ``dk0'', for tape formatters
like ``yc1''.  The drive number comes from the unit plug on the drive
or in the tape formatter (\fBnot\fR on the tape drive; see below).
E 2
.PP
D 2
\fB%s%d at vba address %o didn't interrupt\fR.  The device did not interrupt,
E 2
I 2
\fB%s%d at %s%d slave %d\fR. 
Which would look like ``yc0 at cy0 slave 0'',
where \fByc0\fR is the name for the tape device and \fBcy0\fR is the name
for the formatter.  A tape slave was found on the tape formatter at the
indicated drive number (on the front of the tape drive).
UNIX will call the device, e.g., \fBcy0\fR.
.PP
\fB%s%d at vba%d csr %x vec %x ipl %x\fR.  The device %s%d, e.g. vd0
was found on vba%d at control-status register address %x and with
device vector %x.  The device interrupted at priority level %x.
.PP
\fB%s%d at vba%d csr %x no interrupts\fR.  The device was found
on vba%d at control-status register address %x; no
interrupts were configured for the device.
.PP
\fB%s%d at vba%d csr %x didn't interrupt\fR.  The device did not interrupt,
E 2
likely because it is broken, hung, or not the kind of device it is advertised
D 2
to be.
E 2
I 2
to be.  The csr address is interpreted as described above.
E 2
.PP
\fB%s%d at %s%d slave %d\fR.
D 2
Which would look like ``smd0 at vd0 slave 0'',
where \fBsmd0\fR is the name of a disk drive and \fBvd0\fR is the name
of the controller.
E 2
I 2
Which would look like ``dk0 at vd0 slave 0'',
where \fBdk0\fR is the name of a disk drive and \fBvd0\fR is the name
of the controller. 
E 2
.SH BUGS
I 2
Very few devices actually figure out their interrupt vector
by forcing the device to interrupt.  Only the upper megabyte of the
VERSAbus address space is mapped into the system's virtual address space.
E 2
E 1
