abs0/4.3BSD-Quasijarus/man/man4/tahoe/SCCS/s.dr.4
h54830
s 00001/00001/00130
d D 6.2 87/06/30 21:22:19 sam 2 1
c update addresses to reflect change form 24 to 32 bit addresses 
c in config file; rewrite cy.4 and vd.4 as well as vx.4
e
s 00131/00000/00000
d D 6.1 86/11/29 12:14:55 sam 1 0
c date and time created 86/11/29 12:14:55 by sam
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH DR 4 "November 21, 1986"
.UC 5
.SH NAME
dr \- Ikon DR-11W interface
.SH SYNOPSIS
D 2
.B "device dr0 at vba? csr 0xff8000 vector drintr"
E 2
I 2
.B "device dr0 at vba? csr 0xffff8000 vector drintr"
E 2
.SH DESCRIPTION
The
.I dr
driver provides access
to an Ikon DR-11W DMA controller.
Each minor device is a different controller.
.PP
In addition to reading and writing, the following
.I ioctl
requests are available:
.TP 10
DRWAIT
Wait for an attention interrupt from the associated device.
.TP
DRPIOW
Write to the programmed i/o register.
.TP
DRPACL
Write to the pulse register.
.TP
DRDACL
Set the ``ac-low'' bit in the next command sent to the DR-11W.
.TP
DRPCYL
Set the ``cycle'' bit in the next command sent to the DR-11W.
.TP
DRDFCN
Hold the function bits until the next command is issused.
.TP
DRRATN
Reset the attention flag.
.TP
DRRDMA
Reset the DMA complete flag.
.TP
DRSFCN
Set the function bits in the control status register and,
as a side effect, clear the interrupt enable flag.
.TP
DRRPER
Reset the parity error flag.
.TP
DRSETRSTALL
Set ``no stall'' mode for all subsequent reads.
In no stall mode the driver will abort
read requests that fail to complete before a user
specified timeout expires.
.TP
DRSETNORSTALL
Disable no stall mode for reads.
.TP
DRGETRSTALL
Return true if in no stall mode for reads.
.TP
DRSETRTIMEOUT
Set the value of the timeout used in no stall mode  for
reads.  The time is specified in tenths of seconds.
.TP
DRGETRTIMEOUT
Return the time until (in tenths of seconds) before a read
is timed out when in no stall mode.
.TP
DRSETWSTALL
Set ``no stall'' mode for all subsequent writes.
In no stall mode the driver will abort
write requests that fail to complete before a user
specified timeout expires.
.TP
DRSETNOWSTALL
Disable no stall mode for writes.
.TP
DRGETWSTALL
Return true if in no stall mode for writes.
.TP
DRSETWTIMEOUT
Set the value of the timeout used in no stall mode  for
writes.  The time is specified in tenths of seconds.
.TP
DRGETRTIMEOUT
Return the time until (in tenths of seconds) before a write
is timed out when in no stall mode.
.TP
DRWRITEREADY
Return 1 if the device can accept data, 0 otherwise
(this is areally the DR-11W A status bit).
.TP
DRREADREADY
Return 1 if the device has data for the host to read,
0 otherwise (this is really the DR-11W B status bit).
.TP
DRBUSY
Return 1  if the device is busy, 0 otherwise.
.TP
DRRESET
Reset the DR-11W.
.TP
DR11STAT
Return the driver status and the contents of the
DR-11W i/o registers.  The
eight words returned are, in order, the driver
status flags, the contents of the control status
register, the contents of the status register
at the time of the last interrupt from the device,
the contents of the programmed i/o data register,
a combination of the address modifier used by the
device in performing VERSAbus transfers and the
interrupt vector used by the device, the contents
of the range register, the contents of the rahi
register, and the contents of the ralo register.
.TP
DR11LOOP
Perform loopback testing (the loopback cable must
be in place for this to work).
.SH FILES
/dev/dr[0-7]	standard devices
.SH DIAGNOSTICS
Lots of them, none of them meaningful.
.SH BUGS
This driver needs to be rewritten.
E 1
