abs0/4.3BSD-Quasijarus/man/man4/tahoe/SCCS/s.intro.4
h64153
s 00011/00007/00053
d D 6.2 87/06/30 21:22:22 sam 2 1
c update addresses to reflect change form 24 to 32 bit addresses 
c in config file; rewrite cy.4 and vd.4 as well as vx.4
e
s 00060/00000/00000
d D 6.1 86/11/24 18:21:19 mckusick 1 0
c from CCI
e
u
U
t
T
I 1
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH INTRO 4 "%Q%"
.UC 7
.SH NAME
intro \- introduction to special files and hardware support
.SH DESCRIPTION
This section describes the special files, related driver functions,
and networking support
available in the system.
In this part of the manual, the SYNOPSIS section of
each configurable device gives a sample specification
for use in constructing a system description for the
.IR config (8)
program.
The DIAGNOSTICS section lists messages which may appear on the console
and in the system error log
.I /usr/adm/messages
due to errors in device operation.
.PP
This section contains both devices
which may be configured into the system, ``4'' entries,
and network related information,
``4N'', ``4P'', and ``4F'' entries;
The networking support is introduced in
.IR intro (4N).
.PP
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.  When the resultant system is booted, the
autoconfiguration facilities in the system probe for the device
D 2
on the VERSABUS and, if found, enable the software
support for it.  If a VERSABUS device does not respond at autoconfiguration
E 2
I 2
on the VERSAbus and, if found, enable the software
support for it.  If a VERSAbus device does not respond at autoconfiguration
E 2
time it is not accessible at any time afterwards.  To
D 2
enable a VERSABUS device which did not autoconfigure, the system will have to
E 2
I 2
enable a VERSAbus device which did not autoconfigure, the system will have to
E 2
be rebooted.
.PP
The autoconfiguration system is described in
.IR autoconf (4).
.SH SEE ALSO
autoconf(4),
config(8)
.SH "LIST OF DEVICES"
The devices listed below are supported in this incarnation of
the system.  Devices are indicated by their functional interface.
If second vendor products provide functionally identical interfaces
they should be usable with the supplied software.
(\fBBeware however that we promise the software works
ONLY with the hardware indicated on the appropriate manual page.\fP)
.sp
.ta 1.0i
.nf
D 2
cons	CPU-2 console interface
cy	CYPHER tape drive interface
vd	VD mass storage disk controller
vioc	VIOC-X terminal multiplexor
E 2
I 2
ace	ACC 10 Mb/s Ethernet controller
cons	Tahoe console interface
cy	Cypher tape drive interface
dr	Ikon DR-11W controller
enp	3Com 10 Mb/s Ethernet controller
ik	Evans and Sutherland PS300 interface through an Ikon DR-11W controller
vd	CCI vd mass storage disk controller
vx	CCI vioc terminal multiplexor
E 2
E 1
