abs0/4.3BSD-Quasijarus/man/man4/tahoe/SCCS/s.mpcc.4
h16065
s 00006/00000/00044
d D 6.3 88/07/20 15:41:37 bostic 3 2
c note that as of 4.3BSD-tahoe release, nothing but 16-async works
e
s 00015/00009/00029
d D 6.2 88/05/04 15:37:00 bostic 2 1
c update from Keith Muller
e
s 00038/00000/00000
d D 6.1 87/05/01 17:39:36 mckusick 1 0
c from CCI
e
u
U
t
T
I 1
.\" Copyright (c) 1987 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH MPCC 4 "%Q%"
.UC 7
.SH NAME
mpcc \- Multi protocol communications controller
.SH SYNOPSIS
D 2
device mp0 at vba0 csr 0xff5000
E 2
I 2
device mp0 at vba? csr 0xffff5000 mpintr mpdlintr
E 2
.br
thru
.br
D 2
device mp15 at vba0 csr 0xff5f00
E 2
I 2
device mp15 at vba? csr 0xffff5f00 mpintr mpdlintr
E 2
.SH DESCRIPTION
The MPCC has two different connecter panel styles.
The 16 port MPCC will support any combination of SYNC or ASYNC ports.
The 32 port MPCC will only support ASYNC ports.
Each async line attached to the MPCC communications controller
behaves as described in
.IR tty (7)
and may be set to run at any of 16 speeds; see
.IR tty (7)
for the encoding.
.PP
D 2
Each MPCC controller uses 2 entries in the SCB for download/handshake,
and command/response interrupts.
These entries start at 0xa0 for the 1st controllers download/handshake
interrupts thru 0xaf, and 0xb0 for the 1st controllers command/response
interrupts thru 0xbf.
E 2
I 2
Each MPCC controller uses 2 consecutive entries in the SCB for
download/handshake, and command/response interrupts.  These entries
start at 0xa0 for the 1st controllers download/handshake interrupts
and 0xa1 for the 1st controllers command/response.
.PP
The MPCC controller requires a firmware download to be completed
before it can function.  See \fIdlmpcc\fP(8) and \fImpcctab\fP(4)
for specific information on how to configure and download the
firmware into the MPCC controller.
.PP
A maximum of 16 MPCC communication controllers can be supported.
E 2
.SH FILES
D 2
/dev/tty[0-f][0-f] For 16 port MPCC
E 2
I 2
/dev/tty[A-P][0-f] for 16 port MPCC
E 2
.br
D 2
/dev/tty[0-f][0-f,g-v] For 32 port MPCC
E 2
I 2
/dev/tty[A-P][0-f,g-v] for 32 port MPCC
E 2
.SH "SEE ALSO"
tty(7)
I 3
.SH BUGS
As of the 4.3BSD-tahoe release, only 16 port mpcc's work, and then
only in async mode.  Attempting to reload firmware on an mpcc with
active ports may crash the system.  This should be fixed within
a short period of time; contact the CSRG at University of California,
Berkeley, for upgrade information.
E 3
E 1
