abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.ad.4
h33440
s 00001/00001/00040
d D 6.1 85/05/15 17:41:33 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00041/00000/00000
d D 5.1 85/05/15 17:41:27 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH AD 4 "27 July 1983"
E 2
I 2
.TH AD 4 "%Q%"
E 2
.UC 5
.SH NAME
ad \- Data Translation A/D converter
.SH SYNOPSIS
.B "device ad0 at uba0 csr 0170400 vector adintr"
.SH DESCRIPTION
.I Ad
provides the interface to the Data Translation A/D converter.
This is
.B not
a real-time driver, but merely allows
the user process to sample the board's channels one at a time.
Each minor device selects a different A/D board.
.PP
The driver communicates to a user process by means of ioctls.
The AD_CHAN ioctl selects which channel of the board to read.
For example,
.br
.in +.5i
chan = 5;
ioctl(fd, AD_CHAN, &chan);
.in -.5i
selects channel 5.
The AD_READ ioctl actually reads the data and returns it to the user
process.
An example is
.br
.in +.5i
ioctl(fd, AD_READ, &data);
.in -.5i
.SH FILES
/dev/ad
.SH DIAGNOSTICS
None.
E 1
