abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.cons.4
h45678
s 00017/00006/00037
d D 6.2 86/05/19 16:33:41 karels 4 3
c 8600
e
s 00001/00001/00042
d D 6.1 85/05/15 17:17:55 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00004/00003/00039
d D 5.1 85/05/15 17:17:47 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00042/00000/00000
d D 4.1 85/05/15 17:17:39 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH CONS 4 4/1/81
E 2
I 2
D 3
.TH CONS 4 "27 July 1983"
E 3
I 3
.TH CONS 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
cons \- VAX-11 console interface
.SH DESCRIPTION
The console is available to the processor through the console registers.
It acts like a normal terminal, except that when the local functions are
not disabled, control-P puts the console in local console mode (where
the prompt is ``>>>'').  The operation of the console in this mode varies
slightly per-processor.
.PP
D 4
On an 11/780 you can return to the conversational mode using the command
E 4
I 4
On an 11/780 or 785
the processor is not stopped by entering local console mode.
The CPU may be halted with the ``halt'' command, which may be abbreviated
to ``h.''
Conversational mode is re-entered by using the command
E 4
D 2
``se t p'' if the processor is still running or ``continue'' if it is halted.
E 2
I 2
``set t p'' (set terminal program) if the processor is still
D 4
running or ``continue'' if it is halted.
E 4
I 4
running, or ``continue'' if it is halted.
E 4
E 2
The latter command may be abbreviated ``c''.
D 4
If you hit the break key on the console, then the console will go into ODT
(console debugger mode).  Hit a ``P'' (upper-case letter p)
E 4
I 4
If you hit the break key on the console, then the console LSI-11
will go into ODT
(console debugger mode).  Hit a ``P'' (upper-case letter p; ``proceed'')
E 4
to get out of this mode.
.PP
On an 11/750
D 2
..or an 11/730
E 2
I 2
or an 11/730
E 2
the processor is halted whenever the console is not in conversational mode,
and typing ``C'' returns to conversational mode.
When in console mode on an 11/750 which has a remote diagnosis module,
a ^D will put you in remote diagnosis mode, where the prompt will be ``RDM>''.
The command ``ret'' will return from remote diagnosis mode to local console
mode.
.PP
I 4
The VAX 8600 (8650) console normally works in the same way as the 11/750,
except that there are many additional modes and commands.
In the normal mode
control-P halts the processor, and ``c'' or ``continue'' returns to
conversational mode.
If HEX debug is enabled, control-P does not halt the CPU; the ``halt''
command stops the CPU as on the 11/780.
.PP
E 4
With the above proviso's the console works like any other UNIX terminal.
.SH FILES
/dev/console
.SH "SEE ALSO"
tty(4), reboot(8)
.br
VAX Hardware Handbook
D 4
.SH DIAGNOSTICS
None.
E 4
E 1
