abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.css.4
h56998
s 00001/00001/00056
d D 6.1 85/05/15 17:41:46 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00057/00000/00000
d D 5.1 85/05/15 17:41:40 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH CSS 4 "27 July 1983"
E 2
I 2
.TH CSS 4 "%Q%"
E 2
.UC 5
.SH NAME
css \- DEC IMP-11A LH/DH IMP interface
.SH SYNOPSIS
.B "pseudo-device imp"
.br
.B "device css0 at uba0 csr 167600 flags 10 vector cssrint cssxint"
.SH DESCRIPTION
The 
.I css
device provides a Local Host/Distant Host
interface to an IMP.  It is normally used when participating
in the DARPA Internet.  The controller itself is not accessible
to users, but instead provides the hardware support to the IMP
interface described in
.IR imp (4).
When configuring, the 
.I imp
pseudo-device is also included.
.SH DIAGNOSTICS
.BR "css%d: not alive" .
The initialization routine was entered even though the device
did not autoconfigure.  This is indicates a system problem.
.PP
.BR "css%d: can't initialize" .
Insufficient UNIBUS resources existed to initialize the device.
This is likely to occur when the device is run on a buffered
data path on an 11/750 and other network interfaces are also
configured to use buffered data paths, or when it is configured
to use buffered data paths on an 11/730 (which has none).
.PP
.BR "css%d: imp doesn't respond, icsr=%b" .
The driver attempted to initialize the device, but the IMP
failed to respond after 500 tries.  Check the cabling.
.PP
.BR "css%d: stray output interrupt csr=%b" .
An interrupt occurred when no output had previously been started. 
.PP
.BR "css%d: output error, ocsr=%b icsr=%b" .
The device indicated a problem sending data on output.
.PP
.BR "css%d: recv error, csr=%b" .
The device indicated a problem receiving data on input.
.PP
.BR "css%d: bad length=%d" .
An input operation resulted in a data transfer of less than
0 or more than 1008 bytes of
data into memory (according to the word count register).
This should never happen as the maximum size of a host-IMP
message is 1008 bytes.
E 1
