abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.ddn.4
h28585
s 00003/00001/00054
d D 6.2 86/05/16 15:54:04 karels 2 1
c updates
e
s 00055/00000/00000
d D 6.1 85/08/08 18:55:23 mckusick 1 0
c date and time created 85/08/08 18:55:23 by mckusick
e
u
U
t
T
I 1
.\"	%W% (Berkeley) %G%
.\"
.TH DDN 4 "%Q%"
.UC 6
.SH NAME
ddn \- DDN Standard Mode X.25 IMP interface
.SH SYNOPSIS
.B "device ddn0 at uba0 csr 166740 vector ddnintr"
.SH DESCRIPTION
The 
.I ddn
device provides a DDN Standard Mode X.25 interface to an IMP using
the ACC ACP625 X.25 board.  It is normally used for connecting to
the Defense Data Network (DDN).  The controller itself is not accessible
to users, but instead provides a network interface for the
Internet Protocol described in
D 2
.IR ip (4).
E 2
I 2
.IR ip (4P).
.SH SEE ALSO
intro(4N), ip(4P)
E 2
.SH DIAGNOSTICS
.BR "ddn%d: not alive" .
The initialization routine was entered even though the device
did not autoconfigure.  This indicates a system problem.
.PP
.BR "ddn%d: failed getting UBA resources for lcn %d" .
Insufficient UNIBUS resources existed to initialize the device.
This is likely to be a shortage of UNIBUS mapping registers.
.PP
.BR "ddn%d: couldn't get X25 init buffer" .
This indicates that an 
.I mbuf
could not be allocated for sending the initialization message to the
ACP625.
.PP
.BR "DDN: illegal X25 address length!"
.br
.BR "DDN: illegal X25 address format!"
.br
These errors indicate a problem with the called X.25 address received
from the IMP on an incoming call.
.PP
.BR "X25 RESET on lcn = %d" .
This indicates that an unexpected X.25 RESET was received on the
indicated LCN.
.PP
.BR "X25 INTERRUPT on lcn = %d, code = %d" .
This indicates that an unexpected X.25 INTERRUPT Packet was received on the
indicated LCN.
.PP
.BR "ddn%d: failed to get supr msg bfr!" .
This indicates that an 
.I mbuf
could not be allocated for sending a supervisor message to the
ACP625.
.PP
Any other error message from ddn%d: indicates a serious error
detected by either the driver or the ACP625 firmware.
E 1
