abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.dhu.4
h17724
s 00004/00004/00054
d D 6.2 86/04/27 01:08:50 donn 2 1
c Make tty names correspond to MAKEDEV.
e
s 00058/00000/00000
d D 6.1 85/07/25 12:10:50 mckusick 1 0
c date and time created 85/07/25 12:10:50 by mckusick
e
u
U
t
T
I 1
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH DHU 4 "%Q%"
.UC 6
.SH NAME
dhu \- DHU-11 communications multiplexer
.SH SYNOPSIS
.B "device dhu0 at uba0 csr 0160440 vector dhurint dhuxint"
.SH DESCRIPTION
A DHU-11 provides 16 communication lines.
.PP
Each line attached to the DHU-11 communications multiplexer
behaves as described in
.IR tty (4).
Input and output for each line may independently
be set to run at any of 13 speeds (50, 200 and 38400 baud are not available);
see
.IR tty (4)
for the encoding.
.PP
Bit
.I i
of flags may be specified for a DHU-11 to say that a line is not properly
connected, and that the line should be treated as hard-wired with carrier
always present.  Thus specifying ``flags 0x0004'' in the specification of dhu0
D 2
would cause line ttyh2 to be treated in this way.
E 2
I 2
would cause line ttyS2 to be treated in this way.
E 2
.PP
The DHU-11 driver normally uses input silos
and delays receiver interrupts by 20 milliseconds
rather than taking an interrupt on each input character.
.SH FILES
D 2
/dev/tty[hi][0-9a-f]
E 2
I 2
/dev/tty[S-Z][0-9a-f]
E 2
.SH "SEE ALSO"
tty(4)
.SH DIAGNOSTICS
D 2
\fBdhu(%d,%d): NXM fault\fR.  No response from UNIBUS on a dma transfer
E 2
I 2
\fBdhu(%d,%d): NXM fault\fR.  No response from UNIBUS on a DMA transfer
E 2
within a timeout period.  This is often followed by a UNIBUS adapter
error.  This occurs most frequently when the UNIBUS is heavily loaded
D 2
and when devices which hog the bus (such as rk07's) are present.
E 2
I 2
and when devices which hog the bus (such as RK07s) are present.
E 2
It is not serious.
.PP
\fBdhu%d: silo overflow\fR.  The character input silo overflowed
before it could be serviced.  This can happen if a hard error occurs
when the CPU is running with elevated priority, as the system may
then print a message on the console with interrupts disabled.
.SH NOTES
The driver currently does not make full use of the hardware
capabilities of the DHU-11, for dealing with XON/XOFF flow-control or hard-wired
lines for example.
.PP
Although the devices are not the same, a DHU-11 can convince the
DH-11 autoconfiguration code that it is a DH-11.
.PP
The 4 40-way cables are a pain.
E 1
