abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.dmz.4
h44377
s 00008/00006/00061
d D 6.3 86/05/16 15:58:44 karels 3 2
c new silo handling
e
s 00000/00003/00067
d D 6.2 86/04/27 00:15:32 donn 2 1
c Prune irrelevant verbiage.
e
s 00070/00000/00000
d D 6.1 86/04/08 14:44:18 donn 1 0
c date and time created 86/04/08 14:44:18 by donn
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH DMZ 4 "April 7, 1986"
.UC 5
.SH NAME
dmz \- DMZ-32 terminal multiplexor
.SH SYNOPSIS
.B "device dmz0 at uba? csr 0160540"
.br
.ti +0.5i
.B "vector dmzrinta dmzxinta dmzrintb dmzxintb dmzrintc dmzxintc"
.SH DESCRIPTION
The 
.I dmz
device provides 24 lines of asynchronous serial line support.
D 2
The DMZ-32 is connected to an H3014 distribution panel
by a cable that may be up to a mile in length and
the two ends communicate using a T1 protocol.
E 2
Modem control on all ports is available
as an option for the H3014 distribution panel.
.PP
Each line attached to a DMZ-32 serial line port behaves as described
in
.IR tty (4).
Input and output for each line may independently be set to run at any
of 16 speeds; see
.IR tty (4)
for the encoding.
.PP
Bit
.I i
of flags may be specified for a
.I dmz
to to say that a line is not properly connected, and that the
line should be treated as hard-wired with carrier always present.
Thus specifying ``flags 0x000004'' in the specification of 
.IR dmz 0
would cause line
.I ttya2
to be treated in this way.
.PP
The
.I dmz
D 3
driver normally uses input silos and polls for input at each clock
tick (10 milliseconds).
It uses an adaptive algorithm on output
to decide whether to use programmed I/O or DMA
based on the amount of data to send.
E 3
I 3
driver normally enables the input silos with a short timeout
(30 milliseconds); this allows multiple characters to be received
per interrupt during periods of high-speed input.
E 3
.SH FILES
D 3
/dev/tty[abc][0-9a-n]
E 3
I 3
/dev/tty[abcefg][0-9a-n]
E 3
.SH SEE ALSO
tty(4)
.SH DIAGNOSTICS
.BR "dmz%d: NXM line %d" .
No response from the UNIBUS on a DMA transfer
within a timeout period.  This is often followed by a UNIBUS adapter
error.  This occurs most frequently when the UNIBUS is heavily loaded
and when devices which hog the bus (such as RK07s) are present.
It is not serious.
.PP
.BR "dmz%d: silo overflow" .
The character input silo overflowed
before it could be serviced.  This can happen if a hard error occurs
when the CPU is running with elevated priority, as the system will
then print a message on the console with interrupts disabled.
It is not serious.
I 3
.SH BUGS
It should be possible to set the silo timeout with a configuration file option,
as the value is a trade-off between efficiency and response time for flow
control and character echo.
E 3
E 1
