abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.dmv.4
h03692
s 00071/00000/00000
d D 6.1 88/06/13 15:09:44 mckusick 1 0
c date and time created 88/06/13 15:09:44 by mckusick
e
u
U
t
T
I 1
.\" Copyright (c) 1988 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH DMV 4 "%Q%"
.UC 6
.SH NAME
dmv \- DEC DMV-11 point-to-point communications device
.SH SYNOPSIS
.B "device dmv0 at uba0 csr 167000 vector dmvrint dmvxint"
.SH DESCRIPTION
The
.I dmv
interface provides access to a point-to-point communications
device which runs at up to 56 Kb/s.  DMV-11's communicate
using the DEC DDCMP link layer protocol.
.PP
The host's address must be specified with an SIOCSIFADDR ioctl,
and the destination address specified with a SIOCSIFDSTADDR ioctl,
before the interface will transmit or receive any packets.
.SH ROUTING
The driver places a HOST entry in the kernel routing tables for the
address given in the SIOCSIFDSTADDR ioctl.  To use the DMV as a
link between local nets, the route to the remote net must be added manually
with the
.IR route (8)
command, or by the use of the routing process
.IR routed (8)
on each end of the link.
.SH DIAGNOSTICS
.BR "dmvprobe: can't start device"
.BR "dmvprobe: device init failed, bsel4=%o, bsel6=%o"
The probe routine was unable to start the device.
.PP
.BR "dmvinit: dmv%d not running"
.BR "dmvrestart: can't start device"
.BR "dmv%d: device init failed, bsel4=%o, bsel6=%o"
The initialization/restart routine was unable to start the device.
.PP
.BR "dmv%d: far end on-line"
The other end of the connection has come online.
.PP
.BR "dmv%d: far end restart"
The other end of the line has restarted.
.PP
.BR "dmv%d: bad control %o" .
A bad parameter was passed to the
.I dmvload
routine.
.PP
.BR "dmvxint: dmv%d bad rcv pkt addr 0x%x len 0x%x"
A bad packet was received.
.PP
.BR "dmv%d: bad packet address 0x%x"
An input packet was received which contained a type of
address unknown to the driver.
.PP
.BR "dmvxint: dmv%d unallocated packet 0x%x"
A protocol error has occured with the board.
.PP
.BR "dmvoutput, dmv%d can't handle af%d"
A packet for an unsupported address family has been sent.
.PP
.BR "dmv%d: output timeout, bsel0=%b bsel2=%b"
A device timeout occurred.
.PP
Numerous other device errors may be displayed.
.SH SEE ALSO
dmc(4), intro(4N), inet(4F)
E 1
