abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.dz.4
h46401
s 00010/00013/00039
d D 6.2 86/05/16 15:58:47 karels 4 3
c new silo handling
e
s 00001/00001/00051
d D 6.1 85/05/15 17:19:49 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00004/00005/00048
d D 5.1 85/05/15 17:19:42 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00053/00000/00000
d D 4.1 85/05/15 17:19:34 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH DZ 4 9/1/81
E 2
I 2
D 3
.TH DZ 4 "27 July 1983"
E 3
I 3
.TH DZ 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
dz \- DZ-11 communications multiplexer
.SH SYNOPSIS
D 2
device dz0 at uba0 csr 0160100 vector dzrint dzxint
E 2
I 2
.B "device dz0 at uba0 csr 0160100 vector dzrint dzxint"
E 2
.SH DESCRIPTION
D 4
A dz-11 provides 8 communication lines with partial modem control,
E 4
I 4
A DZ11 provides 8 communication lines with partial modem control,
E 4
adequate for UNIX dialup use.
D 4
Each line attached to the DZ-11 communications multiplexer
E 4
I 4
Each line attached to the DZ11 communications multiplexer
E 4
behaves as described in
.IR tty (4)
and may be set to run at any of 16 speeds; see
.IR tty (4)
for the encoding.
.PP
Bit
.I i
of flags may be specified for a dz to say that a line is not properly
connected, and that the line should be treated as hard-wired with carrier
always present.  Thus specifying ``flags 0x04'' in the specification of dz0
would cause line tty02 to be treated in this way.
.PP
D 4
The dz driver normally uses its input silos
D 2
and polls for input at each clock tick (1/60'th of a
second) rather than taking an interrupt on each input character.
E 2
I 2
and polls for input at each clock tick (10 milliseconds)
rather than taking an interrupt on each input character.
E 4
I 4
The
.I dz
driver monitors the rate of input on each board,
and switches between the use of character-at-a-time interrupts
and input silos.
While the silo is enabled during periods of high-speed input,
the driver polls for input 30 times per second.
E 4
E 2
.SH FILES
/dev/tty[0-9][0-9]
.br
/dev/ttyd[0-9a-f]		dialups
.SH "SEE ALSO"
tty(4)
.SH DIAGNOSTICS
.PP
\fBdz%d: silo overflow\fR.  The 64 character input silo overflowed
before it could be serviced.  This can happen if a hard error occurs
when the CPU is running with elevated priority, as the system will
D 4
then print a message on the console with interrupts disabled.  If the
Berknet
D 2
.IR net (1)
E 2
is running on a
.I dz
line at high speed (e.g. 9600 baud), there is only 1/15th of a second of
buffering capacity in the silo, and overrun is possible.  This may
cause a few input characters to be lost to users and a network
packet is likely to be corrupted, but the network will recover.
E 4
I 4
then print a message on the console with interrupts disabled.
E 4
It is not serious.
E 1
