abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.ec.4
h23832
s 00009/00008/00080
d D 6.4 86/05/16 15:55:50 karels 5 4
c new trailers
e
s 00004/00001/00084
d D 6.3 86/02/18 13:31:16 karels 4 3
c document flags
e
s 00006/00003/00079
d D 6.2 86/02/18 13:27:47 karels 3 2
c update backoff algorithm
e
s 00001/00001/00081
d D 6.1 85/05/15 17:42:29 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00082/00000/00000
d D 5.1 85/05/15 17:42:22 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH EC 4 "27 July 1983"
E 2
I 2
.TH EC 4 "%Q%"
E 2
.UC 5
.SH NAME
ec \- 3Com 10 Mb/s Ethernet interface
.SH SYNOPSIS
D 4
.B "device ec0 at uba0 csr 161000 vector ecrint eccollide ecxint"
E 4
I 4
.B "device ec0 at uba0 csr 161000 vector ecrint eccollide ecxint flags 0"
E 4
.SH DESCRIPTION
The
.I ec
interface provides access to a 10 Mb/s Ethernet network through
a 3com controller.
.PP
The hardware has 32 kilobytes of dual-ported memory on the UNIBUS. 
This memory
is used for internal buffering by the board, and the interface code reads
the buffer contents directly through the UNIBUS.
I 4
The address of this memory is given in the \fIflags\fP field
in the configuration file.
The first interface normally has its memory at Unibus address 0.
E 4
.PP
D 5
The host's Internet address is specified at boot time with an SIOCSIFADDR
E 5
I 5
Each of the host's network addresses
is specified at boot time with an SIOCSIFADDR
E 5
ioctl.  The
.I ec
interface employs the address resolution protocol described in
.IR arp (4P)
to dynamically map between Internet and Ethernet addresses on the local
network.
.PP
I 5
The interface normally tries to use a ``trailer'' encapsulation
to minimize copying data on input and output.
The use of trailers is negotiated with ARP.
This negotiation may be disabled, on a per-interface basis,
by setting the IFF_NOTRAILERS
flag with an SIOCSIFFLAGS ioctl.
.PP
E 5
The interface software implements an exponential backoff algorithm
when notified of a collision on the cable.  This algorithm utilizes
a 16-bit mask and the VAX-11's interval timer in calculating a series
of random backoff values.  The algorithm is as follows:
.TP 5
1.
Initialize the mask to be all 1's.
.TP 5
2.
If the mask is zero, 16 retries have been made and we give
up.
.TP 5
3.
Shift the mask left one bit and formulate a backoff by
D 3
masking the interval timer with the mask (this is actually
the two's complement of the value).
E 3
I 3
masking the interval timer with the smaller of the complement of this mask
and a 5-bit mask, resulting in a pseudo-random number between 0 and 31.
This produces the number of slot times to delay,
where a slot is 51 microseconds.
E 3
.TP 5
4.
Use the value calculated in step 3 to delay before retransmitting
D 3
the packet.  The delay is done in a software busy loop.
E 3
I 3
the packet.
The delay is done in a software busy loop.
E 3
D 5
.PP
The interface normally tries to use a ``trailer'' encapsulation
to minimize copying data on input and output.  This may be
disabled, on a per-interface basis, by setting the IFF_NOTRAILERS
flag with an SIOCSIFFLAGS ioctl.
E 5
.SH DIAGNOSTICS
.BR "ec%d: send error" .
After 16 retransmissions using the
exponential backoff algorithm described above, the packet
was dropped.
.PP
.BR "ec%d: input error (offset=%d)" .
The hardware indicated an error
in reading a packet off the cable or an illegally sized packet.
The buffer offset value is printed for debugging purposes.
.PP
.BR "ec%d: can't handle af%d" .
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.SH SEE ALSO
intro(4N), inet(4F), arp(4P)
.SH BUGS
D 5
The PUP protocol family should be added.
.PP
E 5
The hardware is not capable of talking to itself.  The software
implements local sending and broadcast by sending such packets to the
loop interface.  This is a kludge.
.PP
Backoff delays are done in a software busy loop.  This can degrade the
system if the network experiences frequent collisions.
E 1
