abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.ex.4
h22865
s 00007/00005/00052
d D 6.3 86/05/16 15:52:32 karels 3 2
c update trailers
e
s 00001/00001/00056
d D 6.2 86/02/17 18:01:25 sklower 2 1
c correct config line.
e
s 00057/00000/00000
d D 6.1 86/02/17 17:59:27 sklower 1 0
c date and time created 86/02/17 17:59:27 by sklower
e
u
U
t
T
I 1
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH EX 4 "%Q%"
.UC 5
.SH NAME
ex \- Excelan 10 Mb/s Ethernet interface
.SH SYNOPSIS
D 2
.B "device ex0 at uba0 csr 164000 vector exrint excint"
E 2
I 2
.B "device ex0 at uba0 csr 164000 vector excdint"
E 2
.SH DESCRIPTION
The
.I ex
interface provides access to a 10 Mb/s Ethernet network through
D 3
an Excelan controller.
E 3
I 3
an Excelan controller used as a link-layer interface.
E 3
.PP
D 3
The host's Internet address is specified at boot time with an SIOCSIFADDR
E 3
I 3
Each of the host's network addresses
is specified at boot time with an SIOCSIFADDR
E 3
ioctl.  The
.I ex
interface employs the address resolution protocol described in
.IR arp (4P)
to dynamically map between Internet and Ethernet addresses on the local
network.
.PP
The interface normally tries to use a ``trailer'' encapsulation
D 3
to minimize copying data on input and output.  This may be
disabled, on a per-interface basis, by setting the IFF_NOTRAILERS
E 3
I 3
to minimize copying data on input and output.
The use of trailers is negotiated with ARP.
This negotiation may be disabled, on a per-interface basis,
by setting the IFF_NOTRAILERS
E 3
flag with an SIOCSIFFLAGS ioctl.
.SH DIAGNOSTICS
\fBex%d: HW %c.%c, NX %c.%c, hardware address %s\fP.
This provides firmware revisions levels, and is expected during
autoconfiguration.
.PP
\fBex%d: can't initialize\fP.
There was a failure in allocating unibus resources for the device.
.PP
\fBex%d: configuration failed; cc = %x\fP.
The hardware indicated an error when trying to initalize itself.
The error code returned is described at length in the device
Reference Manual.
.PP
\fBex%d: receive error %b\fP.  The hardware indicated an error
in reading a packet from the cable.
Specific Error bits are provided
.PP
\fBex%d: transmit error %b\fP.  The hardware indicated an error
in transmitting a packet to the cable or an illegally sized packet.
Specific Error bits are provided
.PP
\fBex%d: can't handle af%d\fP.  The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.SH SEE ALSO
intro(4N), inet(4F), arp(4P)
D 3
.SH BUGS
E 3
E 1
