abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.ix.4
h46363
s 00008/00008/00076
d D 6.2 86/05/16 15:52:41 karels 2 1
c update trailers
e
s 00084/00000/00000
d D 6.1 86/02/17 17:28:03 sklower 1 0
c Manual Pages for MICOM interlan NP100 unibus 10MB/s intelligent ethernet controller for downloading (np) and operation(ix)
e
u
U
t
T
I 1
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH IX 4 "%Q%"
.UC 5
.SH NAME
ix \- Interlan Np100 10 Mb/s Ethernet interface
.SH SYNOPSIS
.B "device np0 at uba0 csr 166000 vector npintr"
.SH DESCRIPTION
The
.I ix
interface provides access to a 10 Mb/s Ethernet network through
D 2
an Interlan Np100 controller.
E 2
I 2
an Interlan Np100 controller used as a link-layer interface.
E 2
.PP
This interface is unusual in that it requires loading firmware
into the controller before it may be used as a network interface.
This is accomplished by opening a character special device,
and writing data to it.
A program to load the image is provided in /usr/src/new/np100.
The sequence of commands would be:
.nf

	# ./npload np.image [/dev/np<board #> if other than np00]
	# sleep 10
	# ifconfig ix0 ...
.fi
.PP
D 2
The host's Internet address is specified at boot time with an SIOCSIFADDR
ioctl.
E 2
I 2
Each of the host's network addresses
is specified at boot time with an SIOCSIFADDR
ioctl.  The
E 2
.I ix
interface employs the address resolution protocol described in
.IR arp (4P)
to dynamically map between Internet and Ethernet addresses on the local
network.
.PP
The interface normally tries to use a ``trailer'' encapsulation
D 2
to minimize copying data on input and output.  This may be
disabled, on a per-interface basis, by setting the IFF_NOTRAILERS
E 2
I 2
to minimize copying data on input and output.
The use of trailers is negotiated with ARP.
This negotiation may be disabled, on a per-interface basis,
by setting the IFF_NOTRAILERS
E 2
flag with an SIOCSIFFLAGS ioctl.
.SH DIAGNOSTICS
\fBix%d: Req failed, cmd %x, stat %x, ust error %x,%x\fP.
The firmware in the controller refused to honor a request from
.UX
in initializing packet level communications.
The board may need to be reset and reloaded.
Or, you may not have allowed enough time between loading the board
and issuing the request to begin unix network operation.
.PP
\fBix%d: can't initialize\fP.
The interface was unable to obtain unibus resources required for operation.
.PP
\fBix%d: failed to reinitialize DLA module\fP.
The interface got sick after attempting to reprogram its physical
ethernet address.  Try reloading the firmware.
The attempt is made only when this interfaces is not the first
one configured for XNS.
.PP
\fBix%d: can't handle af%d\fP.  The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.PP
\fBix%d: stray xmit interrupt, npreq=%x\fP.
This may happen if the board is reloaded while network processes are still
running.
.PP
\fBixrint: cqe error %x, %x, %x\fP.
This will result if an 
.IR ifconfig (8c)
request is made at an inopportune time, such as not allowing
enough time after loading the firmware.
After 100 such errors are logged, the unix network driver will
shut itself down, saying:
.PP
\fBixrint: shutting down unix dla\fP.
The recourse is to reload the firmware and allow more time.
.SH SEE ALSO
intro(4N), inet(4F), arp(4P), np(4).
D 2
.SH BUGS
There should be a direct path to an intelligent controller
via a protocol family using the socket mechanism.
E 2
E 1
