abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.kg.4
h19214
s 00001/00001/00025
d D 6.1 85/05/15 17:45:07 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00026/00000/00000
d D 5.1 85/05/15 17:45:02 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH KG 4 "27 July 1983"
E 2
I 2
.TH KG 4 "%Q%"
E 2
.UC 5
.SH NAME
kg \- KL-11/DL-11W line clock
.SH SYNOPSIS
.B "device kg0 at uba0 csr 0176500 vector kglock"
.SH DESCRIPTION
A kl-11 or dl-11w can be used as an alternate real
time clock
source.  When configured, certain system
statistics and, optionally, system profiling work
will be collected each time the clock interrupts.  For
optimum accuracy in profiling, the dl-11w should be
configured to interrupt at the highest possible priority
level.  The 
.I kg
device driver automatically calibrates itself to the
line clock frequency.
.SH "SEE ALSO"
kgmon(8), config(8)
E 1
