abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.ps.4
h05745
s 00003/00003/00123
d D 6.3 86/05/21 15:56:29 anne 4 3
c spelling
e
s 00001/00001/00125
d D 6.2 85/11/13 21:10:36 sam 3 2
c update to reflect change in interrupt handling
e
s 00001/00001/00125
d D 6.1 85/05/15 17:46:05 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00126/00000/00000
d D 5.1 85/05/15 17:45:58 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH PS 4 "27 July 1983"
E 2
I 2
.TH PS 4 "%Q%"
E 2
.UC 5
.SH NAME
ps \- Evans and Sutherland Picture System 2 graphics device interface
.SH SYNOPSIS
D 3
.B "device ps0 at uba? csr 0172460 vector psintr"
E 3
I 3
.B "device ps0 at uba? csr 0172460 vector psclockintr pssystemintr"
E 3
.SH DESCRIPTION
The
.I ps
driver provides access
to an Evans and
Sutherland Picture System 2 graphics device.
Each minor device is a new PS2.
When the device is opened, its interface registers are mapped,
via virtual memory, into a user process's address space.
This allows the user process very high bandwidth to the device
with no system call overhead.
.PP
DMA to and from the PS2 is not supported. All read and write
system calls will fail.
All data is moved to and from the PS2 via programmed I/O using
the device's interface registers.
.PP
Commands are fed to and from the driver using the following ioctls:
.TP
PSIOGETADDR
.br
Returns the virtual address through which the user process can access
the device's interface registers.
.TP
PSIOAUTOREFRESH
.br
Start auto refreshing the screen.
The argument is an address in user space where the following data resides.
The first longword is a
.I count
of the number of static refresh buffers.
The next
.I count
longwords are the addresses in refresh memory where
the refresh buffers lie.
D 4
The driver will cycle thru these refresh buffers displaying them one by one
E 4
I 4
The driver will cycle through these refresh buffers displaying them one by one
E 4
on the screen.
.TP
PSIOAUTOMAP
.br
D 4
Start automatically passing the display file thru the matrix processor and
E 4
I 4
Start automatically passing the display file through the matrix processor and
E 4
into the refresh buffer.
The argument is an address in user memory where the following data resides.
The first longword is a
.I count
of the number of display files to operate on.
The next
.I count
longwords are the address of these display files.
The final longword is the address in refresh buffer memory where transformed
coordinates are to be placed if the driver is not in double buffer mode (see
below).
.TP
PSIODOUBLEBUFFER
.br
Cause the driver to double buffer the output from the map that
is going to the refresh buffer.
The argument is again a user space address where the real arguments are stored.
The first argument is the starting address of refresh memory where the two
double buffers are located.
The second argument is the length of each double buffer.
The refresh mechanism displays the current double buffer, in addition
to its static refresh lists, when in double buffer mode.
.TP
PSIOSINGLEREFRESH
.br
Single step the refresh process. That is, the driver does not continually
refresh the screen.
.TP
PSIOSINGLEMAP
.br
Single step the matrix process.
D 4
The driver does not automatically feed display files thru the matrix unit.
E 4
I 4
The driver does not automatically feed display files through the matrix unit.
E 4
.TP
PSIOSINGLEBUFFER
.br
Turn off double buffering.
.TP
PSIOTIMEREFRESH
.br
The argument is a count of the number of refresh interrupts to take
before turning off the screen.  This is used to do time exposures.
.TP
PSIOWAITREFRESH
.br
Suspend the user process until a refresh interrupt has occurred.
If in TIMEREFRESH mode, suspend until count refreshes have occurred.
.TP
PSIOSTOPREFRESH
.br
Wait for the next refresh, stop all refreshes, and then return to user process.
.TP
PSIOWAITMAP
.br
Wait until a map done interrupt has occurred.
.TP
PSIOSTOPMAP
.br
Wait for a map done interrupt, do not restart the map, and then
return to the user.
.SH FILES
/dev/ps
.SH DIAGNOSTICS
.BR "ps device intr" .
.br
.BR "ps dma intr" .
An interrupt was received from the device. 
This shouldn't happen,
check your device configuration for overlapping interrupt vectors.
.SH BUGS
An invalid access (e.g., longword) to a mapped interface register
can cause the system to crash with a machine check.
A user process could possibly cause infinite interrupts hence
bringing things to a crawl.
E 1
