abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.qe.4
h32561
s 00036/00000/00000
d D 6.1 86/06/03 16:31:22 mckusick 1 0
c first released with 4.3BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH QE 4 "%Q%"
.UC 6
.SH NAME
qe \- DEC DEQNA Q-bus 10 Mb/s Ethernet interface
.SH SYNOPSIS
.B "device qe0 at uba? csr 174440 vector qeintr"
.SH DESCRIPTION
The
.B qe
interface provides access to a 10 Mb/s Ethernet network through
the DEC DEQNA Q-bus controller.
.PP
Each of the host's network addresses
is specified at boot time with an SIOCSIFADDR
ioctl.  The
.B qe
interface employs the address resolution protocol described in
arp(4P)
to map dynamically  between Internet and Ethernet addresses on the local
network.
.PP
The interface normally tries to use a ``trailer'' encapsulation
to minimize copying data on input and output.
The use of trailers is negotiated with ARP.
This negotiation may be disabled, on a per-interface basis,
by setting the IFF_NOTRAILERS
flag with an SIOCSIFFLAGS ioctl.
.SH DIAGNOSTICS
.SH SEE ALSO
inet(4F), intro(4N), arp(4P)
E 1
