abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.tb.4
h51530
s 00004/00004/00062
d D 6.3 86/06/01 00:44:11 mis 3 2
c spelling errors fixed.
e
s 00001/00001/00065
d D 6.2 86/04/19 23:26:20 sam 2 1
c leftover network-ism
e
s 00066/00000/00000
d D 6.1 86/04/15 16:44:53 mckusick 1 0
c 4.3BSD manual page from sam
e
u
U
t
T
I 1
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH TB 4 "%Q%"
.UC 6
.SH NAME
tb \- line discipline for digitizing devices
.SH SYNOPSIS
.B pseudo-device tb
.SH DESCRIPTION
This line discipline provides a polled interface to many common
digitizing devices which are connected to a host through a serial line.
When these devices stream data at high speed, the use of the
D 3
line discpline is critical in minimizing the number of samples
E 3
I 3
line discipline is critical in minimizing the number of samples
E 3
that would otherwise be lost due to buffer exhaustion in the
.IR tty (4)
handler.
.PP
The line discipline is enabled by a sequence:
.PP
.nf
.ft B
	#include <sys/tablet.h>
	int ldisc = TBLDISC, fildes; ...
	ioctl(fildes, TIOCSETD, &ldisc);
.fi
.ft R
.PP
A typical application program then polls the digitizing device by
reading a binary data structure which contains: the current X and
Y positions (in the device coordinate space),
up-down status of the buttons or pen stylus,
proximity information (when available), and a count
of the number of samples received from the input device
since it was opened.  In addition, devices such as the
GTCO append tilt and pressure information to the end of
D 3
the aforementioned structure.  For the Polehmus 3-D digitizer
the structure read is completely different, refer to the
E 3
I 3
the aforementioned structure.  For the Polhemus 3-D digitizer
the structure read is completely different. Refer to the
E 3
include file for a complete description.
.PP
While in tablet mode, normal teletype input and output functions take place.
Thus, if an 8 bit output data path is desired, it is necessary
to prepare the output line by putting it into RAW mode using
.IR ioctl (2).
This must be done
.B before
changing the discipline with TIOCSETD, as most
.IR ioctl (2)
D 2
calls are disabled while in network line-discipline mode.
E 2
I 2
calls are disabled while in tablet line-discipline mode.
E 2
.PP
The line discipline supports
.IR ioctl (2)
requests to get/set the operating mode, and to get/set the tablet type
and operating mode by \fIor\fP-ing the two values together.
.PP
D 3
The line discpline supports digitizing devices which are
E 3
I 3
The line discipline supports digitizing devices which are
E 3
compatible with Hitachi, GTCO, or Polhemus protocol formats.
For Hitachi there are several formats with that used in the
newer model HDG-1111B the most common.
.SH "SEE ALSO"
tty(4)
.SH DIAGNOSTICS
None.
E 1
