abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.tmscp.4
h11386
s 00075/00000/00000
d D 6.1 86/06/04 15:27:04 mckusick 1 0
c first distributed with 4.3BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH TMSCP 4 "%Q%"
.UC 6
.SH NAME
tmscp \- DEC TMSCP magtape interface
.SH SYNOPSIS
.B "controller tmscp0 at uba? csr 0174500 vector tmscpintr"
.br
.B "tape tms0 at tmscp0 drive 0"
.SH DESCRIPTION
Tape controllers compatible with the DEC
Tape Mass Storage Control Protocol (TMSCP) architecture
such as the TU81 and the TK50
provide a standard tape drive interface 
as described in
.IR mtio (4).
The controller communicates with the host through a packet
oriented protocol.
Consult the file
.IR < vax/tmscp.h >
for a detailed 
description of this protocol.
.SH DIAGNOSTICS
.BR "tmscp controller failed to init" .
The controller initialization procedure failed.
This probably indicates a hardware problem.
.PP
.BR "tmscp%d: sa 0%o, state %d" .
(Additional status information given after a hard I/O error.)
The values of the controller status register and the internal
driver state are printed.
.PP
.BR "tmscp%d: random interrupt ignored" .
An unexpected interrupt was received (e.g. when no i/o was
pending).  The interrupt is ignored.
.PP
.BR "tmscp%d:  interrupt in unknown state %d ignored" .
An interrupt was received when the driver was in an unknown
internal state.  Indicates a hardware problem or a driver bug.
.PP
.BR "tmscp%d:  fatal error (0%o)" .
The controller detected a ``fatal error'' in the status returned
to the host.  The contents of the status register are displayed.
.PP
.BR OFFLINE .
(Additional status information given after a hard I/O error.)
A hard I/O error occurred because the drive was not on-line.
.PP
The following errors are interpretations of TMSCP error messages
returned by the controller to the host.
Each is preceded by either
.B "tmscp%d: hard error"
or
.BR "tmscp%d: soft error" .
.PP
.BR "controller error, event 0%o" .
.PP
.BR "host memory access error, event 0%o, addr 0%o" .
.PP
.BR "tape transfer error, unit %d, grp 0x%x, event 0%o" .
.PP
.BR "STI error, unit %d, event 0%o" .
.PP
.BR "STI Drive Error Log, unit %d, event 0%o" .
.PP
.BR "STI Formatter Error Log, unit %d, event 0%o" .
.PP
.BR "unknown error, unit %d, format 0%o, event 0%o" .
.SH "SEE ALSO"
mt(1), tar(1), tp(1), mtio(4), tm(4), ts(4), ut(4), dmesg(8)
E 1
