abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.tm.4
h60935
s 00001/00001/00058
d D 6.2 87/08/01 17:23:36 bostic 4 3
c a *really* trivial fix... the error is "change", not "switch"
e
s 00001/00001/00058
d D 6.1 85/05/15 17:23:50 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00012/00008/00047
d D 5.1 85/05/15 17:23:42 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00055/00000/00000
d D 4.1 85/05/15 17:23:36 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH TM 4 5/10/81
E 2
I 2
D 3
.TH TM 4 "27 July 1983"
E 3
I 3
.TH TM 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
tm \- TM-11/TE-10 magtape interface
.SH SYNOPSIS
D 2
controller tm0 at uba? csr 0172520 vector tmintr
E 2
I 2
.B "controller tm0 at uba? csr 0172520 vector tmintr"
E 2
.br
D 2
tape te0 at tm0 drive 0
E 2
I 2
.B "tape te0 at tm0 drive 0"
E 2
.SH DESCRIPTION
The tm-11/te-10 combination provides a standard tape drive
interface as described in
D 2
.IR mt (4).
E 2
I 2
.IR mtio (4).
E 2
Hardware implementing this on the VAX is typified by the Emulex TC-11
controller operating with a Kennedy model 9300 tape transport,
providing 800 and 1600 bpi operation at 125 ips.
.SH "SEE ALSO"
D 2
mt(1), tar(1), tp(1), ht(4), mt(4), ts(4)
E 2
I 2
mt(1),
tar(1),
tp(1),
mtio(4),
ht(4),
ts(4),
mt(4),
ut(4)
E 2
.SH DIAGNOSTICS
\fBte%d: no write ring\fR.  An attempt was made to write on the tape drive
when no write ring was present; this message is written on the terminal of
the user who tried to access the tape.
.PP
\fBte%d: not online\fR.  An attempt was made to access the tape while it
was offline; this message is written on the terminal of the user
who tried to access the tape.
.PP
D 4
\fBte%d: can't switch density in mid-tape\fR.  An attempt was made to write
E 4
I 4
\fBte%d: can't change density in mid-tape\fR.  An attempt was made to write
E 4
on a tape at a different density than is already recorded on the tape.
This message is written on the terminal of the user who tried to switch
the density.
.PP
\fBte%d: hard error bn%d er=%b\fR.   A tape error occurred
at block \fIbn\fR; the tm error register is
printed in octal with the bits symbolically decoded.  Any error is
fatal on non-raw tape; when possible the driver will have retried
the operation which failed several times before reporting the error.
.PP
\fBte%d: lost interrupt\fR.  A tape operation did not complete
within a reasonable time, most likely because the tape was taken
off-line during rewind or lost vacuum.  The controller should, but does not,
give an interrupt in these cases.  The device will be made available
again after this message, but any current open reference to the device
will return an error as the operation in progress aborts.
.SH BUGS
If any non-data error is encountered on non-raw tape, it refuses to do anything
more until closed.
D 2
.PP
The system should remember which controlling terminal has the tape drive
open and write error messages to that terminal rather than on the console.
E 2
E 1
