abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.ts.4
h63282
s 00001/00001/00050
d D 6.1 85/05/15 17:24:15 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00013/00009/00038
d D 5.1 85/05/15 17:24:06 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00047/00000/00000
d D 4.1 85/05/15 17:23:56 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH TS 4 5/10/81
E 2
I 2
D 3
.TH TS 4 "27 July 1983"
E 3
I 3
.TH TS 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
ts \- TS-11 magtape interface
.SH SYNOPSIS
D 2
controller zs0 at uba? csr 0172520 vector tsintr
E 2
I 2
.B "controller zs0 at uba? csr 0172520 vector tsintr"
E 2
.br
D 2
tape ts0 at zs0 drive 0
E 2
I 2
.B "tape ts0 at zs0 drive 0"
E 2
.SH DESCRIPTION
The ts-11 combination provides a standard tape drive
interface as described in
D 2
.IR mt (4).
E 2
I 2
.IR mtio (4).
E 2
The ts-11 operates only at 1600 bpi, and only one transport
is possible per controller.
.SH "SEE ALSO"
D 2
mt(1), tar(1), tp(1), ht(4), mt(4), tm(4), ut(4)
E 2
I 2
mt(1),
tar(1),
tp(1),
mtio(4),
ht(4),
tm(4),
mt(4),
ut(4)
E 2
.SH DIAGNOSTICS
\fBts%d: no write ring\fR.  An attempt was made to write on the tape drive
when no write ring was present; this message is written on the terminal of
the user who tried to access the tape.
.PP
\fBts%d: not online\fR.  An attempt was made to access the tape while it
was offline; this message is written on the terminal of the user
who tried to access the tape.
.PP
\fBts%d: hard error bn%d xs0=%b\fR.  A hard error occurred on the tape
at block \fIbn\fR; status register 0 is printed in octal and symbolically
decoded as bits.
.SH BUGS
If any non-data error is encountered on non-raw tape, it refuses to do anything
more until closed.
.PP
The device lives at the same address as a tm-11
.IR tm (4);
as it is very difficult to get this device to interrupt, a generic
system assumes that a ts is present whenever no tm-11 exists but
the csr responds and a ts-11 is configured.
D 2
This does no harm as long as a non-existant ts-11 is not accessed.
.PP
The system should remember which controlling terminal has the tape drive
open and write error messages to that terminal rather than on the console.
E 2
I 2
This does no harm as long as a non-existent ts-11 is not accessed.
E 2
E 1
