abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/S.un.4
h60929
s 00001/00001/00077
d D 6.1 85/05/15 17:51:29 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00078/00000/00000
d D 5.1 85/05/15 17:51:23 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH UN 4 "27 July 1983"
E 2
I 2
.TH UN 4 "%Q%"
E 2
.UC 5
.SH NAME
un \- Ungermann-Bass interface
.SH SYNOPSIS
.B "device un0 at uba0 csr 0160210 vector unintr"
.SH DESCRIPTION
The
.I un
interface provides access to a 4 Mb/s baseband
network.  The hardware uses a standard DEC DR11-W
DMA interface in communicating with the host.  The
Ungermann-Bass hardware incorporates substantial protocol
software in the network device in an attempt to offload
protocol processing from the host.
.PP
The network number on which the interface resides must
be specified at boot time with an SIOCSIFADDR ioctl.
The host's address is discovered by communicating with
the interface.  The interface will not transmit or receive
any packets before the network number has been defined.
.SH DIAGNOSTICS
.BR "un%d: can't initialize" .
Insufficient UNIBUS resources existed for the device to
complete initialization.  Usually caused by having multiple
network interfaces configured using buffered data paths on
a data path poor machine such as the 11/750.
.PP
.BR "un%d: unexpected reset" .
The controller indicated a reset when none had been requested.
Check the hardware (but see the bugs section below).
.PP
.BR "un%d: stray interrupt" .
An unexpected interrupt was received.  The interrupt was
ignored.
.PP
.BR "un%d: input error csr=%b" .
The controller indicated an error on moving data from the
device to host memory.
.PP
.BR "un%d: bad packet type %d" .
A packet was received with an unknown packet type.  The
packet is discarded.
.PP
.BR "un%d: output error csr=%b" .
The device indicated an error on moving data from the host
to device memory.
.PP
.BR "un%d: invalid state %d csr=%b" .
The driver found itself in an invalid internal state.   The
state is reset to a base state.
.PP
.BR "un%d: can't handle af%d" .
A request was made to send a message with an address format
which the driver does not understand.  The message is discarded
and an error is returned to the user.
.PP
.BR "un%d: error limit exceeded" .
Too many errors were encountered in normal operation.  The
driver will attempt to reset the device, desist from attempting
any i/o for approximately 60 seconds, then reset itself to
a base state in hopes of resyncing itself up with the hardware.
.PP
.BR "un%d: restarting" .
After exceeding its error limit and resetting
the device, the driver is restarting operation.
.SH SEE ALSO
intro(4N), inet(4F)
.SH BUGS
The device does not reset itself properly resulting in the
interface getting hung up in a state from which the only
recourse is to reboot the system.
E 1
