abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.va.4
h53813
s 00004/00026/00107
d D 6.2 86/05/14 18:36:58 bloom 4 3
c delete outdated cruft
e
s 00001/00001/00132
d D 6.1 85/05/15 17:25:38 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00035/00039/00098
d D 5.1 85/05/15 17:25:27 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00137/00000/00000
d D 4.1 85/05/15 17:25:20 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH VA 4 4/1/81
E 2
I 2
D 3
.TH VA 4 "27 March 1983"
E 3
I 3
.TH VA 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
va \- Benson-Varian interface
.SH SYNOPSIS
D 2
device va0 at uba? csr 0164000 vector vaintr
E 2
I 2
.B "controller va0 at uba0 csr 0164000 vector vaintr"
.br
.B "disk vz0 at va0 drive 0"
E 2
.SH DESCRIPTION
I 2
(\fBNOTE: the configuration description, while counter-intuitive,
is actually as shown above\fP.)
.PP
E 2
D 4
The Benson-Varian printer/plotter in normally used with the programs
.IR vpr (1),
.IR vprint (1)
or
.IR vtroff (1).
E 4
I 4
The Benson-Varian printer/plotter in normally used with the line printer
system.
E 4
This description is designed for those who wish to drive the Benson-Varian
directly.
.PP
D 2
The Benson-Varian at Berkeley uses 11\*(rq by 8\*(rq fan-fold paper.
It will print 132 characters per line in print mode
and 2112 dots per line in plot mode.
.PP
E 2
In print mode, the Benson-Varian uses a modified ASCII character set.
Most control characters print various non-ASCII graphics such as daggers,
sigmas, copyright symbols, etc.
Only LF and FF are used as format effectors.  LF acts as a newline,
advancing to the beginning of the next line, and FF advances to the top of
the next page.
.PP
In plot mode, the Benson-Varian prints one raster line at a time.
An entire raster line of bits (2112 bits = 264 bytes) is sent, and
then the Benson-Varian advances to the next raster line.
.PP
.B Note:
The Benson-Varian must be sent an even number of bytes.
If an odd number is sent, the last byte will be lost.
Nulls can be used in print mode to pad to an even number of bytes.
.PP
D 2
To use the Benson-Varian yourself, you must realize that you cannot open the
device,
E 2
I 2
To use the Benson-Varian yourself,
you must realize that you cannot open the device,
E 2
.I /dev/va0
if there is a daemon active.
D 2
You can see if there is a daemon active by doing a
.IR ps (1),
or by looking in the directory
.I /usr/spool/vad.
If there is a file
.I lock
there, then there is probably a daemon
.IR /usr/lib/vad
running.
If not, you should remove the
.I lock.
E 2
I 2
You can see if there is an active daemon by doing a
.IR lpq (1)
and seeing if there are any files being printed.
I 4
Printing should be turned off using
.IR lpc (8).
E 4
E 2
.PP
D 2
In any case, when your program tries to open the device
.I /dev/va0
you may get one of two errors.
The first of these
ENXIO
indicates that the Benson-Varian is already in use.
Your program can then
.IR sleep (2)
and try again in a while, or give up.
The second is
EIO
and indicates that the Benson-Varian is offline.
.PP
To set the Benson-Varian into plot mode, ``#include <vcmd.h>''
E 2
I 2
To set the Benson-Varian into plot mode include the file
.RI < sys/vcmd.h >
E 2
and use the following
.IR ioctl (2)
call
.IP
ioctl(fileno(va), VSETSTATE, plotmd);
.PP
where
D 2
.B plotmd
E 2
I 2
.I plotmd
E 2
is defined to be
.IP
\fBint\fR plotmd[] = { VPLOT, 0, 0 };
.PP
and
.I va
is the result of a call to
.I fopen
on stdio.
When you finish using the Benson-Varian in plot mode you should advance to
a new page
by sending it a FF after putting it back into print mode, i.e. by
.PP
'nf
	\fBint\fR prtmd[] = { VPRINT, 0, 0 };
	\&...
	fflush(va);
	ioctl(fileno(va), VSETSTATE, prtmd);
	write(fileno(va), "\ef\e0", 2);
.fi
D 4
.PP
D 2
.IR N.B. :
E 2
I 2
.BR N.B. :
E 2
If you use the standard I/O library with the Benson-Varian you
.B must
do
.IP
setbuf(vp, vpbuf);
.PP
where
.I vpbuf
is declared
.IP
\fBchar\fR vpbuf[BUFSIZ];
.PP
otherwise the standard I/O library, thinking that the Benson-Varian
is a terminal (since it is a character special file) will not adequately buffer
the data you are sending to the Benson-Varian.
This will cause it to run
.B extremely
slowly and tend to grind the system to a halt.
E 4
.SH FILES
/dev/va0
D 2
.br
/usr/include/sys/vcmd.h
E 2
.SH SEE ALSO
D 2
vfont(5), vpr(1), vtroff(1), vp(4)
E 2
I 2
vfont(5),
lpr(1),
lpd(8),
D 4
vtroff(1),
E 4
vp(4)
E 2
.SH DIAGNOSTICS
I 2
The following error numbers are significant at the
time the device is opened.
.TP 10
[ENXIO]
The device is already in use.
.TP
[EIO]
The device is offline.
.PP
The following message may be printed on the console.
.PP
E 2
\fBva%d: npr timeout\fR.  The device was not able to get data from
the UNIBUS within the timeout period, most likely because some other
device was hogging the bus.  (But see BUGS below).
.SH BUGS
The 1's (one's) and l's (lower-case el's) in the Benson-Varian's
standard character set look very similar; caution is advised.
.PP
The interface hardware is rumored to have problems which can
play havoc with the UNIBUS.  We have intermittent minor problems on the
D 2
UNIBUS where our va lives, but haven't ever been able to pin them down
E 2
I 2
UNIBUS where our
.I va
lives, but haven't ever been able to pin them down
E 2
completely.
E 1
