abs0/4.3BSD-Quasijarus/man/man4/vax/SCCS/s.vv.4
h34827
s 00005/00005/00065
d D 6.2 86/05/16 15:54:56 karels 3 2
c new trailers
e
s 00016/00024/00054
d D 6.1 85/05/15 17:52:14 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00078/00000/00000
d D 5.1 85/05/15 17:52:07 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH VV 4 "27 July 1983"
E 2
I 2
.TH VV 4 "%Q%"
E 2
.UC 5
.SH NAME
vv \- Proteon proNET 10 Megabit ring
.SH SYNOPSIS
D 2
.B "device vv0 at uba0 csr 161000 vector vvrint vvxint"
E 2
I 2
.B "device vv0 at uba0 csr 0161000 vector vvrint vvxint"
E 2
.SH DESCRIPTION
The
.I vv
interface provides access to a 10 Mb/s Proteon proNET ring network.
.PP
D 2
The network number to which the interface is attached must
be specified with an SIOCSIFADDR ioctl before data can be
transmitted or received.
The host's address is discovered by putting the interface in
digital loopback mode (not joining the ring)
and sending a broadcast packet from which the source
address is extracted.
the Internet address of the interface would be 128.3.0.24.
E 2
I 2
The network address of the interface must be specified with an
an SIOCSIFADDR ioctl before data can be transmitted or received.
It is only permissible to change the network address while the
interface is marked "down".
E 2
.PP
D 2
The interface software implements error-rate limiting on
the input side.
This provides a defense against situations where other hosts
or interface hardware failures cause a machine to be
inundated with garbage packets.
The scheme involves an exponential backoff where the input
side of the interface is disabled for longer and longer periods.
In the limiting case,
the interface is turned on every two minutes or so to see
if operation can resume.
E 2
I 2
The host's hardware address is discovered by putting the interface in
digital loopback mode (not joining the ring) and sending a broadcast
packet from which the hardware address is extracted.
E 2
.PP
I 2
Transmit timeouts are detected through use of a watchdog routine.
Lost input interrupts are checked for when packets are sent out.
.PP
E 2
If the installation is running CTL boards which use the old broadcast
address of 0 instead of the new address of 0xff, the define OLD_BROADCAST
should be specified in the driver.
.PP
D 3
If the installation has a Wirecenter, the define WIRECENTER should
be specified in the driver.
.BR N.B. :
Incorrect definition of WIRECENTER can cause hardware damage.
.PP
E 3
D 2
The interface normally tries to use a ``trailer'' encapsulation
to minimize copying data on input and output.  This may be
disabled, on a per-interface basis, by setting the IFF_NOTRAILERS
flag with an SIOCSIFFLAGS ioctl.
E 2
I 2
The driver can use ``trailer'' encapsulation to minimize copying
data on input and output.
This may be disabled, on a per-interface basis,
by setting the IFF_NOTRAILERS flag with an SIOCSIFFLAGS ioctl.
E 2
.SH DIAGNOSTICS
.PP
\fBvv%d: host %d\fP.  The software announces the host
address discovered during autoconfiguration.
.PP
\fBvv%d: can't initialize\fP. The software was unable to
discover the address of this interface, so it deemed
"dead" will not be enabled.
.PP
\fBvv%d: error vvocsr=%b\fP.  The hardware indicated an error on
the previous transmission.
.PP
\fBvv%d: output timeout\fP.  The token timer has fired and the
token will be recreated.
.PP
\fBvv%d: error vvicsr=%b\fP.  The hardware indicated an error
in reading a packet off the ring.
.PP
\fBen%d: can't handle af%d\fP.  The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.PP
\fBvv%d: vs_olen=%d\fP.  The ring output routine has been
handed a message with a preposterous length.  This results in
an immediate 
.IR "panic: vs_olen" .
.SH SEE ALSO
intro(4N), inet(4F)
I 3
.SH BUGS
The encapsulation of trailer packets in the 4.2BSD version of this driver
was incorrect (the packet type was in VAX byte order).
As a result, the trailer encapsulation in this version is not compatible
with the 4.2BSD VAX version.
E 3
E 1
