abs0/4.3BSD-Quasijarus/man/man4/SCCS/s.arp.4p
h11740
s 00042/00019/00076
d D 6.2 86/05/15 17:55:38 karels 3 2
c trailer negotiation and formatting
e
s 00069/00011/00026
d D 6.1 85/05/15 17:39:08 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00037/00000/00000
d D 5.1 85/05/15 17:37:18 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH ARP 4P "18 July 1983"
E 2
I 2
.TH ARP 4P "%Q%"
E 2
.UC 5
.SH NAME
arp \- Address Resolution Protocol
.SH SYNOPSIS
D 2
.B pseudo-device ether
E 2
I 2
.B "pseudo-device ether"
E 2
.SH DESCRIPTION
ARP is a protocol used to dynamically map between DARPA Internet
D 2
and 10Mb/s Ethernet addresses on a local area network.  It is
used by all the 10Mb/s Ethernet interface drivers and is not
directly accessible to users.
E 2
I 2
and 10Mb/s Ethernet addresses.  It is
used by all the 10Mb/s Ethernet interface drivers.
I 3
It is not specific to Internet protocols or to 10Mb/s Ethernet,
but this implementation currently supports only that combination.
E 3
E 2
.PP
ARP caches Internet-Ethernet address mappings.  When an interface
requests a mapping for an address not in the cache, ARP queues the
message which requires the mapping and broadcasts
a message on the associated network requesting the address mapping.
If a response is provided, the new mapping is cached and any pending
D 2
messages are transmitted.  ARP itself is not Internet or Ethernet
specific; this implementation, however, is.  ARP will queue
E 2
I 2
D 3
messages are transmitted.
E 3
I 3
message is transmitted.
E 3
ARP will queue
E 2
at most one packet while waiting for a mapping request to be responded to;
only the most recently ``transmitted'' packet is kept.
.PP
I 2
D 3
To enable communications with systems which do not use ARP, ioctls
E 3
I 3
To facilitate communications with systems which do not use ARP,
.IR ioctl \^s
E 3
are provided to enter and delete entries in the Internet-to-Ethernet tables.
Usage:
.LP
.nf
.ft B
	#include <sys/ioctl.h>
	#include <sys/socket.h>
	#include <net/if.h>
	struct arpreq arpreq;

	ioctl(s, SIOCSARP, (caddr_t)&arpreq);
	ioctl(s, SIOCGARP, (caddr_t)&arpreq);
	ioctl(s, SIOCDARP, (caddr_t)&arpreq);
.fi
.ft R
Each ioctl takes the same structure as an argument.
SIOCSARP sets an ARP entry, SIOCGARP gets an ARP entry, and SIOCDARP
deletes an ARP entry.  These ioctls may be applied to any socket descriptor
.I s,
but only by the super-user.
The
.I arpreq
structure contains:
.LP
I 3
.RS
.ta \w'#define\ \ 'u +\w'ATF_USETRAILERS\ \ 'u +\w'0x08\ \ \ \  'u
E 3
.nf
D 3
	/*
	 * ARP ioctl request
	 */
	struct arpreq {
		struct sockaddr	arp_pa;		/* protocol address */
		struct sockaddr	arp_ha;		/* hardware address */
		int	arp_flags;		/* flags */
	};
	/*  arp_flags field values */
	#define ATF_COM		2	/* completed entry (arp_ha valid) */
	#define	ATF_PERM	4	/* permanent entry */
	#define	ATF_PUBL	8	/* publish (respond for other host) */
E 3
I 3
/*
 * ARP ioctl request
 */
struct arpreq {
	struct sockaddr	arp_pa;		/* protocol address */
	struct sockaddr	arp_ha;		/* hardware address */
	int	arp_flags;		/* flags */
};
/*  arp_flags field values */
#define ATF_COM		0x02	/* completed entry (arp_ha valid) */
#define	ATF_PERM	0x04	/* permanent entry */
#define	ATF_PUBL	0x08	/* publish (respond for other host) */
#define	ATF_USETRAILERS	0x10	/* send trailer packets to host */
E 3
.fi
I 3
.RE
E 3
.LP
The address family for the
.I arp_pa
sockaddr must be AF_INET; for the 
.I arp_ha
sockaddr it must be AF_UNSPEC.
D 3
The only flag bits which may be written are ATF_PERM and ATF_PUBL.
E 3
I 3
The only flag bits which may be written are ATF_PERM, ATF_PUBL
and ATF_USETRAILERS.
E 3
ATF_PERM causes the entry to be permanent if the ioctl call succeeds.
The peculiar nature of the ARP tables may cause the ioctl to fail if more
D 3
than 4 (permanent) Internet host addresses hash to the same slot.
E 3
I 3
than 8 (permanent) Internet host addresses hash to the same slot.
E 3
ATF_PUBL specifies that the ARP code should respond to ARP requests for the
indicated host coming from other machines.  This allows a host to act as an
D 3
"ARP server" which may be useful in convincing an ARP-only machine to talk
E 3
I 3
``ARP server,'' which may be useful in convincing an ARP-only machine to talk
E 3
to a non-ARP machine.
.PP
I 3
ARP is also used to negotiate the use of trailer IP encapsulations;
trailers are an alternate encapsulation used to allow efficient packet
alignment for large packets despite variable-sized headers.
Hosts which wish to receive trailer encapsulations so indicate
by sending gratuitous ARP translation replies along with replies
to IP requests; they are also sent in reply to IP translation replies.
The negotiation is thus fully symmetrical, in that either or both hosts
may request trailers.
The ATF_USETRAILERS flag is used to record the receipt of such a reply,
and enables the transmission of trailer packets to that host.
.PP
E 3
E 2
ARP watches passively for hosts impersonating the local host (i.e. a host
D 2
which responds to an ARP mapping request for the local host's address)
and will, optionally, periodically probe a network looking for impostors.
E 2
I 2
which responds to an ARP mapping request for the local host's address).
E 2
.SH DIAGNOSTICS
D 2
.B "duplicate IP address!! sent from ethernet address: %x %x %x %x %x %x".
E 2
I 2
.B "duplicate IP address!! sent from ethernet address: %x:%x:%x:%x:%x:%x."
E 2
ARP has discovered another host on the local network which responds to
mapping requests for its own Internet address.
.SH SEE ALSO
D 2
ec(4), il(4)
E 2
I 2
ec(4), de(4), il(4), inet(4F), arp(8C), ifconfig(8C)
.br
D 3
An Ethernet Address Resolution Protocol, RFC826, Dave Plummer, MIT.
E 3
I 3
``An Ethernet Address Resolution Protocol,'' RFC826, Dave Plummer,
Network Information Center, SRI.
.br
``Trailer Encapsulations,'' RFC893, S.J. Leffler and M.J. Karels,
Network Information Center, SRI.
E 3
.SH BUGS
D 3
ARP packets on the Ethernet use only 42 bytes of data, however, the smallest
E 3
I 3
ARP packets on the Ethernet use only 42 bytes of data; however, the smallest
E 3
legal Ethernet packet is 60 bytes (not including CRC).
Some systems may not enforce the minimum packet size, others will.
E 2
E 1
