abs0/4.3BSD-Quasijarus/man/man4/SCCS/s.drum.4
h27016
s 00001/00001/00023
d D 6.1 85/05/15 17:19:29 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00023
d D 5.1 85/05/15 17:19:22 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00024/00000/00000
d D 4.1 85/05/15 17:19:15 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH DRUM 4 5/11/81
E 2
I 2
D 3
.TH DRUM 4 "10 May 1981"
E 3
I 3
.TH DRUM 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
drum \- paging device
.SH DESCRIPTION
This file refers to the paging device in use by the system.
This may actually be a subdevice of one of the disk drivers, but in
a system with paging interleaved across multiple disk drives
it provides an indirect driver for the multiple drives.
.SH FILES
/dev/drum
.SH BUGS
Reads from the drum are not allowed across the interleaving boundaries.
Since these only occur every
.BR . 5Mbytes
or so,
and since the system never allocates blocks across the boundary,
this is usually not a problem.
E 1
