abs0/4.3BSD-Quasijarus/man/man4/SCCS/s.ip.4p
h11256
s 00047/00010/00060
d D 6.2 86/05/16 15:53:18 karels 3 2
c options, updates
e
s 00001/00001/00069
d D 6.1 85/05/15 17:44:54 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00070/00000/00000
d D 5.1 85/05/15 17:44:48 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH IP 4P "25 March 1982"
E 2
I 2
.TH IP 4P "%Q%"
E 2
.UC 5
.SH NAME
ip \- Internet Protocol
.SH SYNOPSIS
.B #include <sys/socket.h>
.br
.B #include <netinet/in.h>
.PP
D 3
.B s = socket(AF_INET, SOCK_RAW, 0);
E 3
I 3
.B s = socket(AF_INET, SOCK_RAW, proto);
E 3
.SH DESCRIPTION
IP is the transport layer protocol used
D 3
by the Internet protocol family.  It may be accessed
E 3
I 3
by the Internet protocol family.
Options may be set at the IP level
when using higher-level protocols that are based on IP
(such as TCP and UDP).
It may also be accessed
E 3
through a \*(lqraw socket\*(rq when developing new protocols, or
D 3
special purpose applications.  IP sockets are connectionless,
E 3
I 3
special purpose applications.
.PP
A single generic option is supported at the IP level, IP_OPTIONS,
that may be used to provide IP options to be transmitted in the IP
header of each outgoing packet.
Options are set with
.IR setsockopt (2)
and examined with
.IR getsockopt (2).
The format of IP options to be sent is that specified by the IP protocol
specification, with one exception:
the list of addresses for Source Route options must include the first-hop
gateway at the beginning of the list of gateways.
The first-hop gateway address will be extracted from the option list
and the size adjusted accordingly before use.
IP options may be used with any socket type in the Internet family.
.PP
Raw IP sockets are connectionless,
E 3
and are normally used with the
.I sendto 
and
.I recvfrom 
calls, though the
.IR connect (2)
call may also be used to fix the destination for future
packets (in which case the 
.IR read (2)
or
.IR recv (2)
and 
.IR write (2)
or
.IR send (2)
system calls may be used).
.PP
I 3
If
.I proto
is 0, the default protocol IPPROTO_RAW is used for outgoing
packets, and only incoming packets destined for that protocol
are received.
If
.I proto
is non-zero, that protocol number will be used on outgoing packets
and to filter incoming packets.
.PP
E 3
Outgoing packets automatically have an IP header prepended to
them (based on the destination address and the protocol
number the socket is created with).
D 3
Likewise, incoming packets have their IP header stripped
before being sent to the user.
E 3
I 3
Incoming packets are received with IP header and options intact.
E 3
.SH DIAGNOSTICS
A socket operation may fail with one of the following errors returned:
.TP 15
[EISCONN]
when trying to establish a connection on a socket which
already has one, or when trying to send a datagram with the destination
address specified and the socket is already connected;
.TP 15
[ENOTCONN]
when trying to send a datagram, but
no destination address is specified, and the socket hasn't been
connected;
.TP 15
[ENOBUFS]
when the system runs out of memory for
an internal data structure;
.TP 15
[EADDRNOTAVAIL]
when an attempt is made to create a 
socket with a network address for which no network interface
exists.
D 3
.SH SEE ALSO
send(2), recv(2), intro(4N), inet(4F)
.SH BUGS
One should be able to send and receive ip options.
E 3
.PP
D 3
The protocol should be settable after socket creation.
E 3
I 3
The following errors specific to IP
may occur when setting or getting IP options:
.TP 15
[EINVAL]
An unknown socket option name was given.
.TP 15
[EINVAL]
The IP option field was improperly formed;
an option field was shorter than the minimum value
or longer than the option buffer provided.
.SH SEE ALSO
getsockopt(2), send(2), recv(2), intro(4N), icmp(4P), inet(4F)
E 3
E 1
