abs0/4.3BSD-Quasijarus/man/man4/SCCS/s.lo.4
h48060
s 00006/00000/00031
d D 6.3 86/05/21 22:33:31 karels 4 3
c warning about order of configuration
e
s 00008/00007/00023
d D 6.2 86/05/16 15:55:15 karels 3 2
c updates
e
s 00001/00001/00029
d D 6.1 85/05/15 17:45:22 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00030/00000/00000
d D 5.1 85/05/15 17:45:15 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH LO 4 "26 March 1982"
E 2
I 2
.TH LO 4 "%Q%"
E 2
.UC 5
.SH NAME
lo \- software loopback network interface
.SH SYNOPSIS
.B pseudo-device loop
.SH DESCRIPTION
The
.I loop
interface is a software loopback mechanism which may be
used for performance analysis, software testing, and/or local
D 3
communication.   By default, the loopback interface is
accessible at address 127.0.0.1 (non-standard); this address
may be changed with the SIOCSIFADDR ioctl.
E 3
I 3
communication.
As with other network interfaces, the loopback interface must have
network addresses assigned for each address family with which it is to be used.
These addresses
may be set or changed with the SIOCSIFADDR ioctl.
I 4
The loopback interface should be the last interface configured,
as protocols may use the order of configuration as an indication of priority.
The loopback should \fBnever\fP be configured first unless no hardware
interfaces exist.
E 4
E 3
.SH DIAGNOSTICS
\fBlo%d: can't handle af%d\fP.  The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.SH SEE ALSO
D 3
intro(4N), inet(4F)
E 3
I 3
intro(4N), inet(4F), ns(4F)
E 3
.SH BUGS
D 3
It should handle all address and protocol families.
An approved network address should be reserved for this
interface.
E 3
I 3
Previous versions of the system enabled the loopback interface
automatically, using a nonstandard Internet address (127.1).
I 4
Use of that address is now discouraged; a reserved host address
for the local network should be used instead.
E 4
E 3
E 1
