abs0/4.3BSD-Quasijarus/man/man4/SCCS/s.ns.4f
h26412
s 00001/00001/00096
d D 1.3 86/05/21 15:57:47 anne 3 2
c spelling
e
s 00004/00004/00093
d D 1.2 86/05/13 17:43:31 karels 2 1
c correct see also
e
s 00097/00000/00000
d D 1.1 85/07/30 21:55:22 sklower 1 0
c date and time created 85/07/30 21:55:22 by sklower
e
u
U
t
T
I 1
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH NS 4F "July 30, 1985"
.UC 6
.SH NAME
ns \- Xerox Network Systems(tm) protocol family
.SH SYNOPSIS
\fBoptions NS\fP
.br
\fBoptions NSIP\fP
.br
\fBpseudo-device ns\fP
.SH DESCRIPTION
.IX  "ns device"  ""  "\fLns\fP \(em Xerox NS protocol family"
The NS protocol family is a collection of protocols
layered atop the
.I Internet Datagram Protocol
(IDP) transport layer, and using the Xerox NS address formats.
The NS family provides protocol support for the
SOCK_STREAM, SOCK_DGRAM, SOCK_SEQPACKET, and SOCK_RAW socket types; the
SOCK_RAW interface is a debugging tool, allowing you to trace all packets
entering, (or with toggling kernel variable, additionally leaving) the local
host.
.SH ADDRESSING
NS addresses are 12 byte quantities, consisting of a 
4 byte Network number, a 6 byte Host number and a 2 byte port number,
all stored in network standard format.
(on the VAX these are word and byte reversed; on the Sun they are not
reversed).  The include file
.RI < netns/ns.h >
defines the NS address as a structure containing unions (for quicker
comparisons).
.PP
Sockets in the Internet protocol family use the following
addressing structure:
.nf

struct sockaddr_ns {
	short		sns_family;
	struct ns_addr	sns_addr;
	char		sns_zero[2];
};

where an ns_addr is composed as follows:

union ns_host {
	u_char		c_host[6];
	u_short		s_host[3];
};

union ns_net {
	u_char		c_net[4];
	u_short		s_net[2];
};

struct ns_addr {
	union ns_net	x_net;
	union ns_host	x_host;
	u_short	x_port;
};

.fi
Sockets may be created with an address of all zeroes to effect
``wildcard'' matching on incoming messages.
The local port address specified in a
.IR bind (2)
call is restricted to be greater than NSPORT_RESERVED
(=3000, in <netns/ns.h>) unless the creating process is running
as the super-user, providing a space of protected port numbers.
.SH PROTOCOLS
The NS protocol family supported by the operating system
is comprised of
the Internet Datagram Protocol (IDP)
.IR idp (4P),
Error Protocol (available through IDP),
and
Sequenced Packet Protocol (SPP)
.IR spp (4P).
.LP
SPP is used to support the SOCK_STREAM and SOCK_SEQPACKET abstraction,
while IDP is used to support the SOCK_DGRAM abstraction.
The Error protocol is responded to by the kernel
to handle and report errors in protocol processing;
it is, however,
only accessible to user programs through heroic actions.
.SH SEE ALSO
D 2
intro(3N), byteorder(3N), gethostent(3N), getnetent(3N),
getprotoent(3N), getservent(3N), inet(3N), network(3N),
spp(4P), idp(4P), nsip(4)
E 2
I 2
intro(3), byteorder(3N), gethostbyname(3N), getnetent(3N),
getprotoent(3N), getservent(3N), ns(3N),
intro(4N), spp(4P), idp(4P), nsip(4)
E 2
.br
Internet Transport Protocols, Xerox Corporation document XSIS-028112
.br
D 2
A 4.2BSD Interprocess Communication Primer
E 2
I 2
D 3
An Advanced 4.3BSD Interprocess Communication Tutuorial
E 3
I 3
An Advanced 4.3BSD Interprocess Communication Tutorial
E 3
E 2
E 1
