abs0/4.3BSD-Quasijarus/man/man4/SCCS/s.pty.4
h53234
s 00037/00005/00113
d D 6.2 86/05/19 16:37:19 karels 3 2
c UCNTL crap, default units, rm fixed bugs
e
s 00001/00001/00117
d D 6.1 85/05/15 17:46:19 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00118/00000/00000
d D 5.1 85/05/15 17:46:13 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH PTY 4 "7 July 1983"
E 2
I 2
.TH PTY 4 "%Q%"
E 2
.UC 5
.SH NAME
pty \- pseudo terminal driver
.SH SYNOPSIS
D 3
.B pseudo-device pty
E 3
I 3
.B pseudo-device pty [ count ]
E 3
.SH DESCRIPTION
The
.I pty
driver provides support for a device-pair termed a
.IR "pseudo terminal" .
A pseudo terminal is a pair of character devices, a
.I master
device and a
.I slave
device.  The slave device provides processes
an interface identical
to that described in
.IR tty (4).
However, whereas all other devices which provide the 
interface described in
.IR tty (4)
have a hardware device of some sort behind them, the slave
device has, instead, another process manipulating
it through the master half of the pseudo terminal.
That is, anything written on the master device is
given to the slave device as input and anything written
on the slave device is presented as input on the master
device.
.PP
D 3
In configuring, if no optional ``count'' is given in
the specification, 16 pseudo terminal pairs are configured.
E 3
I 3
In configuring, if an optional ``count'' is given in
the specification, that number of pseudo terminal pairs are configured;
the default count is 32.
E 3
.PP
The following 
.I ioctl
calls apply only to pseudo terminals:
.TP
TIOCSTOP
Stops output to a terminal (e.g. like typing ^S).  Takes
no parameter.
.TP
TIOCSTART
Restarts output (stopped by TIOCSTOP or by typing ^S).
Takes no parameter.
.TP
TIOCPKT
Enable/disable 
.I packet
mode.  Packet mode is enabled by specifying (by reference)
a nonzero parameter and disabled by specifying (by reference)
a zero parameter.  When applied to the master side of a pseudo
terminal, each subsequent 
.I read 
from the terminal will return data written on the slave part of
the pseudo terminal preceded by a zero byte (symbolically
defined as TIOCPKT_DATA), or a single byte reflecting control
status information.  In the latter case, the byte is an inclusive-or
of zero or more of the bits:
.RS
.TP
TIOCPKT_FLUSHREAD
whenever the read queue for the terminal is flushed.
.TP
TIOCPKT_FLUSHWRITE
whenever the write queue for the terminal is flushed.
.TP
TIOCPKT_STOP
whenever output to the terminal is stopped a la ^S.
.TP
TIOCPKT_START
whenever output to the terminal is restarted.
.TP
TIOCPKT_DOSTOP
whenever 
.I t_stopc
is ^S
and 
.I t_startc
is ^Q.
.TP
TIOCPKT_NOSTOP
whenever the start and stop characters are not ^S/^Q.
.RE
.IP
I 3
While this mode is in use, the presence of control status information
to be read from the master side may be detected by a
.I select
for exceptional conditions.
.IP
E 3
This mode is used by
.IR rlogin (1C)
and
.IR rlogind (8C)
to implement a remote-echoed, locally ^S/^Q flow-controlled
remote login with proper back-flushing of output; it can be
used by other similar programs.
.TP
I 3
TIOCUCNTL
Enable/disable a mode that allows a small number of simple user
.I ioctl
commands to be passed through the pseudo-terminal,
using a protocol similar to that of TIOCPKT.
The TIOCUCNTL and TIOCPKT modes are mutually exclusive.
This mode is enabled from the master side of a pseudo terminal
by specifying (by reference)
a nonzero parameter and disabled by specifying (by reference)
a zero parameter.
Each subsequent 
.I read 
from the master side will return data written on the slave part of
the pseudo terminal preceded by a zero byte,
or a single byte reflecting a user control operation on the slave side.
A user control command consists of a special
.I ioctl
operation with no data; the command is given as UIOCCMD(\fIn\fP),
where \fIn\fP is a number in the range 1-255.
The operation value \fIn\fP will be received as a single byte on the next
.I read
from the master side.
The \fIioctl\fP UIOCCMD(0) is a no-op that may be used to probe for
the existence of this facility.
As with TIOCPKT mode, command operations may be detected with a
.I select
for exceptional conditions.
.TP
E 3
TIOCREMOTE
A mode for the master half of a pseudo terminal, independent
of TIOCPKT.  This mode causes input to the pseudo terminal
to be flow controlled and not input edited (regardless of the
terminal mode).  Each write to the control terminal produces
a record boundary for the process reading the terminal.  In
normal usage, a write of data is like the data typed as a line
on the terminal; a write of 0 bytes is like typing an end-of-file
character.  TIOCREMOTE can be used when doing remote line
editing in a window manager, or whenever flow controlled input
is required.
.SH FILES
.DT
/dev/pty[p-r][0-9a-f]	master pseudo terminals
.br
/dev/tty[p-r][0-9a-f]	slave pseudo terminals
.SH DIAGNOSTICS
None.
D 3
.SH BUGS
It is not possible to send an EOT.
E 3
E 1
