abs0/4.3BSD-Quasijarus/man/man8/tahoe/enpload.8
.\" Copyright (c) 1987 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)enpload.8	5.2 (Berkeley) 6/2/99
.\"
.TH ENPLOAD 8C "June 2, 1999"
.UC 5
.SH NAME
enpload \- download firmware and initialize a CMC Ethernet controller
.SH SYOPNSIS
.B /etc/enpload
.I device
[
.I files
]
.SH DESCRIPTION
.I Enpload
is used to download firmware and initialize a CMC
ENP-20 Ethernet controller.
The
.I device
specified is a character device used to access the on-board
RAM which hosts the controllers operating firmware;
the
.I files
arguments specify the firmware file(s) to load into this memory.
After
.I enpload
deposits the specified firmware it starts the board running.
If no firmware is specified the board is just restarted.
.I Enpload
must be run before a CMC controller can be used by the
system.
.SH FILES
.ta \w'/dev/enp?ram    'u
/dev/enp?ram	special files for accessing ENP-20 memory
.br
/etc/enpcode	link-level firmware
.SH "SEE ALSO"
enp(4), ifconfig(8C), rc(8)
