abs0/4.3BSD-Quasijarus/man/man8/vax/SCCS/s.arff.8v
h56524
s 00013/00012/00128
d D 6.2 86/05/20 16:41:02 karels 4 3
c not all 780's these days...
e
s 00001/00003/00139
d D 6.1 85/04/27 12:55:08 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00022/00012/00120
d D 5.1 85/04/27 12:54:17 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00132/00000/00000
d D 4.1 85/04/27 12:52:15 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH ARFF 8 "4/3/81"
E 2
I 2
D 3
.TH ARFF 8V "18 July 1983"
E 3
I 3
.TH ARFF 8V "%Q%"
E 3
E 2
.UC 4
.SH NAME
arff, flcopy \- archiver and copier for floppy
.SH SYNOPSIS
.B /etc/arff
[ key ] [ name ... ]
.br
.B /etc/flcopy
[
.B \-h
] [
\fB\-t\fIn\fR
]
.SH DESCRIPTION
.I Arff
saves and restores files
D 4
on the console floppy disk.
E 4
I 4
on VAX console media (the console floppy on the VAX 11/780 and 785,
the cassette on the 11/730, and the console RL02 on the 8600/8650).
E 4
Its actions are controlled by the
.I key
argument.
The
.I key
is a string of characters containing
at most one function letter and possibly
one or more function modifiers.
Other arguments to the command are file
names specifying which files are to be dumped or restored.
I 4
The default options are correct for the RX01 floppy on the 780;
for other console media, the
.B f
and
.B m
flags are required.
E 4
.PP
Files names have restrictions, because of radix50 considerations.  They
must be in the form 1-6 alphanumerics followed by "." followed by
0-3 alphanumerics.  Case distinctions are lost.  Only the trailing component
of a pathname is used.
.PP
The function portion of
the key is specified by one of the following letters:
.TP 8
.B  r
The named files
are replaced where found on the floppy, or added taking up
the minimal possible portion of the first empty spot on the floppy.
.TP 8
.B  x
The named files are extracted from the floppy.
.TP 8
.B  d
The named files are deleted from the floppy.  Arff will combine contiguous
deleted files into one empty entry in the rt-11 directory.
.TP 8
.B  t
The names of the specified files are listed each time they occur
on the floppy.
If no file argument is given,
all of the names on the floppy are listed.
.PP
The following characters may be used in addition to the letter
which selects the function desired.
.TP 10
.B  v
D 2
Normally
.I arff
does its work silently.
E 2
The
.B v
(verbose)
D 2
option causes it to type the name of each file it treats
preceded by the function letter.
With the
E 2
I 2
option, when used with the
E 2
.B t
D 2
function,
.B v
gives more information about the
E 2
I 2
function gives more information about the
E 2
floppy entries than just the name.
.TP 10
.B f
causes 
.I arff
to use the next argument as the name of the archive instead
of /dev/floppy. 
.TP 10
.B m
causes
.I arff
not to use the mapping algorithm employed in interleaving sectors
around a floppy disk.  In conjunction with the 
.B f
option it may be
used for extracting files from rt11 formatted cartridge disks, for
D 2
example.
E 2
I 2
D 4
example. It may also be used to speed up reading from and writing to 
E 4
I 4
example.
It may also be used to speed up reading from and writing to 
E 4
rx02 floppy disks, by using the `c' device instead of the `b' device.
I 4
It must be used with TU58 or RL02 media.
E 4
.TP 10
.B c
causes
.I arff
to create a new directory on the floppy, effectively deleting
all previously existing files.
E 2
.PP
.I Flcopy
copies
the console floppy disk
(opened as `/dev/floppy')
to a file created in the
current directory, named \*(lqfloppy\*(rq,
then prints the message
\*(lqChange Floppy, hit return when done\*(rq.
Then
.I flcopy
copies the local file back out to the floppy disk.
.PP
The
.B \-h
option to 
.I flcopy
causes it to
open a file named \*(lqfloppy\*(rq in the current directory
and copy it to
.I /dev/floppy;
the
.B \-t
option
causes only the first
.I n
tracks to participate in a copy.
I 2
D 4
.PP
.I Arff
may also be used with the console TU58 cassettes on the 11/730.
To do so, the 
.B m
key must be specified.   Normally, the
.B f
key is also used.
E 4
E 2
.SH FILES
D 2
/dev/floppy
E 2
I 2
/dev/floppy or /dev/rrx??
E 2
.br
floppy (in current directory)
I 2
.SH SEE ALSO
D 4
fl(4), rx(4), rxformat(8V)
E 4
I 4
crl(4), fl(4), rx(4), tu(4), rxformat(8V)
E 4
E 2
.SH AUTHORS
Keith Sklower, Richard Tuck
.SH BUGS
D 4
Floppy errors are handled ungracefully;
E 4
I 4
Device errors are handled ungracefully.
E 4
D 3
.I Arff
does not handle multi-segment rt11 directories.
E 3
E 1
