abs0/4.3BSD-Quasijarus/man/man8/vax/SCCS/s.drtest.8v
h11504
s 00001/00001/00073
d D 6.3 04/10/20 19:41:39 msokolov 4 3
c it should be 8V too!
e
s 00001/00002/00073
d D 6.2 86/05/19 19:03:10 karels 3 2
c 8 => 8V
e
s 00001/00001/00074
d D 6.1 85/04/27 14:54:14 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00075/00000/00000
d D 5.1 85/04/27 14:53:53 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH DRTEST 8 "26 January 1983"
E 2
I 2
D 4
.TH DRTEST 8 "%Q%"
E 4
I 4
.TH DRTEST 8V "%Q%"
E 4
E 2
.UC 5
.SH NAME
drtest \- standalone disk test program
.SH DESCRIPTION
.PP
.I Drtest
is a standalone program used to read a disk 
track by track. 
It was primarily intended as a test program 
for new standalone drivers, but has shown
useful in other contexts as well, such as 
verifying disks and running speed
tests. For example, when a disk has been formatted
(by format(8)), you can check that
hard errors has been taken care of by running 
.IR drtest .
No hard errors should be found, but in many cases 
quite a few soft ECC errors will be reported.
.PP
While
.I drtest
is running, the cylinder number is printed on
the console for every 10th cylinder read.
.SH EXAMPLE
A sample run of 
.I drtest
is shown below.  
In this example (using a 750), 
.I drtest
is loaded from the root file system;
usually it
will be loaded from the machine's
console storage device.  Boldface means user input.
As usual, ``#'' and ``@'' may be used to edit input.
.nf
.in +5
.sp 1
>>>\fBB/3\fR
%%
loading hk(0,0)boot 
Boot
: \fBhk(0,0)drtest\fR
Test program for stand-alone up and hp driver
.sp 1
Debugging level (1=bse, 2=ecc, 3=bse+ecc)?
Enter disk name [type(adapter,unit), e.g. hp(1,3)]? \fBhp(0,0)\fR
Device data: #cylinders=1024, #tracks=16, #sectors=32
Testing hp(0,0), chunk size is 16384 bytes.
\fI(chunk size is the number of bytes read per disk access)\fP
Start ...Make sure hp(0,0) is online
 ...
\fI(errors are reported as they occur)\fP
 ...
\fI(...program restarts to allow checking other disks)\fP
\fI(...to abort halt machine with ^P)\fP
.in -5
.fi
.sp 1
.SH DIAGNOSTICS
The diagnostics are intended to be self explanatory. Note, however, that 
the device number
in the diagnostic messages is identified as  \fItypeX\fR instead of 
\fItype(a,u)\fR where \fIX\fR = a*8+u, e.g., hp(1,3) becomes hp11.
.SH SEE ALSO
D 3
format(8), bad144(8)
E 3
I 3
format(8V), bad144(8)
E 3
.SH AUTHOR
Helge Skrivervik
D 3

E 3
E 1
