abs0/4.3BSD-Quasijarus/man/man8/vax/SCCS/s.format.8v
h17752
s 00001/00001/00265
d D 6.4 86/05/22 00:13:45 lepreau 6 5
c max is 48 passes not 46
e
s 00005/00003/00261
d D 6.3 86/05/21 00:16:42 karels 5 4
c missed some
e
s 00039/00025/00225
d D 6.2 86/05/21 00:14:53 karels 4 3
c updates
e
s 00001/00001/00249
d D 6.1 85/04/27 13:24:50 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00219/00052/00031
d D 5.1 85/04/27 13:24:16 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00083/00000/00000
d D 4.1 85/04/27 13:23:33 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
E 5
I 5
.\" Copyright (c) 1980,1983 Regents of the University of California.
E 5
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH FORMAT 8 4/26/81
E 2
I 2
D 3
.TH FORMAT 8V "25 February 1983"
E 3
I 3
.TH FORMAT 8V "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 2
format \- how to format disks
E 2
I 2
format \- how to format disk packs
E 2
.SH DESCRIPTION
.PP
D 2
Warning:  These instructions are for people with 11/780 CPU's.  We don't
know how to do this for 11/750 cpus (yet at least), you'll have to
figure it out yourself; if you do call us and tell us how.
E 2
I 2
There are two ways to format disk packs.  The simplest is to
use the
.I format
program.  The alternative is to use the DEC standard formatting
software which operates under the DEC diagnostic supervisor. 
This manual page describes the operation of
.IR format ,
then concludes with some remarks about using the DEC formatter.
E 2
.PP
I 2
.I Format
is a standalone program used to
format and check disks prior to constructing
file systems.
In addition to the formatting
operation,
.I format
records any bad sectors encountered
according to DEC standard 144. 
Formatting is performed one track at a
time by writing the appropriate
headers and a test pattern and then checking
the sector by reading and verifying the pattern, using
the controller's ECC for error detection.
A sector is marked bad if an unrecoverable media
error is detected, or if a correctable
D 4
ECC error greater than 5 bits in length
E 4
I 4
ECC error too many bits in length
E 4
is detected (such errors are indicated as
``ECC'' in the summary printed upon
completing the format operation).
After the entire disk
has been formatted and checked,
the total number of errors are reported,
any bad sectors and skip sectors are marked,
and a bad sector forwarding table
is written to the disk in the first five
even numbered sectors of the last track.
I 4
It is also possible to reformat sections of the disk
in units of tracks.
E 4
.I Format 
may be used on any UNIBUS or MASSBUS drive
supported by the \fIup\fP and \fIhp\fP device
drivers which uses 4-byte headers (everything except RP's).
.PP
The test pattern used during the media check
may be selected from one of: 0xf00f (RH750 worst case),
0xec6d (media worst case), and 0xa5a5 (alternating
1's and 0's).
Normally the media worst case pattern is used.
.PP
.I Format
D 5
also has an option to perform an extended \*(lqsevere burnin,\*(rq
E 5
I 5
also has an option to perform an extended \*(lqsevere burn-in,\*(rq
E 5
D 4
which makes 46 passes using different patterns.
Using this option, sectors with any errors of any size
are marked bad.
E 4
I 4
which makes a number of passes using different patterns.
The number of passes can be selected at run time,
D 6
up to a maximum of 46,
E 6
I 6
up to a maximum of 48,
E 6
with provision for additional passes or termination
after the preselected number of passes.
E 4
This test runs for many hours, depending on the disk and processor.
.PP
Each time
.I format
D 4
is run a completely new bad sector table is generated
E 4
I 4
is run to format an entire disk,
a completely new bad sector table is generated
E 4
based on errors encountered while formatting.
The device driver, however, will always attempt to
read any existing bad sector table when the device is
first opened.
Thus, if a disk pack has never previously been formatted,
or has been formatted with different sectoring,
five error messages will be printed when the driver attempts
to read the bad sector table; these diagnostics should be ignored.
.PP
Formatting a 400 megabyte disk on a MASSBUS disk controller
usually takes about 20 minutes.
Formatting on a UNIBUS disk controller takes significantly
longer.
For every hundredth cylinder formatted
.I format
prints a message indicating the current cylinder being formatted.
(This message is just to reassure people that nothing is
is amiss.)
.PP
.I Format
D 4
uses the standard notation of the standalone i/o library
E 4
I 4
uses the standard notation of the standalone I/O library
E 4
in identifying a drive to be formatted.  A drive is
specified as
.IR zz ( x , y ),
where 
.I zz
refers to the controller type (either
.I hp
or
.IR up ),
.I x
is the unit number of the drive;
8 times the UNIBUS or MASSBUS
adaptor number plus the MASSBUS drive number or UNIBUS
drive unit number; and
.I y
is the file system partition
on drive
.I x
(this should always be 0). 
For example, ``hp(1,0)'' indicates that drive
1 on MASSBUS adaptor 0 should be formatted; while
D 4
``up(10,0)'' indicates UNIBUS drive 2 on UNIBUS adaptor 1
E 4
I 4
``up(10,0)'' indicates that UNIBUS drive 2 on UNIBUS adaptor 1
E 4
should be formatted.
.PP
Before each formatting attempt, 
.I format
prompts the user in case debugging should be enabled
in the appropriate device driver.  A carriage return
disables debugging information.
.PP
.I Format
should be used prior to building file systems (with 
.IR newfs (8))
D 4
to insure all sectors with uncorrectable media errors
E 4
I 4
to insure that all sectors with uncorrectable media errors
E 4
are remapped.  If a drive develops uncorrectable
D 4
defects after formatting, the program
E 4
I 4
defects after formatting, either
.IR bad144 (8)
or
E 4
.IR badsect (8)
D 4
must be used.
E 4
I 4
should be able to avoid the bad sectors.
E 4
.SH EXAMPLE
A sample run of 
.I format
is shown below.  
In this example (using a VAX-11/780), 
.I format
is loaded from the console floppy;
on an 11/750
.I format
D 5
will be loaded from the root file system.
E 5
I 5
will be loaded from the root file system with
.IR boot (8)
following a \*(lqB/3\*(rq command.
E 5
Boldface means user input.
As usual, ``#'' and ``@'' may be used to edit input.
.nf
.in +0.5i
.ta  1i
.sp 1
>>>\fBL FORMAT\fP
	LOAD DONE, 00004400 BYTES LOADED
>>>\fBS 2\fP
Disk format/check utility
.sp
Enable debugging (0=none, 1=bse, 2=ecc, 3=bse+ecc)? \fB0\fP
D 4
Device to format? \fBhp(8,0)\fR
E 4
I 4
Device to format? \fBhp(8,0)\fP
E 4
(\fIerror messages may occur as old bad sector table is read\fP)
Formatting drive hp0 on adaptor 1: verify (yes/no)? \fByes\fP
Device data: #cylinders=842, #tracks=20, #sectors=48
I 4
Starting cylinder (0):
Starting track (0):
Ending cylinder (841):
Ending track (19):
E 4
Available test patterns are:
D 4
	1 - (f00f) rh750 worst case
	2 - (ec6d) media worst case
	3 - (a5a5) alternating 1's and 0's
	4 - (ffff) Severe burnin (takes several hours)
E 4
I 4
.in +1.0i
1 - (f00f) RH750 worst case
2 - (ec6d) media worst case
3 - (a5a5) alternating 1's and 0's
4 - (ffff) Severe burnin (up to 48 passes)
.in -1.0i
E 4
Pattern (one of the above, other to restart)? \fB2\fP
I 4
Maximum number of bit errors to allow for soft ECC (3):
E 4
Start formatting...make sure the drive is online
 ...
(\fIsoft ecc's and other errors are reported as they occur\fP)
 ...
(\fIif 4 write check errors were found, the program terminates like this...\fP)
 ...
Errors:
D 4
Write check: 4
E 4
Bad sector: 0
D 4
ECC: 0
Skip sector: 0
Total of 4 hard errors found.
Writing bad sector table at block 808271	
(\fI808271 is the block # of the first block in the bad sector table\fP)
E 4
I 4
Write check: 4
Hard ECC: 0
Other hard: 0
Marked bad: 0
Skipped: 0
Total of 4 hard errors revectored.
Writing bad sector table at block 808272	
(\fI808272 is the block # of the first block in the bad sector table\fP)
E 4
Done
(\fI...program restarts to allow formatting other disks\fP)
(\fI...to abort halt machine with ^P\fP)
D 4
.in -0.5i
E 4
.fi
.sp 1
.SH DIAGNOSTICS
The diagnostics are intended to be self explanatory.
.SH "USING DEC SOFTWARE TO FORMAT"
.PP
.B "Warning:  These instructions are for people with 11/780 CPU's."
The steps needed for 11/750 or 11/730 cpu's are similar, but not
covered in detail here.
.I
.PP
E 2
The formatting procedures are different for each type of disk.  Listed
D 2
here are the formatting procedures for RK07's, RP0X, RM0X and Emulex Unibus
Disks.
E 2
I 2
here are the formatting procedures for RK07's, RP0X, and RM0X 
disks.
E 2
.PP
You should shut down UNIX and halt the machine to do any disk formatting.
Make certain you put in the pack you want formatted.  It is also a good idea
to spin down or write protect the disks you don't want to format, just in case.
.PP
D 2
.B Formatting a RK07.
Load the floppy labled, "RX11 VAX DSK LD DEV #1" in the floppy disk drive,
and type the following commands:
E 2
I 2
.B "Formatting an RK07."
Load the console floppy labeled, "RX11 VAX DSK LD DEV #1" in
the console disk drive, and type the following commands:
.RS
E 2
.nf
D 2
	>>>BOOT
	DIAGNOSTIC SUPERVISOR.  ZZ-ESSAA-X5.0-119  23-JAN-1980 12:44:40.03
	DS>ATTACH DW780 SBI DW0 3 5
	DS>ATTACH RK07 DW0 DMA0
	DS>SELECT DMA0
	DS>LOAD EVRAC
	DS>START/SEC:PACKINIT
E 2
I 2
>>>BOOT
DIAGNOSTIC SUPERVISOR.  ZZ-ESSAA-X5.0-119  23-JAN-1980 12:44:40.03
DS>ATTACH DW780 SBI DW0 3 5
DS>ATTACH RK611 DMA
DS>ATTACH RK07 DW0 DMA0
DS>SELECT DMA0
DS>LOAD EVRAC
DS>START/SEC:PACKINIT
E 2
.fi
I 2
.RE
E 2
.PP
D 2
.B Formatting a RP0X.
Follow the above procedures except that the ATTACH and SELECT lines should
read.
E 2
I 2
.B "Formatting an RP0X."
Follow the above procedures except that the
ATTACH and SELECT lines should read:
.RS
E 2
.nf
D 2
	DS>ATTACH RH780 SBI RH0 8 5
	DS>ATTACH RP0X RH0 DBA0		(RP0X is, e.g. RP06)
	DS>SELECT DBA0
E 2
I 2
DS>ATTACH RH780 SBI RH0 8 5
DS>ATTACH RP0X RH0 DBA0		(RP0X is, e.g. RP06)
DS>SELECT DBA0
E 2
.fi
I 2
.RE
E 2
.PP
This is for drive 0 on mba0; use 9 instead of 8 for mba1, etc.
.PP
D 2
.B Formatting a RM0X.
Follow the above procedures except that the ATTACH and SELECT lines should
read.
E 2
I 2
.B "Formatting an RM0X."
Follow the above procedures except that the
ATTACH and SELECT lines should read:
.RS
E 2
.nf
D 2
	DS>ATTACH RH780 SBI RH0 8 5
	DS>ATTACH RM0X RH0 DRA0
	DS>SELECT DRA0
E 2
I 2
DS>ATTACH RH780 SBI RH0 8 5
DS>ATTACH RM0X RH0 DRA0
DS>SELECT DRA0
E 2
.fi
I 2
.RE
E 2
.PP
D 2
.B Formatting an Emulex Unibus Disk.
Type these commands on the console:
.nf
	>>>SET REL:2013FDC0
	>>>SET DEF WORD
	>>>SET DEF OCT
	>>>SET DEF PHYS
	>>>U
	>>>I
	>>>D/P 10 0
	>>>D/P 0 21
	>>>D/P 36 177777
	>>>D/P 0 77
	(figure out when it is done)
	>>>SET REL:0
	>>>SET DEF LONG
	>>>SET DEF HEX
.fi
.PP
Once a disk is formatted, you'll still have to build file systems on it
with mkfs(8) before you can use it with UNIX.
.PP
E 2
Don't forget to put your UNIX console floppy back
in the floppy disk drive.
.SH SEE ALSO
D 2
bad144(8), badsect(8), mkfs(8)
E 2
I 2
bad144(8),
badsect(8),
newfs(8)
.SH BUGS
An equivalent facility should be available which operates under
a running UNIX system. 
.PP
D 4
It should be possible to define more
precisely what a ``hard ECC'' error is; e.g. the maximum unacceptable
ECC width.
E 4
I 4
It should be possible to reformat or verify part or all of a disk,
then update the existing bad sector table.
E 4
E 2
E 1
