abs0/4.3BSD-Quasijarus/old/man/SCCS/s.dumpdir.8
h27171
s 00044/00000/00000
d D 4.1 85/04/27 13:21:54 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH DUMPDIR 8 "4/1/81"
.UC 4
.SH NAME
dumpdir \- print the names of files on a dump tape
.SH SYNOPSIS
.B /etc/dumpdir
[
.B f
filename ]
.SH DESCRIPTION
.I Dumpdir
is used to read magtapes dumped with the
.I dump
command and list the names and inode numbers
of all the files and directories on the tape.
.PP
The
.B f
option causes
.I filename
as the name of the tape instead
of the default.
.SH FILES
default tape unit varies with installation
.br
rst*
.SH "SEE ALSO"
dump(1), restor(1)
.SH DIAGNOSTICS
If the dump extends over more than one tape,
it may ask you to change tapes.
Reply with a new-line when the next tape has been mounted.
.SH BUGS
There is redundant information on the tape
that could be used in case of tape reading problems.
Unfortunately,
.I dumpdir
doesn't use it.
E 1
