abs0/4.3BSD-Quasijarus/old/man/SCCS/s.mail.4
h64231
s 00024/00000/00000
d D 4.1 85/05/15 17:02:12 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH MAIL 4
.UC 4
.SH NAME
mail \- pseudo-device for mail notification
.SH DESCRIPTION
The file
.B /dev/mail
is a multiplexor file
maintained by the mail notification daemon.
When a piece of mail is delivered the mail delivery process
writes information on this file and the mail notification daemon
.B /etc/comsat
notifies a user of the arrival of the mail if the user desires to be notified.
.SH SEE ALSO
biff(1)
.SH FILES
/dev/mail
.SH BUGS
E 1
