abs0/4.3BSD-Quasijarus/old/man/SCCS/s.netlog.1
h12521
s 00001/00001/00026
d D 6.1 85/04/29 19:18:19 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00026
d D 5.1 85/04/29 19:17:52 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00027/00000/00000
d D 4.1 85/04/29 19:17:28 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH NETLOG 1 2/6/80
E 2
I 2
D 3
.TH NETLOG 1 "6 February 1980"
E 3
I 3
.TH NETLOG 1 "%G%"
E 3
E 2
.UC 4
.ds s 1
.ds o 1
.SH NAME
netlog \- print the last few lines of the network log file
.SH SYNOPSIS
.B netlog
[ \-lines ]
.SH DESCRIPTION
.I Netlog
prints the last few lines of the network log file indicating recent network
activity.
.SH FILES
.ta 2.5i
/usr/spool/berknet/logfile	the log
.SH SEE ALSO
net(\*s), netrm(\*s), netq(\*s), netcp(\*s),
netlpr(\*s), netmail(\*s), netlogin(\*s),
mail(\*o)
.SH BUGS
E 1
