abs0/4.3BSD-Quasijarus/old/man/SCCS/s.netrm.1
h55264
s 00001/00001/00048
d D 6.1 85/04/29 19:24:37 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00048
d D 5.1 85/04/29 19:24:08 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00049/00000/00000
d D 4.1 85/04/29 19:23:48 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH NETRM 1 2/6/80
E 2
I 2
D 3
.TH NETRM 1 "6 February 1980"
E 3
I 3
.TH NETRM 1 "%G%"
E 3
E 2
.UC 4
.ds s 1
.ds o 1
.SH NAME
netrm \- remove a command from the network queue
.SH SYNOPSIS
.B netrm
[
.B \-
] [ name1 ... namen ]
.SH DESCRIPTION
.I Netrm
removes files from the network queue which have been queued for transmission to remote machines (but not yet sent).
The
.I names
specified are the filenames reported by the
.IR netq (\*s)
command.
The
.B \-
option indicates that all files
owned by the person logged in are to be removed.
.PP
Only the owner of the file or super-user can
.I netrm
the file.
.SH AUTHOR
Eric Schmidt
.SH FILES
.ta 2.5i
/usr/spool/berknet/send?	the directories where the queues are
.SH BUGS
Files on network queues on intermediate machines cannot be removed.
.br
There should be a 
.B \-m
flag to use with 
.B \-
to remove all your requests to one particular machine.
.SH "SEE ALSO"
net(\*s), netq(\*s), netcp(\*s), netlpr(\*s), netmail(\*s), netlogin(\*s),
mail(\*o)
E 1
