abs0/4.3BSD-Quasijarus/old/man/SCCS/s.net.1
h50729
s 00001/00001/00122
d D 6.1 85/04/29 18:57:02 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00122
d D 5.1 85/04/29 18:56:35 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00123/00000/00000
d D 4.1 85/04/29 18:56:04 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH NET 1 2/6/80
E 2
I 2
D 3
.TH NET 1 "6 February 1980"
E 3
I 3
.TH NET 1 "%G%"
E 3
E 2
.UC 4
.ds s 1
.ds o 1
.SH NAME
net \- execute a command on a remote machine
.SH SYNOPSIS
.B net
[
.B \-m
machine ] [
.B \-l
login
] [
.B \-p
password ] [
.B \-r
respfile ] [
.B \-
] [
.B \-f
] [
.B \-n
] [
.B \-q
]
command
.SH DESCRIPTION
The
.I net
command sends the specified 
.I command
(which should be enclosed in quotes) over the network to the specified
(or default) remote machine.
The network will notify the user when the command has
been executed and will return to him any output or error indication by `writing'
(see
.IR  write (\*o))
to the terminal if he is still logged in, or `mailing' (see
.IR  mail (\*o))
otherwise.
.PP
There are a number of options, which must precede the command.
Options may be specified on the command line, preceding
the command, or in a file ``.netrc'' in the user's login directory.
The ``.netrc'' file is not described here.
The
.B \-m
option specifies the desired remote machine.
If a remote machine is not specified, the default one is used.
The machine name may be a one letter abbreviation or a full name;
upper\- and lower\-case distinctions are ignored.
If the standard output and standard error files are to be saved, the
.B \-r
option returns to the originating user a file
.I (respfile)
containing the standard output and error files
when the command was executed on the remote machine.
If this option is used, no message is written back.
The presence of a non-zero length
.I respfile
indicates completion.
The
.B \-q
option suppresses all acknowledgements unless an error occurs, there is
output from the command, or the exit code of
.I command
is non-zero.
.PP
If the
.B \-l
and
.B \-p
options are not specified,
and the login name and password are not in the ``.netrc'' file,
a remote login name and password is prompted for on the terminal;
the
.B \-f
flag forces login name and password prompting.
A single
.B \-
indicates that the standard input from the local machine is to be taken
and transmitted to the remote machine, where it will be the standard input for
.I command.
The
.B \-n
flag forces all acknowledgment and output messages to be mailed
rather than written on the terminal.
Options do not need to be separated by spaces,
i.e. either ``\-m C'' or ``\-mC'' is accepted.
There are also other options intended to be used by
higher level application programs and shell scripts only;
they will not be described here.
.PP
The net command prepares a file to be sent to the remote machine
and queues it in the `network queue.'
.I Netq
(\*s) gives information about the queues.
.SH AUTHOR
Eric Schmidt
.SH FILES
.ta 2.5i
/usr/spool/berknet/logfile	logfile with information about net activity
.br
/usr/spool/berknet/plogfile?	log file including packet transmission statistics
.br
/usr/spool/berknet/netstat?	statistics file
.br
/usr/net/network.map 	local network names and topology
.SH BUGS
.B \-q
should be the default.
.SH "SEE ALSO"
netrm(\*s), netq(\*s), netlog(\*s), netcp(\*s),
netlpr(\*s), netmail(\*s), netlogin(\*s), mail(\*o)
.br
``An Introduction to the Berkeley Network", by Eric Schmidt
E 1
