abs0/4.3BSD-Quasijarus/old/man/SCCS/s.netq.1
h38216
s 00001/00001/00060
d D 6.1 85/04/29 19:23:35 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00060
d D 5.1 85/04/29 19:23:09 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00061/00000/00000
d D 4.1 85/04/29 19:22:51 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH NETQ 1 2/6/80
E 2
I 2
D 3
.TH NETQ 1 "6 February 1980"
E 3
I 3
.TH NETQ 1 "%G%"
E 3
E 2
.UC 4
.ds s 1
.ds o 1
.SH NAME
netq \- print contents of network queue
.SH SYNOPSIS
.B netq
[
.B \-a
] [ machine ]
.SH DESCRIPTION
.I Netq
lists the contents of the network queue,
one request per line, for each directly-connected machine.
For each request, it shows the login name and machine of the originator,
the destination machine and login name,
and the length (in bytes) of the request
(this will be larger than any files transferred (e.g. by
.I netcp),
because of header information).
Also described are the queue filename which may be used
as an argument to
.IR netrm (\*s),
the time entered the queue, and the command being sent.
.PP
.I Netq
summarizes requests by other users.
If the 
.B \-a
option is specified, requests from all users are listed.
.PP
If a
.I machine
is specified, only the queue for that directly-connected machine is listed.
.PP
The requests are listed in the order they will be sent;
the queue for each machine is totally independent from the
other machine's queues.
.SH AUTHOR
Eric Schmidt
.SH FILES
.ta 2.5i
/usr/spool/berknet/send?	the directories where the queues are
.br
/usr/spool/berknet/logfile	the log
.SH "SEE ALSO"
net(\*s), netrm(\*s), netlog(\*s), netcp(\*s),
netlpr(\*s), netmail(\*s), netlogin(\*s), mail(\*o)
.SH BUGS
.I Netq
should also list files in net queues on intermediate machines.
.br
The commands are sent shortest-job first.
There is no way to delay a shorter, earlier request.
E 1
