abs0/4.3BSD-Quasijarus/old/man/SCCS/s.old.8
h07254
s 00063/00000/00000
d D 4.1 85/04/27 13:37:29 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH OLD 8 "4/1/81"
.UC 4
.SH NAME
old \- directory of old programs
.SH SYNOPSIS
.B /usr/old/bin
.br
.B /usr/old/include
.br
.B /usr/old/lib
.sp
.B /usr/old/cc \-I/usr/old/include
\&...
.SH DESCRIPTION
After the 3rd Berkeley Distribution,
the formats for binary and archive files were changed.
The binaries were modified to allow arbitrary length symbols,
which required adding a string table
at the end of the symbol table,
and having symbol table entries point into the names in that table.
The archive was modified to be a portable format,
using strings instead of binary numbers,
to avoid problems of different sizes of integers
on different machines.
These changes are incompatible with
older formats.
.PP
.B /usr/old
is the root of a hierarchy of
binaries,
include files,
and libraries
in the old
binary and archive formats.
They contain a complete set of programs and files
necessary for people
who need to deal
with the original \s-2UNIX\s+2
formats.
.PP
In order to create new binaries in the old format,
one must include the right header files.
For example,
to create a program called \*(lqfoo\*(rq
which uses the old math library
in the old format,
say
.br
.IP
.B /usr/old/cc \-I/usr/old/include
[ 
.I flags
] foo.c
.B \-lm
.SH "SEE ALSO"
arcv(8), ar(1), cc(1), a.out(5), ar(5)
.SH BUGS
E 1
