abs0/4.3BSD-Quasijarus/old/man/SCCS/s.prmail.1
h16574
s 00001/00001/00021
d D 6.1 85/04/29 14:55:09 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00003/00006/00019
d D 5.1 85/04/29 14:54:58 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00025/00000/00000
d D 4.1 85/04/29 14:54:49 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH PRMAIL 1 2/24/79
E 2
I 2
D 3
.TH PRMAIL 1 "24 February 1979"
E 3
I 3
.TH PRMAIL 1 "%Q%"
E 3
E 2
.UC 4
.SH NAME
prmail \- print out mail in the post office
.SH SYNOPSIS
.B prmail
[ user ... ]
.SH DESCRIPTION
.I Prmail
D 2
prints the mail which waits for you,
or the specified user,
in the post office.
The mail is not disturbed.
E 2
I 2
prints the mail which waits for you, or the specified user,
in the post office.  The mail is not disturbed.
E 2
.SH FILES
.DT
/usr/spool/mail/*	post office
.SH SEE ALSO
biff(1), mail(1), from(1), binmail(1)
D 2
.SH BUGS
E 2
E 1
