abs0/4.3BSD-Quasijarus/old/man/SCCS/s.ttytype.5
h28943
s 00001/00001/00028
d D 6.1 85/05/15 18:40:39 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00028
d D 5.1 85/05/15 18:40:07 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00029/00000/00000
d D 4.1 85/05/15 18:39:50 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH TTYTYPE 5 10/25/79
E 2
I 2
D 3
.TH TTYTYPE 5 "25 October 1979"
E 3
I 3
.TH TTYTYPE 5 "%Q%"
E 3
E 2
.UC 4
.SH NAME
ttytype \- data base of terminal types by port
.SH SYNOPSIS
/etc/ttytype
.SH DESCRIPTION
.I Ttytype
is a database containing, for each tty port on the system,
the kind of terminal that is attached to it.
There is one line per port,
containing the terminal kind (as a name listed in termcap (5)),
a space, and the name of the tty, minus /dev/.
.PP
This information is read by
.IR tset (1)
and by
.IR login (1)
to initialize the TERM variable at login time.
.SH "SEE ALSO"
tset(1), login(1)
.SH BUGS
Some lines are merely known as \*(lqdialup\*(rq or \*(lqplugboard\*(rq.
E 1
