abs0/4.3BSD-Quasijarus/man/man8/tahoe/SCCS/s.dlmpcc.8
h08217
s 00006/00000/00044
d D 6.2 88/05/04 15:49:17 bostic 2 1
c update from Keith Muller
e
s 00044/00000/00000
d D 6.1 87/05/01 19:21:19 mckusick 1 0
c from CCI
e
u
U
t
T
I 1
.\" Copyright (c) 1987 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH DLMPCC 8 "%Q%"
.UC 7
.SH NAME
dlmpcc \- download MPCC
.SH SYNOPSIS
\fBdlmpcc\fR  [ n ]
.SH DESCRIPTION
\fIDlmpcc\fR downloads CCI's Multi-Protocol
Communication Controller (MPCC).
The controller provides high-speed
synchronous communications for the \s-1POWER 5\s+1 and \s-1POWER 6\s+1 families of computers.
This utility allows you to 
download any or all of the MPCC boards.
The configuration file \fBmpcctab\fR determines
the protocol attributes for each MPCC board. See
\fImpcctab\fR(4) for details. 
.LP
If you specify the command with no argument, then \fIdlmpcc\fR
scans the configuration file and downloads all configured boards
with corresponding protocol software. The 
option \fIn\fR allows you to specify one or
more MPCC boards for downloading. The valid values range from
\fB0-15\fR. For example, the following command line orders \fIdlmpcc\fR
to download only the protocol software identified with board 2:
.nf

        dlmpcc  2

.fi
The next command line orders the download
of the protocols identified with
boards 0 and 3: 
.nf

        dlmpcc  0  3
.fi 
I 2
.LP
Typically, this download function is performed at boot time from the
/etc/rc.local file with an entry similar to:
.nf
        /etc/dlmpcc > /dev/console 2>&1
.fi
E 2
.SH SEE ALSO
mpcctab(4)
E 1
