abs0/4.3BSD-Quasijarus/man/man1/hostname.1
.\" Copyright (c) 1983, 1988 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"	@(#)hostname.1	6.4 (Berkeley) 10/21/04
.\"
.TH HOSTNAME 1 "October 21, 2004"
.UC 5
.SH NAME
hostname \- set or print name of current host system
.SH SYNOPSIS
\fBhostname\fP [-s] [nameofhost]
.SH DESCRIPTION
\fIHostname\fP prints the name of the current host.  The super-user can
set the hostname by supplying an argument; this is usually done in the
network initialization script \fI/etc/netstart\fP, normally run at boot
time.  The \fI-s\fP option trims any domain information from the printed
name.
.SH SEE ALSO
gethostname(2), sethostname(2)
