abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.adduser.8
h60810
s 00004/00003/00093
d D 6.4 87/10/01 13:40:14 bostic 6 5
c '-' may not start login name; bug report 4.3BSD/bin/85
e
s 00004/00004/00092
d D 6.3 87/04/13 11:34:53 bostic 5 4
c bug report 4.2BSD/man/25
e
s 00013/00010/00083
d D 6.2 86/05/23 11:29:46 mckusick 4 3
c update for 4.3BSD
e
s 00000/00000/00093
d D 6.1 85/04/27 12:34:17 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00000/00000/00093
d D 5.1 85/04/27 12:33:55 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00093/00000/00000
d D 4.1 85/04/27 12:33:34 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH ADDUSER 8 "%Q%"
.UC 4
.SH NAME
adduser \- procedure for adding new users
.SH DESCRIPTION
A new user must choose a login name, which must not already appear in
D 5
.I /etc/passwd.
An account can be added by editing a line into the passwd file; this must
be done with the password file locked e.g. by using
E 5
I 5
D 6
\fI/etc/passwd\fP or \fI/usr/lib/aliases\fP.  An account can be added
by editing a line into the passwd file; this must be done with the
password file locked e.g. by using
E 6
I 6
\fI/etc/passwd\fP or \fI/usr/lib/aliases\fP.  It must also not begin with
the hyphen (``-'') character.  An account can be added by editing a line
into the passwd file; this must be done with the password file locked
e.g. by using
E 6
E 5
.IR vipw (8).
.PP
A new user is given a group and user id.
User id's should be distinct across a system, since they
are used to control access to files.
Typically, users working on
similar projects will be put in the same group.  Thus at UCB we have
groups for system staff, faculty, graduate students, and a few special
groups for large projects.  System staff is group \*(lq10\*(rq for historical
reasons, and the super-user is in this group.
.PP
A skeletal account for a new user \*(lqernie\*(rq would look like:
.IP
ernie::235:20:& Kovacs,508E,7925,6428202:/mnt/grad/ernie:/bin/csh
.PP
The first field is the login name \*(lqernie\*(rq.  The next field is the
encrypted password which is not given and must be initialized using
.IR passwd (1).
The next two fields are the user and group id's.
Traditionally, users in group 20 are graduate students and have account
names with numbers in the 200's.
The next field gives information about ernie's real name, office and office
phone and home phone.
This information is used by the
.IR finger (1)
program.
From this information we can tell that ernie's real name is
\*(lqErnie Kovacs\*(rq (the & here serves to repeat \*(lqernie\*(rq
with appropriate capitalization), that his office is 508 Evans Hall,
his extension is x2-7925, and this his home phone number is 642-8202.
You can modify the
.IR finger (1)
program if necessary to allow different information to be encoded in
this field.  The UCB version of finger knows several things particular
to Berkeley \- that phone extensions start \*(lq2\-\*(rq, that offices ending
in \*(lqE\*(rq are in Evans Hall and that offices ending in \*(lqC\*(rq are
D 4
in Cory Hall.
E 4
I 4
in Cory Hall. The 
.IR chfn (1)
program allows users to change this information.
E 4
.PP
The final two fields give a login directory and a login shell name.
D 4
Traditionally, user files live on a file system which has the machines
single letter
.IR net (1)
address as the first of two characters.  Thus on the Berkeley CS Department
VAX, whose Berknet address is ``csvax'' abbreviated ``v'' the user file
systems are mounted on ``/va'', ``/vb'', etc.
On each such filesystem there are subdirectories there for each group
of users, i.e.: \*(lq/va/staff\*(rq and \*(lq/vb/prof\*(rq.
E 4
I 4
Traditionally, user files live on a file system different from /usr.
Typically the user file systems are mounted on a directories in the root
named sequentially starting from from the beginning of the alphabet,
eg /a, /b, /c, etc.
On each such file system there are subdirectories there for each group
of users, i.e.: \*(lq/a/staff\*(rq and \*(lq/b/prof\*(rq.
E 4
This is not strictly necessary but keeps the number of files in the
top level directories reasonably small.
.PP
The login shell will default to \*(lq/bin/sh\*(rq if none is given.
Most users at Berkeley choose \*(lq/bin/csh\*(rq so this is usually
D 4
specified here.
E 4
I 4
specified here. The 
.IR chsh (1)
program allows users to change their login shell to one of the
shells in the approved list given in /etc/shells.
E 4
.PP
It is useful to give new users some help in getting started, supplying
them with a few skeletal files such as
.I \&.profile
if they use \*(lq/bin/sh\*(rq, or
.I \&.cshrc
and
.I \&.login
if they use \*(lq/bin/csh\*(rq.
The directory
\*(lq/usr/skel\*(rq contains skeletal definitions of such files.
New users should be given copies of these files which, for instance,
arrange to use
.IR tset (1)
automatically at each login.
.SH FILES
.ta 2i
/etc/passwd	password file
.br
/usr/skel	skeletal login directory
.SH SEE ALSO
D 5
passwd(1), finger(1), chsh(1), chfn(1), passwd(5), vipw(8)
E 5
I 5
passwd(1), finger(1), chsh(1), chfn(1), aliases(5), passwd(5), vipw(8)
E 5
.SH BUGS
User information should be stored in its own data base separate from
the password file.
E 1
