abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.bugfiler.8
h20869
s 00007/00002/00143
d D 6.8 87/11/23 11:00:12 bostic 12 11
c add special redist label ``all:''
e
s 00008/00009/00137
d D 6.7 87/11/18 11:39:24 bostic 11 10
c move bug:ack file into version directory
e
s 00005/00004/00141
d D 6.6 87/07/20 13:03:46 bostic 10 8
c document need for bug:lock file on setup
e
s 00002/00002/00143
d R 6.6 87/04/23 14:20:34 bostic 9 8
c Status field is now Comment field
e
s 00070/00065/00075
d D 6.5 87/04/11 15:59:30 bostic 8 7
c version #2, -v flag, remove home_dir, redist per folder
e
s 00003/00002/00137
d D 6.4 87/01/28 21:39:11 bostic 7 5
c added date field to summary format
e
s 00002/00002/00137
d R 6.4 87/01/28 12:03:28 bostic 6 5
c Status field now Comment field
e
s 00100/00065/00039
d D 6.3 86/12/02 12:15:57 bostic 5 3
c rewrite
e
s 00102/00067/00037
d R 6.3 86/12/02 12:14:44 bostic 4 3
c rewrite
e
s 00019/00005/00085
d D 6.2 86/05/20 19:00:40 karels 3 2
c redist
e
s 00001/00001/00089
d D 6.1 85/04/27 14:52:29 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00090/00000/00000
d D 5.1 85/04/27 14:52:11 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH BUGFILER 8 "18 July 1983"
E 2
I 2
.TH BUGFILER 8 "%Q%"
E 2
.UC 5
.SH NAME
bugfiler \- file bug reports in folders automatically
.SH SYNOPSIS
.B bugfiler
D 5
[ mail directory ]
E 5
I 5
D 8
[ -ar ] [ home_dir ]
E 8
I 8
[ -ar ] [-v version]
E 8
E 5
.SH DESCRIPTION
D 5
.I Bugfiler
is a program to automatically intercept bug reports, summarize them and
store them in the appropriate sub directories of the mail directory
specified on the command line or the (system dependent) default.
It is designed to be compatible with the Rand MH mail system.
.I Bugfiler
is normally invoked by the mail delivery program through
.IR aliases (5)
with a line such as the following in /usr/lib/aliases.
E 5
I 5
\fIBugfiler\fP is a program to automatically intercept, acknowledge,
redistribute and store bug reports.  \fIBugfiler\fP is normally invoked
by the mail delivery program with a line similar to the following in
/usr/lib/aliases.
E 5
.PP
.DT
D 5
	bugs:"|bugfiler /usr/bugs/mail"
E 5
I 5
D 8
	bugs:	"|bugfiler /usr/bugs/mail"
E 8
I 8
	bugs:	"|bugfiler"
E 8
.br
E 5
.PP
D 5
It reads the message from the standard input or the named file, checks
the format and returns mail acknowledging receipt or a message 
indicating the proper format.  Valid reports are then summarized and
D 3
filed in the appropriate folder.  Users can then log onto the system and
E 3
I 3
filed in the appropriate folder; improperly formatted messages
are filed in a folder named ``errors.''
Program maintainers can then log onto the system and
E 3
check the summary file for bugs that pertain to them.
D 3
Bug reports are submitted in RFC822 format and
must contain the following header lines:
E 3
I 3
Bug reports should be submitted in RFC822 format and
aremust contain the following header lines to be properly indexed:
E 5
I 5
D 8
All file paths in this man page that use \fIhome_dir\fP reference
the optional \fIhome_dir\fP argument, or, if that is not supplied, the
home directory of the login "bugs".  In either case, the login "bugs"
must exist, as \fIbugfiler\fP expects its files and directories to
be owned by "bugs".
E 8
I 8
It should be noted that the login ``bugs'' must exist for the bugfiler
to run.  Unless otherwise noted all paths used by \fIbugfiler\fP are
relative to the home directory of this login.  \fIBugfiler\fP also
expects all of its files and directories to be owned by ``bugs''.
E 8
E 5
E 3
.PP
I 5
D 11
A mail acknowledgement is automatically sent to the bug report filer
D 8
unless the \fB-a\fP flag is supplied.  If the file \fIhome_dir\fP/.ack
exists, it is appended to this acknowledgement.
E 8
I 8
unless the \fB-a\fP flag is supplied.  The file ~bugs/bug:ack is appended
to this acknowledgement.
E 8
.PP
E 11
For the bug report to be correctly filed, it must contain a line
in the following format:
.PP
E 5
.DT
D 5
	Date: <date the report is received>
E 5
I 5
D 8
	Index:	\fIfolder\fP	\fIsystem\fP
E 8
I 8
	Index:	\fIfolder\fP	\fIversion\fP
E 8
E 5
.br
D 5
	From: <valid return address>
E 5
I 5
.PP
D 8
The directories \fIhome_dir\fP/system and \fIhome_dir\fP/system/folder
E 8
I 8
The directories ~bugs/\fIversion\fP and ~bugs/\fIversion\fP/\fIfolder\fP
E 8
must exist before \fIbugfiler\fP attempts to store the bug report.  Bug
D 8
reports will be stored in files named by the concatenation of
\fIsystem, folder,\fP and sequential numbers, e.g., if \fIsystem\fP
is "4.3BSD" and \fIfolder\fP is "ucb" the first bug report will
be placed in \fIhome_dir\fP/4.3BSD/ucb/1.  To maintain backward
compatibility, if \fIfolder\fP contains more than one component only
the first one will be used, e.g. if \fIfolder\fP is "bin/from.c" or
"bin/adb/con.c" it will be treated as if it were just "bin".
E 8
I 8
reports will be stored in files named by the concatenation of \fIversion,
folder,\fP and sequential numbers, i.e. if \fIversion\fP is ``4.3BSD'' and
\fIfolder\fP is ``ucb'' the first bug report will be placed in
~bugs/4.3BSD/ucb/1.  If \fIfolder\fP contains more than one component only
the first one will be used, e.g. if \fIfolder\fP is ``bin/from.c'' or
``bin/adb/con.c'' it will be treated as if it were simply ``bin''.  The
\fI-v\fP flag is provided as a means to override the \fIversion\fP
provided within the bug report itself.
E 8
.PP
I 11
A mail acknowledgement is automatically sent to the bug report filer unless
the \fB-a\fP flag is supplied.  The file ~bugs/\fIversion\fP/bug:ack is
appended to this acknowledgement.
.PP
E 11
If the \fB-r\fP flag is not supplied, redistribution of the bug reports
D 8
is done as specified in the file \fIhome_dir\fP/.redist.  This file is
in the format of the
E 8
I 8
is done as specified in the file ~bugs/\fIversion\fP/bug:redist.  This file
D 11
is in the format of the
E 8
.IR aliases (5)
file, including comments and entries requiring multiple lines, with
D 8
the single exception that the \fIfolder\fP component of the "Index:"
line replaces the name to alias.  For example, the \fI.redist\fP file
E 8
I 8
the single exception that the \fIfolder\fP component of the ``Index:''
line replaces the name to alias.  For example, the \fIbug:redist\fP file
E 11
I 11
is in the format of the \fIaliases\fP(5) file, including comments and
entries requiring multiple lines, with the single exception that the
\fIfolder\fP component of the ``Index:'' line replaces the name to alias.
D 12
For example, the \fIbug:redist\fP file
E 12
I 12
The special folder ``all:'' receives a redistribution of all bug reports
sent to this \fIversion\fP.  For example, the \fIbug:redist\fP file
E 12
E 11
E 8
.PP
.DT
I 12
	#	bigbug gets a copy of everything
.br
	all:	bigbug
.br
E 12
	#	ucb folder redistribution list
E 5
.br
D 5
	Subject: <short summary of the problem>
E 5
I 5
	ucb:	karels, kjd@coke.berkeley.edu
E 5
.br
D 5
	Index: <source directory>/<source file> <version> [Fix]
E 5
I 5
		ra@beno.css.gov
.br
E 5
.PP
D 5
In addition, the body of the message must contain a line which
begins with ``Description:'' followed by zero or more lines describing the
problem in detail and a line beginning with ``Repeat-By:'' followed by zero or
more lines describing how to repeat the problem.
If the keyword `Fix' is specified in the `Index' line, then there must
also be a line beginning with ``Fix:'' followed by a diff of the old and new
source files or a description of what was done to fix the problem.
E 5
I 5
D 8
will send copies of all bug reports with "ucb" as the \fIfolder\fP
to the logins karels, kjd, and ra.
E 8
I 8
will send copies of all bug reports with ``ucb'' as the \fIfolder\fP
D 12
to karels, kjd, and ra.
E 12
I 12
to bigbug, karels, kjd, and ra.
E 12
E 8
E 5
.PP
D 5
The `Index' line is the key to the filing mechanism. The source directory
name must match one of the folder names in the mail directory.
The message is then filed in this folder
and a line appended to the summary file in the following format:
E 5
I 5
D 8
Reports that cannot be filed due to an invalid "Index:" line are placed
in the directory \fIhome_dir\fP/errors.  The \fIbugfiler\fP maintainer
should correct these bug reports and then run \fIbugfiler\fP, with the
corrected report as its standard input, as bug reports with errors are
neither acknowledged or redistributed.  All reports that \fIbugfiler\fP
handles are logged in \fIhome_dir\fP/log.
E 8
I 8
Reports that cannot be filed, due to an invalid ``Index:'' line or
some other error, are placed in the directory ~bugs/errors.  The
\fIbugfiler\fP maintainer should correct these bug reports and then
run \fIbugfiler\fP, with the corrected report as its standard input,
as bug reports with errors are neither acknowledged or redistributed.
All reports that \fIbugfiler\fP handles are logged in ~bugs/log.
E 8
E 5
.PP
I 5
D 8
Valid reports are also entered in the file
\fIhome_dir/folder\fP/summary.  This file has an entry for each bug
report in the \fIfolder\fP in the format:
E 8
I 8
Valid bugs are also logged in the file ~bugs/\fIversion\fP/summary.
This file has an entry for each bug report for \fIversion\fP in the
format:
E 8
.PP
E 5
.DT
D 5
	<folder name>/<message number>	<Index info>
E 5
I 5
D 7
	Filename
E 7
I 7
	Filename		Date
E 7
E 5
.br
D 5
						<Subject info>
E 5
I 5
		Subject:
.br
		Index:
.br
		Owner:	Bugs Bunny
.br
		Status:	Received
.br
E 5
I 3
.PP
D 5
The bug report may also be redistributed according to the index.
If the file
.IR maildir /.redist
exists, it is examined for a line beginning with the index name
followed with a tab.
The remainder of this line contains a comma-separated list of mail addresses
which should receive copies of bugs with this index.
The list may be continued onto multiple lines by ending each but the last
with a backslash (`\e').
E 5
I 5
D 8
"Filename" is the concatenation of \fIsystem, folder,\fP and a number as
D 7
described above.  The "Subject:" and "Index:" lines are copies of the
E 7
I 7
described above.  "Date" is the date as reported by the system clock, using
ctime(3).  The "Subject:" and "Index:" lines are copies of the
E 7
"Subject:" and "Index:" lines contained in the bug report.  The "Owner"
and "Status" fields are intended to provide a rudimentary method of
tracking the status of bug reports.
E 8
I 8
\fIFilename\fP is the concatenation of \fIversion, folder,\fP and a number
as described above.  \fIDate\fP is the date as reported by the system
clock, using ctime(3).  The \fISubject:\fP and \fIIndex:\fP lines are
copies of the ``Subject:'' and ``Index:'' lines contained in the bug
report.  The \fIOwner\fP and \fIStatus\fP fields are intended to provide a
rudimentary method of tracking the status of bug reports.
E 8
.PP
D 8
The file \fIhome_dir\fP/bug:lock is the focus of all locking for
\fIbugfiler.\fP  If you wish to manipulate any of the log or error
files, remove it and \fIbugfiler\fP will treat all bug reports that
it receives as if they were incorrectly formatted and place them
in the directory \fIhome_dir\fP/errors, where they can be recovered by
the \fIbugfiler\fP maintainer.
E 8
I 8
The file ~bugs/bug:lock is the focus of all locking for \fIbugfiler.\fP
D 10
If you wish to manipulate any of the log or error files, remove it and
\fIbugfiler\fP will treat all bug reports that it receives as if they were
incorrectly formatted, i.e. it will place them in the directory ~bugs/errors,
where they should recovered by the \fIbugfiler\fP maintainer.
E 10
I 10
If you wish to manipulate any of the log or error files, rename or remove
it and \fIbugfiler\fP will treat all bug reports that it receives as if
they were incorrectly formatted, i.e. it will place them in the directory
~bugs/errors, for later recovery by the \fIbugfiler\fP maintainer.
Obviously, this file must be created when you first install \fIbugfiler\fP.
E 10
E 8
.PP
D 8
All errors that occur before \fIhome_dir\fP/log is found are logged
into the system log file, using
E 8
I 8
All errors that occur before ~bugs/log is found are logged into the system
log file, using
E 8
.IR syslog (8).
E 5
E 3
.SH FILES
D 5
.ta 2.5i
D 3
/usr/new/lib/mh/deliver	mail delivery program
E 3
I 3
/usr/lib/sendmail	mail delivery program
E 5
I 5
D 8
.ta 3.0i
home_dir/.ack			the message sent in acknowledgement
E 8
E 5
E 3
.br
D 3
/usr/new/lib/mh/unixtomh	converts unix mail format to mh format
E 3
I 3
D 5
/usr/lib/unixtomh	converts unix mail format to mh format
E 5
I 5
D 8
home_dir/.redist		the redistribution list
E 5
E 3
.br
D 5
maildir/.ack	the message sent in acknowledgement
E 5
I 5
home_dir/bug:lock		the locking file
E 5
.br
D 5
maildir/.format	the message sent when format errors are detected
E 5
I 5
home_dir/errors/BUG_??????	bug reports with format errors
E 5
I 3
.br
D 5
maildir/.redist	the redistribution list
E 5
I 5
home_dir/log			the log file
E 5
E 3
.br
D 5
maildir/summary	the summary file
E 5
I 5
home_dir/folder/summary		the summary files
E 5
.br
D 5
maildir/Bf??????	temporary copy of the input message
E 5
I 5
/usr/lib/sendmail		the mail delivery program
E 5
.br
D 5
maildir/Rp??????	temporary file for the reply message.
E 5
I 5
/usr/lib/bugformat		a sample bug report format
E 8
I 8
.TP 25
~bugs/bug:ack
the acknowledgement message
.TP 25
~bugs/bug:redist
the redistribution list
.TP 25
~bugs/bug:lock
the locking file
.TP 25
~bugs/errors/BUG_??????
bug reports with format errors
.TP 25
~bugs/log
the log file
.TP 25
~bugs/folder/summary
the summary files
.TP 25
/usr/lib/sendmail
the mail delivery program
.TP 25
/usr/lib/bugformat
a sample bug report format
E 8
E 5
.SH "SEE ALSO"
D 5
mh(1),
newaliases(1),
aliases(5)
E 5
I 5
sendbug(1), aliases(5), syslog(8)
E 5
.SH BUGS
I 5
Since mail can be forwarded in a number of different ways, \fIbugfiler\fP
does not recognize forwarded mail and will acknowledge to the forwarder
instead of the original sender unless there is a `Reply-To' field in the
header.
E 5
D 8
.PP
D 5
Since mail can be forwarded in a number of different ways,
.I bugfiler
does not recognize forwarded mail and will reply/complain to the
forwarder instead of the original sender unless there is a `Reply-To'
field in the header.
E 5
I 5
Duplicate messages should be recognized and handled in some
reasonable fashion.
E 8
E 5
.PP
D 5
Duplicate messages should be discarded or recognized and put somewhere
else.
E 5
I 5
This version of the bugfiler is not compatible with the version
released with 4.3BSD in that it doesn't complain to the sender about
incorrectly formatted bug reports.
Frankly, we got tired of the profanity, not to mention the extended
conversations
.I bugfiler
was holding with
.IR vacation (1).
E 5
E 1
