abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.chown.8
h44965
s 00004/00009/00040
d D 6.3 88/04/21 11:15:19 bostic 5 4
c minor cleanups, clarify meaning of -f 
e
s 00002/00000/00047
d D 6.2 86/05/22 10:42:47 mckusick 4 3
c clarify that -R does not follow symbolic links
e
s 00013/00002/00034
d D 6.1 85/04/27 13:06:10 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00011/00017/00025
d D 5.1 85/04/27 13:05:46 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00042/00000/00000
d D 4.1 85/04/27 13:05:27 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH CHOWN 8 "4/3/81"
E 2
I 2
D 3
.TH CHOWN 8 "18 July 1983"
E 3
I 3
.TH CHOWN 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 2
chown, chgrp \- change owner or group
E 2
I 2
chown \- change owner
E 2
.SH SYNOPSIS
D 5
.B /etc/chown
E 5
I 5
.B chown
E 5
I 2
[
D 5
.B \-f
I 3
.B \-R
E 5
I 5
.B \-Rf
E 5
E 3
]
E 2
D 3
owner file ...
E 3
I 3
owner[.group] file ...
E 3
D 2
.PP
.B /etc/chgrp
group file ...
E 2
.SH DESCRIPTION
.I Chown
changes the owner of the
.I files
to
.IR owner .
The owner may be either a decimal UID or
a login name found in the password file.
I 3
An optional group may also be specified.
The group may be either a decimal GID or
a group name found in the group-ID file.
E 3
.PP
D 2
.I Chgrp
changes the group-ID of the
.I files
to
.IR group .
The group may be either a decimal GID or
a group name found in the group-ID file.
.PP
Only the super-user can change owner or group,
in order to simplify as yet unimplemented accounting procedures.
E 2
I 2
Only the super-user can change owner,
in order to simplify accounting procedures.
D 5
No errors are reported when the
E 5
I 5
No errors, except for usage errors, are reported when the
E 5
.B \-f
(force) option is given.
I 3
.PP
When the
.B \-R
option is given, 
.I chown
recursively descends its directory arguments
setting the specified owner.
I 4
When symbolic links are encountered, their ownership is changed,
but they are not traversed.
E 4
E 3
E 2
D 5
.SH FILES
/etc/passwd
E 5
D 2
.br
/etc/group
E 2
.SH "SEE ALSO"
I 2
D 5
chgrp(1),
E 2
chown(2),
passwd(5), group(5)
E 5
I 5
chgrp(1), chown(2)
E 5
E 1
