abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.comsat.8c
h52929
s 00009/00006/00042
d D 6.2 86/05/20 22:53:27 karels 3 2
c inetd, english
e
s 00001/00001/00047
d D 6.1 85/04/27 14:53:22 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00048/00000/00000
d D 5.1 85/04/27 14:52:44 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH COMSAT 8C "18 July 1983"
E 2
I 2
.TH COMSAT 8C "%Q%"
E 2
.UC 5
.SH NAME
comsat \- biff server
.SH SYNOPSIS
.B /etc/comsat
.SH DESCRIPTION
.I Comsat
D 3
is the server process which listens for reports of incoming mail
E 3
I 3
is the server process which receives reports of incoming mail
E 3
and notifies users if they have requested this service.
.I Comsat
D 3
listens on a datagram port associated with the ``biff'' service
E 3
I 3
receives messages on a datagram port associated with the ``biff'' service
E 3
specification (see
D 3
.IR services (5))
for one line messages of the form
E 3
I 3
.IR services (5)
and
.IR inetd (8)).
The one line messages are of the form
E 3
.PP
.ti +0.5i
user@mailbox-offset
.PP
If the
.I user
specified is logged in to the system and the associated terminal has
the owner execute bit turned on (by a ``biff y''), the
.I offset
is used as a seek offset into the appropriate mailbox file and
the first 7 lines or 560 characters of the message are printed
on the user's terminal.  Lines which appear to be part of
the message header other than the ``From'', ``To'', ``Date'',
or ``Subject'' lines are not included in the displayed message.
.SH FILES
.DT
/etc/utmp	to find out who's logged on and on what terminals
.SH "SEE ALSO"
D 3
biff(1)
E 3
I 3
biff(1), inetd(8)
E 3
.SH BUGS
The message header filtering is prone to error.
I 3
The density of the information presented is near the theoretical minimum.
E 3
.PP
Users should be notified of mail which arrives on other
D 3
machines than the one they are currently logged in to.
E 3
I 3
machines than the one to which they are currently logged in.
E 3
.PP
The notification should appear in a separate window so it
does not mess up the screen.
E 1
