abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.halt.8
h60178
s 00012/00001/00038
d D 6.2 86/05/24 22:58:41 karels 4 3
c new logging
e
s 00001/00001/00038
d D 6.1 85/04/27 13:28:53 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00038
d D 5.1 85/04/27 13:28:36 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00039/00000/00000
d D 4.1 85/04/27 13:28:21 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH HALT 8 5/11/81
E 2
I 2
D 3
.TH HALT 8 "11 May 1981"
E 3
I 3
.TH HALT 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
halt \- stop the processor
.SH SYNOPSIS
.B /etc/halt
[
.B \-n
]
[
.B \-q
]
[
.B \-y
]
.SH DESCRIPTION
.I Halt
writes out sandbagged information to the disks and then stops
the processor.  The machine does not reboot, even if the auto-reboot
switch is set on the console.
.PP
The
.B \-n
option prevents the sync before stopping.  The
.B \-q
option causes a quick halt, no graceful shutdown is attempted.  The
.B \-y
option is needed if you are trying to halt the system from a dialup.
I 4
.PP
.I Halt
normally logs the shutdown using
.IR syslog (8)
and places a shutdown record in the login accounting file
/usr/adm/wtmp.
These actions are inhibited if the
.B \-n
or
.B \-q
options are present.
E 4
.SH SEE ALSO
D 4
reboot(8), shutdown(8)
E 4
I 4
reboot(8), shutdown(8), syslogd(8)
E 4
.SH BUGS
It is very difficult to halt a VAX, as the machine wants to then
reboot itself.  A rather tight loop suffices.
E 1
