abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.makedev.8
h37325
s 00000/00004/00057
d D 6.2 86/05/19 19:45:04 karels 3 2
c not no more it ain't
e
s 00001/00001/00060
d D 6.1 85/04/27 15:35:11 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00061/00000/00000
d D 5.1 85/04/27 15:34:52 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH MAKEDEV 8 "18 July 1983"
E 2
I 2
.TH MAKEDEV 8 "%Q%"
E 2
.UC 5
.SH NAME
makedev \- make system special files
.SH SYNOPSIS
.B /dev/MAKEDEV 
.IR device ...
.SH DESCRIPTION
.I MAKEDEV
is a shell script normally used to install
special files.  It resides in the 
.I /dev
directory, as this is the normal location of special files.
Arguments to 
.I MAKEDEV
are usually of the form
.IR device-name ?
where
.I device-name
is one of the supported devices listed in section 4 of the
manual and ``?'' is a logical unit number (0-9).  A few
special arguments create assorted collections of devices and are
listed below.
.TP
.B std
Create the
.I standard
devices for the system; e.g. /dev/console, /dev/tty.
The VAX-11/780 console floppy device, /dev/floppy, and VAX-11/750
and VAX-11/730 console cassette device(s), /dev/tu?, are also
created with this entry.
.TP
.B local
Create those devices specific to the local site.  This
request causes the shell file 
.I /dev/MAKEDEV.local
to be executed.  Site specific commands, such as those
used to setup dialup lines as ``ttyd?'' should be included
in this file.
.PP
Since all devices are created using 
.IR mknod (8),
this shell script is useful only to the super-user.
.SH DIAGNOSTICS
Either self-explanatory, or generated by one of the programs
called from the script.  Use ``sh -x MAKEDEV'' in case of
trouble.
.SH "SEE ALSO"
intro(4),
config(8),
mknod(8)
D 3
.SH BUGS
When more than one piece of hardware of the same ``kind'' is
present on a machine (for instance, a dh and a dmf), naming
conflicts arise.
E 3
E 1
