abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.mknod.8
h36080
s 00001/00001/00044
d D 6.2 86/05/19 19:48:47 karels 4 3
c see also ...
e
s 00001/00001/00044
d D 6.1 85/04/27 13:35:03 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00044
d D 5.1 85/04/27 13:34:32 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00045/00000/00000
d D 4.1 85/04/27 13:34:15 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH MKNOD 8 "4/1/81"
E 2
I 2
D 3
.TH MKNOD 8  "4 February 1983"
E 3
I 3
.TH MKNOD 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
mknod \- build special file
.SH SYNOPSIS
.B /etc/mknod
name
[
.B c
] [
.B b
]
major
minor
.SH DESCRIPTION
.I Mknod
makes a special file.
The first argument is the
.I name
of the entry.
The second is
.B b
if the special file is block-type (disks, tape) or
.B c
if it is character-type (other devices).
The last two arguments are
numbers specifying the
.I major
device type
and the
.I minor
device (e.g. unit, drive, or line number).
.PP
The assignment of major device numbers is specific to each system.
They have to be dug out of the
system source file
.I conf.c.
.SH "SEE ALSO"
D 4
mknod(2)
E 4
I 4
mknod(2), makedev(8)
E 4
E 1
