abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.pstat.8
h04890
s 00023/00007/00360
d D 6.3 86/05/24 09:50:15 karels 5 4
c more updates
e
s 00042/00043/00325
d D 6.2 86/05/18 01:00:37 lepreau 4 3
c bring up to date with source. A couple descriptions maybe need fixing
e
s 00001/00001/00367
d D 6.1 85/04/27 13:39:51 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00047/00031/00321
d D 5.1 85/04/27 13:39:12 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00352/00000/00000
d D 4.1 85/04/27 13:38:48 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH PSTAT 8 4/1/81
E 2
I 2
D 3
.TH PSTAT 8 4/1/83
E 3
I 3
.TH PSTAT 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
pstat \- print system facts
.SH SYNOPSIS
.B /etc/pstat
D 2
[
E 2
.B \-aixptufT
D 2
] [ suboptions ]
[ file ]
E 2
I 2
[
.B suboptions
] [
.B system
] [
.B corefile
]
E 2
.SH DESCRIPTION
.I Pstat
interprets the contents of certain system tables.
If
D 2
.I file
E 2
I 2
.I corefile
E 2
is given, the tables are sought there, otherwise
in
.I /dev/kmem.
The required namelist is taken from
D 2
.I /vmunix.
E 2
I 2
.I /vmunix
unless 
.I system
is specified.
E 2
Options are
.TP \w'WCHAN\ 'u
.B \-a
Under
.BR \-p ,
describe all process slots rather than just active ones.
.TP
.B \-i
Print the inode table with the these headings:
.IP LOC
The core location of this table entry.
.PD 0
.IP FLAGS
Miscellaneous state variables encoded thus:
.RS
.IP L
locked
.IP U
update time
D 2
.IR (filsys (5))
E 2
I 2
.RI ( fs (5))
E 2
must be corrected
.IP A
access time must be corrected
.IP M
file system is mounted here
.IP W
wanted by another process (L flag is on)
.IP T
contains a text file
.IP C
changed time must be corrected
I 2
.IP S
shared lock applied
.IP E
exclusive lock applied
.IP Z
D 5
someone waiting for an exclusive lock
E 5
I 5
someone waiting for a lock
E 5
E 2
.RE
.IP CNT
Number of open file table entries for this inode.
.IP DEV
Major and minor device number of file system in which
this inode resides.
I 2
.IP RDC
Reference count of shared locks on the inode.
.IP WRC
Reference count of exclusive locks on the inode (this may
be > 1 if, for example, a file descriptor is inherited across a fork).
E 2
.IP INO
I-number within the device.
.IP MODE
Mode bits, see
.IR chmod (2).
.IP NLK
Number of links to this inode.
.IP UID
User ID of owner.
.IP SIZ/DEV
Number of bytes in an ordinary file, or
major and minor device of special file.
.PD
.TP
.B \-x
Print the text table with these headings:
.IP LOC
The core location of this table entry.
.PD 0
.IP FLAGS
Miscellaneous state variables encoded thus:
.RS
.IP T
.IR ptrace (2)
in effect
.IP W
text not yet written on swap device
.IP L
loading in progress
.IP K
locked
.IP w
wanted (L flag is on)
.IP P
resulted from demand-page-from-inode exec format (see
D 2
.IR exec (2))
E 2
I 2
.IR execve (2))
E 2
.RE
.PD
.IP DADDR
Disk address in swap, measured in multiples of 512 bytes.
.IP CADDR
Head of a linked list of loaded processes using this text segment.
I 4
.IP RSS
Size of resident text, measured in multiples of 512 bytes.
E 4
.IP SIZE
Size of text segment, measured in multiples of 512 bytes.
.IP IPTR
Core location of corresponding inode.
.IP CNT
Number of processes using this text segment.
.IP CCNT
Number of processes in core using this text segment.
I 4
.IP FORW
Forward link in free list.
.IP BACK
Backward link in free list.
E 4
.PD
.TP
.B \-p
Print process table for active processes with these headings:
.IP LOC
The core location of this table entry.
.PD 0
.IP S
Run state encoded thus:
.RS
.IP 0
no process
.IP 1
waiting for some event
.IP 3
runnable
.IP 4
being created
.IP 5
being terminated
.IP 6
D 5
stopped under trace
E 5
I 5
stopped (by signal or  under trace)
E 5
.RE
.IP F
D 5
Miscellaneous state variables, or-ed together (hexadecimal):
E 5
I 5
Miscellaneous state variables, or'ed together (hexadecimal):
E 5
.RS
D 4
.IP 000001 9n
E 4
I 4
.IP 0001 9n
E 4
loaded
D 4
.IP 000002
E 4
I 4
.IP 0002
E 4
the scheduler process
D 4
.IP 000004
E 4
I 4
.IP 0004
E 4
locked for swap out
D 4
.IP 000008
E 4
I 4
.IP 0008
E 4
swapped out
D 4
.IP 000010
E 4
I 4
.IP 0010
E 4
traced
D 4
.IP 000020
E 4
I 4
.IP 0020
E 4
used in tracing
D 2
.IP 000040
locked in by
.IR lock (2).
E 2
I 2
.	\".IP 000040
.	\"locked in by
.	\".IR lock (2).
E 2
D 4
.IP 000080
E 4
I 4
.IP 0080
E 4
in page-wait
D 4
.IP 000100
E 4
I 4
.IP 0100
E 4
prevented from swapping during
.IR fork (2)
D 4
.IP 000200
gathering pages for raw i/o
.IP 000400
E 4
I 4
.IP 0200
will restore old mask after taking signal
.IP 0400
E 4
exiting
D 4
.IP 001000
E 4
I 4
.IP 0800
D 5
doing physical i/o (bio.c)
E 5
I 5
doing physical I/O (bio.c)
E 5
.IP 1000
E 4
process resulted from a
.IR vfork (2)
which is not yet complete
D 4
.IP 002000
E 4
I 4
.IP 2000
E 4
another flag for
.IR vfork (2)
D 4
.IP 004000
E 4
I 4
.IP 4000
E 4
process has no virtual memory, as it is a parent in the context of
.IR vfork (2)
D 4
.IP 008000
E 4
I 4
.IP 8000
E 4
process is demand paging data pages from its text inode.
I 5
.IP 10000
process using sequential VM patterns
.IP 20000
process using random VM patterns
.IP 100000
using old 4.1-compatible signal semantics
.IP 200000
process needs profiling tick
.IP 400000
process is scanning descriptors during select
.IP 1000000
process page tables have changed
E 5
D 4
.IP 010000
process has advised of anomalous behavior with
.IR vadvise (2).
.IP 020000
process has advised of sequential behavior with
.IR vadvise (2).
.IP 040000
process is in a sleep which will timeout.
.IP 080000
a parent of this process has exited and this process
is now considered detached.
.IP 100000
D 2
process used some new signal primitives, i.e.
.IR sigset (3);
more system calls will restart.
E 2
I 2
process used 4.1BSD compatibility mode signal primitives,
no system calls will restart.
E 2
.IP 200000
process is owed a profiling tick.
E 4
.RE
.IP POIP
number of pages currently being pushed out from this process.
.IP PRI
Scheduling priority, see
D 2
.IR nice (2).
E 2
I 2
.IR setpriority (2).
E 2
D 4
.IP SIGNAL
E 4
I 4
.IP SIG
E 4
Signals received (signals 1-32 coded in bits 0-31),
.IP UID
Real user ID.
.IP SLP
Amount of time process has been blocked.
.IP TIM
Time resident in seconds; times over 127 coded as 127.
.IP CPU
Weighted integral of CPU time, for scheduler.
.IP NI
Nice level,
see
D 2
.IR nice (2).
E 2
I 2
.IR setpriority (2).
E 2
.IP PGRP
D 5
Process number of root of process group
(the opener of the controlling terminal).
E 5
I 5
Process number of root of process group.
E 5
.IP PID
The process ID number.
.IP PPID
The process ID of parent process.
.IP ADDR
If in core, the page frame number of the first page of the `u-area' of
the process.
If swapped out, the position in the swap area
measured in multiples of 512 bytes.
.IP RSS
Resident set size \- the number of physical page frames allocated
to this process.
.IP SRSS
RSS at last swap (0 if never swapped).
.IP SIZE
Virtual size of process image (data+stack) in multiples of 512 bytes.
.IP WCHAN
Wait channel number of a waiting process.
.IP LINK
Link pointer in list of runnable processes.
.IP TEXTP
If text is pure, pointer to location of text table entry.
D 4
.IP CLKT
D 2
Countdown for
.IR alarm (2)
measured in seconds.
E 2
I 2
Countdown for real interval timer,
.IR setitimer (2)
measured in clock ticks (10 milliseconds).
E 4
E 2
.PD
.TP
.B \-t
Print table for terminals
with these headings:
.IP RAW
Number of characters in raw input queue.
.PD 0
.IP CAN
Number of characters in canonicalized input queue.
.IP OUT
Number of characters in putput queue.
.IP MODE
See
.IR tty (4).
.IP ADDR
Physical device address.
.IP DEL
Number of delimiters (newlines) in canonicalized input queue.
.IP COL
Calculated column position of terminal.
.IP STATE
Miscellaneous state variables encoded thus:
.RS
I 4
.IP T
delay timeout in progress
E 4
.IP W
waiting for open to complete
.IP O
open
D 4
.IP S
has special (output) start routine
E 4
I 4
.IP F
outq has been flushed during DMA
E 4
.IP C
carrier is on
.IP B
busy doing output
.IP A
process is awaiting output
.IP X
open for exclusive use
I 4
.IP S
output stopped
E 4
.IP H
hangup on close
.RE
.IP PGRP
Process group for which this is controlling terminal.
.IP DISC
Line discipline; blank is old tty OTTYDISC or ``new tty'' for NTTYDISC
or ``net'' for NETLDISC (see
.IR bk (4)).
.PD
.TP
.B \-u
print information about a user process;
the next argument is its address as given
by
.IR ps (1).
The process must be in main memory, or the file used can
be a core image and the address 0.
I 5
Only the fields located in the first page cluster can be located
succesfully if the process is in main memory.
E 5
.TP
.B \-f
Print the open file table with these headings:
.IP LOC
The core location of this table entry.
I 2
.IP TYPE
The type of object the file table entry points to.
E 2
.PD 0
.IP FLG
Miscellaneous state variables encoded thus:
.RS
.IP R
open for reading
.IP W
open for writing
D 2
.IP P
pipe
E 2
I 2
.IP A
open for appending
I 4
.IP S
shared lock present
.IP X
exclusive lock present
.IP I
signal pgrp when data ready
E 4
E 2
.RE
.IP CNT
Number of processes that know this open file.
D 4
.IP INO
The location of the inode table entry for this file.
D 2
.IP OFFS
The file offset, see
.IR lseek (2).
E 2
I 2
.IP OFFS/SOCK
E 4
I 4
.IP MSG
Number of messages outstanding for this file.
.IP DATA
The location of the inode table entry or socket structure for this file.
.IP OFFSET
E 4
The file offset (see
D 4
.IR lseek (2)),
or the core address of the associated socket structure.
E 4
I 4
.IR lseek (2)).
E 4
E 2
.PD
.PP
.B \-s
print information about swap space usage: the number of (1k byte) pages used
and free is given as well as the number of used pages which belong
to text images.
.PP
.B \-T
prints the number of used and free slots in the several system tables
and is useful for checking to see how full system tables have become if the
system is under heavy load.
D 2
.B \-m
and
.B \-g
flags print the multiplexor tables.  These tables are rather difficult to
explain.  The potential explorer should examine the multiplexor code in
the system.
E 2
.SH FILES
.ta \w'/dev/kmem  'u
/vmunix	namelist
.br
/dev/kmem	default source of tables
.SH SEE ALSO
I 5
iostat(1),
E 5
D 2
ps(1), stat(2), filsys(5)
E 2
I 2
ps(1),
I 5
systat(1),
vmstat(1),
E 5
stat(2),
D 5
fs(5)
E 5
I 5
fs(5),
E 5
E 2
.br
K. Thompson,
.I UNIX Implementation
.SH BUGS
It would be very useful if the system recorded \*(lqmaximum occupancy\*(rq
on the tables reported by
.B \-T;
even more useful if these tables were dynamically allocated.
E 1
