abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.quot.8
h07026
s 00002/00007/00035
d D 6.2 88/04/18 21:41:38 bostic 4 3
c rip out mention of default file system, list options in synopsis
e
s 00001/00001/00041
d D 6.1 85/04/27 13:41:03 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00003/00041
d D 5.1 85/04/27 13:40:43 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00044/00000/00000
d D 4.1 85/04/27 13:40:26 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH QUOT 8 "4/1/81"
E 2
I 2
D 3
.TH QUOT 8  "4 February 1983"
E 3
I 3
.TH QUOT 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
quot \- summarize file system ownership
.SH SYNOPSIS
.B /etc/quot
D 4
[ option ] ...
[ filesystem ]
E 4
I 4
[ -ncf ] [ filesystem ... ]
E 4
.SH DESCRIPTION
.I Quot
prints the number of blocks in the named
.I filesystem
currently owned by each user.
If no 
.I filesystem
D 4
is named, a default name is assumed.
E 4
I 4
is named, the file systems listed in \fI/etc/fstab\fP are used.
E 4
The following options are available:
.TP
.B \-n
Cause the pipeline
.B "ncheck filesystem | sort +0n | quot \-n filesystem
to produce a list of all files and their owners.
.TP
.B \-c
Print three columns giving file size in blocks, number of
files of that size, and cumulative total of blocks
in that size or smaller file.
.TP
.B \-f
Print count of number of files as well as space owned by each user.
D 4
.SH FILES
Default file system varies with system.
.br
/etc/passwd	to get user names
E 4
.SH "SEE ALSO"
ls(1), du(1)
D 2
.SH BUGS
Holes in files are counted as if they actually occupied space.
E 2
E 1
