abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.rc.8
h47057
s 00001/00001/00063
d D 6.1 85/04/27 13:42:03 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00024/00003/00040
d D 5.1 85/04/27 13:41:40 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00043/00000/00000
d D 4.1 85/04/27 13:41:21 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH RC 8 "4/1/81"
E 2
I 2
D 3
.TH RC 8 "4 February 1983"
E 3
I 3
.TH RC 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
rc \- command script for auto-reboot and daemons
.SH SYNOPSIS
.B /etc/rc
I 2
.br
.B /etc/rc.local
E 2
.SH DESCRIPTION
.I Rc
D 2
is the command script which controls the automatic reboot
E 2
I 2
is the command script which controls the automatic reboot and
.I rc.local
is the script holding commands which are pertinent only
to a specific site.
E 2
.PP
When an automatic reboot is in progress,
.I rc
is invoked with the argument
.I autoboot
and runs a
.I fsck
with option
.B \-p
to ``preen'' all the disks of minor inconsistencies resulting
from the last system shutdown and to check for serious inconsistencies
caused by hardware or software failure.
If this auto-check and repair succeeds, then the second part of
.I rc
is run.
.PP
The second part of
.I rc,
which is run after a auto-reboot succeeds and also if
.I rc
is invoked when a single user shell terminates (see
.IR init (8)),
starts all the daemons on the system, preserves editor files
and clears the scratch directory
.B /tmp.
I 2
.I Rc.local
is executed immediately before any other commands after a successful
.IR fsck .
Normally, the first commands placed in the
.I rc.local
file define the machine's name, using
.IR hostname (1),
and save any possible core image that might have been
generated as a result of a system crash,
.IR savecore (8).
The latter command is included in the
.I rc.local
file because the directory in which core dumps are saved
is usually site specific.
E 2
.SH SEE ALSO
D 2
init(8), reboot(8)
E 2
I 2
init(8),
reboot(8),
savecore(8)
E 2
.SH BUGS
E 1
