abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.rdump.8c
h22001
s 00001/00001/00040
d D 6.1 85/04/27 15:39:44 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00041/00000/00000
d D 5.1 85/04/27 15:39:26 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH RDUMP 8C "19 January 1983"
E 2
I 2
.TH RDUMP 8C "%Q%"
E 2
.UC 5
.SH NAME
rdump \- file system dump across the network
.SH SYNOPSIS
.B /etc/rdump
[ key [
.I argument
\&... ] filesystem ]
.SH DESCRIPTION
.I Rdump
copies to magnetic tape all files
changed after a certain date
in the
.I filesystem.
The command is identical in operation to
.IR dump (8)
except the 
.I f
key should be specified and the file
supplied should be of the form
.IR machine:device .
.PP
.I Rdump
creates a remote server,
.IR /etc/rmt ,
on the client machine to access the tape
device.
.SH "SEE ALSO"
dump(8),
rmt(8C)
.SH DIAGNOSTICS
Same as 
.IR dump (8)
with a few extra related to the network.
E 1
