abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.repquota.8
h10711
s 00010/00005/00032
d D 6.3 88/07/09 11:32:07 bostic 4 3
c install approved copyright notice
e
s 00008/00002/00029
d D 6.2 88/05/20 12:23:52 bostic 3 2
c add Berkeley specific header
e
s 00001/00001/00030
d D 6.1 85/04/27 15:40:25 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00031/00000/00000
d D 5.1 85/04/27 15:40:05 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
D 3
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
D 4
.\" provided that this notice is preserved and that due credit is given
.\" to the University of California at Berkeley. The name of the University
.\" may not be used to endorse or promote products derived from this
.\" software without specific prior written permission. This software
.\" is provided ``as is'' without express or implied warranty.
E 4
I 4
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
E 3
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH REPQUOTA 8 "7 July 1983"
E 2
I 2
.TH REPQUOTA 8 "%Q%"
E 2
.UC 5
.SH NAME
repquota \- summarize quotas for a file system
.SH SYNOPSIS
.B repquota
.IR filesys ...
.SH DESCRIPTION
.I Repquota
prints a summary of the disc usage and quotas for the
specified file systems.  For each user the current
number files and amount of space (in kilobytes) is
printed, along with any quotas created with
.IR edquota (8).
.PP
Only the super-user may view quotas which are not their own.
.SH FILES
.DT
\fIquotas\fP	at the root of each file system with quotas
.br
/etc/fstab	for file system names and locations
.SH SEE ALSO
quota(1), quota(2), quotacheck(8), quotaon(8), edquota(8)
.SH DIAGNOSTICS
Various messages about inaccessible files; self-explanatory.
E 1
