abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.savecore.8
h52958
s 00008/00007/00048
d D 6.3 86/05/24 22:53:55 karels 5 4
c new logging
e
s 00000/00002/00055
d D 6.2 86/05/12 17:44:55 eric 4 3
c shutdownlog subsumed into syslog
e
s 00004/00004/00053
d D 6.1 85/04/27 13:49:58 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00013/00006/00044
d D 5.1 85/04/27 13:49:39 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00050/00000/00000
d D 4.1 85/04/27 13:49:23 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH SAVECORE 8 4/28/81
E 2
I 2
D 3
.TH SAVECORE 8 4/28/83
E 3
I 3
.TH SAVECORE 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
savecore \- save a core dump of the operating system
.SH SYNOPSIS
D 2
.B savecore
E 2
I 2
.B /etc/savecore
E 2
.I dirname
I 2
[
.I system
]
E 2
.SH DESCRIPTION
D 2
.PP
E 2
.I Savecore
D 2
is meant to be called at the end of the /etc/rc file.  Its function
E 2
I 2
is meant to be called near the end of the /etc/rc file.  Its function
E 2
is to save the core dump of the system (assuming one was made) and to
write a reboot message in the shutdown log.
.PP
Savecore checks the core dump to be certain it corresponds with the
current running unix.  If it does it saves the core image in the file
.IR dirname /vmcore.n
D 5
and it's brother, the namelist,
E 5
I 5
and its brother, the namelist,
E 5
.IR dirname /vmunix.n
The trailing ".n" in the pathnames is replaced by a number which grows
every time
.I savecore
is run in that directory.
.PP
Before savecore writes out a core image, it reads a number from the file
.IR dirname /minfree.
D 3
If there are fewer free blocks on the filesystem
which contains
E 3
I 3
D 5
If the number of free bytes on the filesystem which contains
E 5
I 5
If the number of free kilobytes on the filesystem which contains
E 5
E 3
.I dirname
D 3
than the number obtained from the minfree file, the core dump is not done.
E 3
I 3
D 5
is less than the number obtained from the minfree file times 1024,
the core dump is not done.
E 5
I 5
is less than the number obtained from the minfree file,
the core dump is not saved.
E 5
E 3
If the minfree file does not exist, savecore always writes out the core
file (assuming that a core dump was taken).
.PP
.I Savecore
D 5
also writes a reboot message in the shut down log.  If the system crashed
as a result of a panic,
E 5
I 5
also logs a reboot message using facility LOG_AUTH (see
.IR syslog (3))
If the system crashed as a result of a panic,
E 5
.I savecore
D 5
records the panic string in the shut down log too.
E 5
I 5
logs the panic string too.
E 5
I 2
.PP
If the core dump was from a system other than /vmunix, the name
of that system must be supplied as
.IR sysname .
E 2
.SH FILES
.DT
D 2
/usr/adm/shutdownlog	Shut down log
E 2
I 2
D 4
/usr/adm/shutdownlog	shut down log
E 2
.br
E 4
D 2
/vmunix			Current UNIX
E 2
I 2
/vmunix		current UNIX
E 2
.SH BUGS
I 2
Can be fooled into thinking a core dump is the wrong size.
E 2
E 1
