abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.sync.8
h52944
s 00010/00001/00028
d D 6.2 86/05/28 10:30:41 karels 4 3
c encourage use of halt/reboot
e
s 00001/00001/00028
d D 6.1 85/04/27 13:53:55 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00003/00003/00026
d D 5.1 85/04/27 13:53:35 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00029/00000/00000
d D 4.1 85/04/27 13:53:20 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH SYNC 8 "4/1/81"
E 2
I 2
D 3
.TH SYNC 8  "4 February 1983"
E 3
I 3
.TH SYNC 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
sync \- update the super block
.SH SYNOPSIS
D 2
.B sync
E 2
I 2
.B /etc/sync
E 2
.SH DESCRIPTION
.I Sync
executes the
.I sync
system primitive.
.I Sync
D 4
can be called to insure all disk writes have been completed before the
E 4
I 4
can be called to insure that all disk writes have been completed before the
E 4
processor is halted in a way not suitably done by
.IR reboot (8)
or
.IR halt (8).
I 4
Generally, it is preferable to use
.I reboot
or
.I halt
to shut down the system,
as they may perform additional actions
such as resynchronizing the hardware clock
and flushing internal caches before performing a final
.IR sync .
E 4
.PP
See
.IR sync (2)
for details on the system primitive.
.SH "SEE ALSO"
D 2
sync(2), halt(8), reboot(8), update(8)
E 2
I 2
sync(2), fsync(2), halt(8), reboot(8), update(8)
E 2
E 1
