abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.telnetd.8c
h51437
s 00001/00003/00125
d D 6.3 86/05/28 16:25:07 mckusick 4 3
c cannot change the synopsis line
e
s 00095/00035/00033
d D 6.2 86/05/13 11:42:51 minshall 3 2
c This is the 4.3 version.
e
s 00001/00001/00067
d D 6.1 85/04/27 15:59:52 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00068/00000/00000
d D 5.1 85/04/27 15:59:45 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH TELNETD 8C "4 March 1983"
E 2
I 2
.TH TELNETD 8C "%Q%"
E 2
.UC 5
.SH NAME
D 3
telnetd \- DARPA TELNET protocol server
E 3
I 3
D 4
telnetd \- DARPA
.B TELNET
protocol server
E 4
I 4
telnetd \- DARPA TELNET protocol server
E 4
E 3
.SH SYNOPSIS
.B /etc/telnetd
D 3
[
.B \-d
] [
.I port
]
E 3
.SH DESCRIPTION
.I Telnetd
D 3
is a server which supports the DARPA standard TELNET
virtual terminal protocol.  The TELNET server operates
at the port indicated in the ``telnet'' service description;
see
.IR services (5).
This port number may be overridden (for debugging purposes)
by specifying a port number on the command line.  If the
.B \-d
option is specified, each socket created by
.I telnetd
will have debugging enabled (see SO_DEBUG in
.IR socket (2)).
E 3
I 3
is a server which supports the DARPA standard
.B TELNET
virtual terminal protocol.
.I Telnetd
is invoked by the internet server (see
.IR inetd (8)),
normally for requests to connect to the
.B TELNET
port as indicated by the
.I /etc/services
file (see
.IR services (5)).
E 3
.PP
.I Telnetd
operates by allocating a pseudo-terminal device (see
.IR pty (4))
for a client, then creating a login process which has
the slave side of the pseudo-terminal as 
.BR stdin ,
.BR stdout ,
and
.BR stderr .
.I Telnetd
D 3
manipulates the master side of the pseudo terminal,
implementing the TELNET protocol and passing characters
between the client and login process.
E 3
I 3
manipulates the master side of the pseudo-terminal,
implementing the
.B TELNET
protocol and passing characters
between the remote client and the login process.
E 3
.PP
D 3
When a TELNET session is started up, 
E 3
I 3
When a
.B TELNET
session is started up, 
E 3
.I telnetd
D 3
sends a TELNET option to the client side indicating
a willingness to do ``remote echo'' of characters.
The pseudo terminal allocated to the client is configured
to operate in ``cooked'' mode, and with XTABS and CRMOD
E 3
I 3
sends
.B TELNET
options to the client side indicating
a willingness to do
.I remote echo
of characters, to
.I suppress go
.IR ahead ,
and to receive
.I terminal type information
from the remote client.
If the remote client is willing, the remote terminal type is
propagated in the environment of the created login process.
The pseudo-terminal allocated to the client is configured
to operate in \*(lqcooked\*(rq mode, and with XTABS and CRMOD
E 3
enabled (see
.IR tty (4)).
D 3
Aside from this initial setup, the only mode changes
.I telnetd
will carry out are those required for echoing characters
at the client side of the connection.
E 3
.PP
.I Telnetd
D 3
supports binary mode, and most of the common TELNET options,
but does not, for instance, support timing marks.  Consult
the source code for an exact list of which options are not
implemented.
E 3
I 3
is willing to
.IR do :
.IR echo ,
.IR binary ,
.I suppress go
.IR ahead ,
and
.I timing
.IR mark .
.I Telnetd
is willing to have the remote client
.IR do :
.IR binary ,
.I terminal
.IR type ,
and
.I suppress go
.IR ahead .
E 3
.SH "SEE ALSO"
telnet(1C)
.SH BUGS
D 3
A complete list of the options supported should be given here.
E 3
I 3
Some
.B TELNET
commands are only partially implemented.
.PP
The
.B TELNET
protocol allows for
the exchange of the number of lines and columns on the user's terminal,
but
.I telnetd
doesn't make use of them.
.PP
Because of bugs in the original 4.2 BSD
.IR telnet (1C),
.I telnetd
performs some dubious protocol exchanges to try to discover if the remote
client is, in fact, a 4.2 BSD
.IR telnet (1C).
.PP
.I Binary mode
has no common interpretation except between similar operating systems
(Unix in this case).
.PP
The terminal type name received from the remote client is converted to
lower case.
.PP
The
.I packet
interface to the pseudo-terminal
(see
.IR pty (4))
should be used for more
intelligent flushing of input and output queues.
.PP
.I Telnetd
never sends
.B TELNET
.I go ahead
commands.
E 3
E 1
