abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.tftpd.8c
h55443
s 00007/00024/00031
d D 6.2 86/05/26 17:22:22 karels 3 2
c updates
e
s 00001/00001/00054
d D 6.1 85/04/27 16:00:09 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00055/00000/00000
d D 5.1 85/04/27 16:00:02 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH TFTPD 8C "4 March 1983"
E 2
I 2
.TH TFTPD 8C "%Q%"
E 2
.UC 5
.SH NAME
tftpd \- DARPA Trivial File Transfer Protocol server
.SH SYNOPSIS
.B /etc/tftpd
D 3
[
.B \-d
] [
.I port
]
E 3
.SH DESCRIPTION
.I Tftpd
is a server which supports the DARPA Trivial File Transfer
D 3
Protocol.  The TFTP server operates
E 3
I 3
Protocol.
The TFTP server operates
E 3
at the port indicated in the ``tftp'' service description;
see
.IR services (5).
D 3
This port number may be overridden (for debugging purposes)
by specifying a port number on the command line.  If the
.B \-d
option is specified, each socket created by
.I tftpd
will have debugging enabled (see SO_DEBUG in
.IR socket (2)).
E 3
I 3
The server is normally started by
.IR inetd (8).
E 3
.PP
The use of
.I tftp
does not require an account or password on the remote system.
Due to the lack of authentication information, 
.I tftpd
will allow only publicly readable files to be
accessed.
I 3
Files may be written only if they already exist and are publicly writable.
E 3
Note that this extends the concept of ``public'' to include
all users on all hosts that can be reached through the network;
this may not be appropriate on all systems, and its implications
should be considered before enabling tftp service.
I 3
The server should have the user ID with the lowest possible privilege.
E 3
.SH "SEE ALSO"
D 3
tftp(1C)
.SH BUGS
This server is known only to be self consistent
(i.e. it operates with the user TFTP program,
.IR tftp (1C)).
Due to the unreliability of the transport protocol
(UDP) and the scarcity of TFTP implementations,
it is uncertain whether it really works.
.PP
The search permissions of the directories leading to the files accessed
are not checked.
E 3
I 3
tftp(1C), inetd(8)
E 3
E 1
