abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.timed.8
h53246
s 00010/00005/00108
d D 6.3 88/07/09 11:32:08 bostic 6 5
c install approved copyright notice
e
s 00008/00002/00105
d D 6.2 87/12/23 14:31:44 bostic 5 4
c add Berkeley header; NASA wants it
e
s 00000/00000/00107
d D 6.1 86/05/28 11:42:38 karels 4 3
c out
e
s 00021/00006/00086
d D 1.3 86/05/28 10:30:57 karels 3 2
c updates and cleanups
e
s 00020/00002/00072
d D 1.2 86/05/15 19:25:22 bloom 2 1
c add -i flag (from ks@purdue)
e
s 00074/00000/00000
d D 1.1 85/06/24 13:27:25 gusella 1 0
c date and time created 85/06/24 13:27:25 by gusella
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
D 5
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
D 6
.\" provided that this notice is preserved and that due credit is given
.\" to the University of California at Berkeley. The name of the University
.\" may not be used to endorse or promote products derived from this
.\" software without specific prior written permission. This software
.\" is provided ``as is'' without express or implied warranty.
E 6
I 6
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 6
E 5
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH TIMED 8 "%Q%"
.UC 6
.ad
.SH NAME
timed \- time server daemon
.SH SYNOPSIS
.B /etc/timed
D 2
[ -t ] [ -M ] [ -n network ]
E 2
I 2
[ -t ] [ -M ] [ -n network ] [ -i network ]
E 2
.SH DESCRIPTION
.I Timed
is the time server daemon and is normally invoked
at boot time from the
.IR rc (8)
file.  
It synchronizes the host's time with the time of other
machines in a local area network running 
.IR timed (8).
These time servers will slow down the clocks of some machines
and speed up the clocks of others to bring them to the average network time.
I 3
The average network time is computed from measurements of clock differences
using the ICMP timestamp request message.
E 3
.PP
The service provided by \fItimed\fP is based  on a master-slave
scheme.
When
.IR timed (8)
is started on a machine, it asks the master for the network time
and sets the host's clock to that time.
After that, it accepts synchronization messages periodically sent by
the master and calls 
.IR adjtime (2)
to perform the needed corrections on the host's clock.
.PP
It also communicates with
.IR date (1)
in order to set the date globally,
and with 
.IR timedc (8),
a timed control program.
If the machine running the master crashes, then the slaves will elect
a new master from among slaves running with the 
.B \-M
flag.
A
.IR timed
running without the
.B \-M
flag will remain a slave.
The 
.B \-t 
flag enables \fItimed\fP to trace the messages it receives in the
file /usr/adm/timed.log.
Tracing can be turned on or off by the program
.IR timedc (8).
I 3
.I Timed
normally checks for a master time server on each network to which
it is connected, except as modified by the options described below.
It will request synchronization service from the first master server
located.
If permitted by the
.B \-M
flag, it will provide synchronization service on any attached networks
on which no current master server was detected.
Such a server propagates the time computed by the top-level master.
E 3
The 
.B \-n 
flag, followed by the name of a network which the host is connected to
D 3
(see: /etc/networks), overrides the default choice of the
E 3
I 3
(see
.IR networks (5)),
overrides the default choice of the
E 3
D 2
network address made by the program.
E 2
I 2
network addresses made by the program.
Each time the
.B \-n
flag appears, that network name is added to a list of valid networks.
All other networks are ignored.
The 
.B \-i 
D 3
flag, followed by the name of a network which the host is connected to
(see: /etc/networks), overrides the default choice of the
network addresses made by the program.
E 3
I 3
flag, followed by the name of a network to which the host is connected
(see
.IR networks (5)),
overrides the default choice of the network addresses made by the program.
E 3
Each time the
.B \-i
flag appears, that network name is added to a list of networks to ignore.
All other networks are used by the time daemon.
The
.B \-n
and 
.B \-i
flags are meaningless if used together.
E 2
.SH FILES
.nf
D 3
.ta \w'/usr/adm/masterlog       'u
E 3
I 3
.ta \w'/usr/adm/timed.masterlog     'u
E 3
/usr/adm/timed.log		tracing file for timed
/usr/adm/timed.masterlog	log file for master timed 
.fi
.SH "SEE ALSO"
D 3
date(1), adjtime(2), gettimeofday(2), timedc(8),
E 3
I 3
date(1), adjtime(2), gettimeofday(2), icmp(4P), timedc(8),
E 3
.br
\fITSP: The Time Synchronization Protocol for UNIX 4.3BSD\fP, 
R. Gusella and S. Zatti
E 1
