abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.trsp.8c
h41884
s 00101/00000/00000
d D 6.1 85/10/08 22:31:28 sklower 1 0
c date and time created 85/10/08 22:31:28 by sklower
e
u
U
t
This manual page documents a tool used for debugging failures in
the Xerox NS Sequenced packet protocol layer.  It is adapted from
the Internet equivalent trpt(8c).
T
I 1
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH TRSP 8c "%Q%"
.UC 5
.SH NAME
trsp \- transliterate sequenced packet protocol trace
.SH SYNOPSIS
.B trsp
[
.B \-a
] [
.B \-s
]  [
.B \-t
] [
.B \-j
] [
.B \-p
hex-address ]
[ system [ core ] ]
.SH DESCRIPTION
.I Trpt
interrogates the buffer of SPP trace records created
when a socket is marked for \*(lqdebugging\*(rq (see
.IR setsockopt (2)),
and prints a readable description of these records.
When no options are supplied, 
.I trsp
prints all the trace records found in the system
grouped according to SPP connection protocol control
block (PCB).  The following options may be used to
alter this behavior.
.TP
.B \-s
in addition to the normal output,
print a detailed description of the packet
sequencing information,
.TP
.B \-t
in addition to the normal output,
print the values for all timers at each
point in the trace,
.TP
.B \-j
just give a list of the protocol control block
addresses for which there are trace records,
.TP
.B \-p
show only trace records associated with the protocol
control block who's address follows,
.TP
.B \-a
in addition to the normal output,
print the values of the source and destination
addresses for each packet recorded.
.PP
The recommended use of
.I trsp
is as follows.
Isolate the problem and enable debugging on the
socket(s) involved in the connection.
Find the address of the protocol control blocks
associated with the sockets using the 
.B \-A
option to 
.IR netstat (1).
Then run
.I trsp
with the
.B \-p
option, supplying the associated
protocol control block addresses.  If there are
many sockets using the debugging option, the
.B \-j
option may be useful in checking to see if
any trace records are present for the socket in
question.
.PP
If debugging is being performed on a system or
core file other than the default, the last two
arguments may be used to supplant the defaults.
.SH FILES
/vmunix
.br
/dev/kmem
.SH "SEE ALSO"
setsockopt(2), netstat(1)
.SH DIAGNOSTICS
``no namelist'' when the system image doesn't
contain the proper symbols to find the trace buffer;
others which should be self explanatory.
.SH BUGS
Should also print the data for each input or output,
but this is not saved in the race record.
.PP
The output format is inscrutable and should be described
here.
E 1
