abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.uucico.8c
h09374
s 00013/00002/00211
d D 6.3 86/05/15 14:16:22 bloom 3 2
c add uucpd to man page
e
s 00125/00052/00088
d D 6.2 86/04/24 22:18:11 mckusick 2 1
c update from rfg
e
s 00140/00000/00000
d D 6.1 85/06/24 13:17:05 bloom 1 0
c manual page first distributed with 4.3BSD
e
u
U
t
T
I 1
.\"	%W% (Berkeley) %G%
.\"
.TH UUCICO 8C "%Q%"
.UC 6
.SH NAME
D 2
uucicio \- uupoll transfer files queued by uucp or uux
E 2
I 2
D 3
uucico \- transfer files queued by uucp or uux
E 3
I 3
uucico, uucpd \- transfer files queued by uucp or uux
E 3
E 2
.SH SYNOPSIS
D 2
.B uucico
E 2
I 2
.B /usr/lib/uucp/uucico
E 2
[
.BI \-d spooldir
] [
.BI \-g grade
] [
.BI \-r role
] [
.B \-R
] [
.BI \-s system
] [
.BI \-x debug
] [
.B \-L
] [
.BI \-t turnaround
]
I 3
.PP
.B /etc/uucpd
E 3
D 2
.PP
.B uupoll 
[
.BI \-g grade
] [
.B -n
]
system [ system1 ... ]
E 2
.SH DESCRIPTION
D 2
.I uucico
E 2
I 2
.I Uucico
E 2
performs the actual work involved in transferring files between
systems. 
D 2
.I uucp
E 2
I 2
.IR Uucp (1C)
E 2
and
D 2
.I uux
merely queue requests for data transfer which uucico processes.
E 2
I 2
.IR uux (1C)
merely queue requests for data transfer which
.I uucico
processes.
E 2
.PP
The following options are available.
.TP 8
.BI \-d spooldir
Use
.I spooldir
D 2
as the spool directory.
E 2
I 2
as the spool directory. The default is /usr/spool/uucp.
E 2
.TP 8
.BI \-g grade
Only send jobs of grade
.I grade
or higher this transfer.
I 2
The grade of a job is specified when the job is queued by
.I uucp
or
.IR uux .
E 2
.TP 8
D 2
.B \-R
Reverse roles. This tells the remote system to begin sending its
jobs first, instead of waiting for the local machine to finish.
.TP 8
E 2
.BI \-r role
.I role
D 2
is either 1 or 0. It signifies whether uucico is to run in 
master or slave mode. 1 is used when starting 
E 2
I 2
is either 1 or 0; it indicates whether
E 2
.I uucico
D 2
by hand. 0 is used when another system calls the local system.
E 2
I 2
is to start up in 
master or slave role, respectively. 1 is used when running 
.I uucico
by hand or from
.IR cron (8).
0 is used when another system calls the local system.
Slave role is the default.
E 2
.TP 8
I 2
.B \-R
Reverse roles.  When used with the
.B \-r1
option, this tells the remote system to begin sending its
jobs first, instead of waiting for the local machine to finish.
.TP 8
E 2
.BI \-s system
Call only system
.IR system .
If 
.B \-s
D 2
is not specified, and \-r1 is specifed,
E 2
I 2
is not specified, and \-r1 is specified,
E 2
.I uucico
will attempt to call all systems for which there is work.
If
.B \-s
is specified, a call will be made even if there is
D 2
no work for that system. This is useful for polling
systems.
E 2
I 2
no work for that system. This is useful for polling.
E 2
.TP 8
.BI \-x debug
Turn on debugging at level
.IR debug .
Level 5 is a good start when trying to find out why a call
failed. Level 9 is very detailed. Level 99 is absurdly verbose.
I 2
If
.I role
is 1 (master), output is normally written to the standard message
output
.IR stderr .
If
.I stderr
is unavailable, output is written to
.RI /usr/spool/uucp/AUDIT/ system.
When
.I role
is 0 (slave), debugging output is always written to the AUDIT
file.
E 2
.TP 8
.B \-L
Only call ``local'' sites. A site is considered local if
the device-type field in 
.I L.sys
is one of LOCAL, DIR or TCP.
.TP 8
.BI \-t turnaround
Use
.I turnaround
as the line turnaround time (in minutes) instead of the default 30.  If 
.I turnaround
is missing or 0, line turnaround will be disabled.
D 2
After uucico has been running in Slave mode for
E 2
I 2
After
.I uucico
has been running in slave role for
E 2
.I turnaround 
D 2
minutes, it will attempt to run in master mode by negotiating with the
remote machine.  In the past, a large transfer of news in
one direction would hold up mail going in the other direction.
E 2
I 2
minutes, it will attempt to run in master role by negotiating with the
remote machine.
In earlier versions of
.IR uucico ,
a transfer of many large files in one direction would hold up mail
going in the other direction.
E 2
With the turnaround code working, the message flow will be more
bidirectional in the short term.
D 2
This option only works with newer uucicos and is ignored by older ones.
E 2
I 2
This option only works with newer
.IR uucico 's
and is ignored by older ones.
E 2
.PP
If
.I uucico
receives a
.B SIGFPE
(see
D 2
.IR kill (1))
E 2
I 2
.IR kill (1)),
E 2
it will toggle the debugging on or off.
.PP
I 3
.I Uucpd
is the server for supporting uucp connections over networks.
.I Uucpd
listens for service requests at the port indicated in the ``uucp''
service specification; see \fIservices\fP\|(5).
The server provides login name and password authentication before starting up
.I uucico
for the rest of the transaction.
.PP
E 3
D 2
This program will typically be started by
.IR cron (8).
E 2
I 2
.I Uucico
is commonly used either of two ways: as a daemon run periodically by
.IR cron (8)
to call out to remote systems, and as a ``shell'' for remote systems
who call in.
For calling out periodically, a typical line in
.I crontab
would be:
E 2
.PP
D 2
.B uupoll
is used to force a poll of a remote system. It queues a null job
for the remote system and invokes 
.I uucico.
If the
.I \-g
flag is specified, the null job will be queued with grade 
.IR grade .
If
.I \-n
is specified, the null job will be queued, but an immediate
E 2
I 2
.nf
	0	*	*	*	*	/usr/lib/uucp/uucico -r1
.fi
.PP
This will run
E 2
.I uucico
D 2
will not be invoked.
E 2
I 2
every hour in master role. 
For each system that has transfer requests queued, 
.I uucico
calls the system, logs in, and executes the transfers. The file
.IR L.sys (5)
is consulted for information about how to log in, while
.IR L-devices (5)
specifies available lines and modems for calling.
.PP
For remote systems to dial in, an entry in the
.IR passwd (5)
file must be created, with a login ``shell'' of
.IR uucico .
For example:
.PP
.nf
	nuucp:Password:6:1::/usr/spool/uucppublic:/usr/lib/uucp/uucico
.fi
.PP
The UID for UUCP remote logins is not critical, so long as it differs from
D 3
the UUCP Administrative login (usually UID 5).
E 3
I 3
the UUCP Administrative login.
E 3
The latter owns the UUCP files, and assigning
this UID to a remote login would be an extreme security hazard. 
E 2
.SH FILES
D 2
.TP 22
/usr/lib/uucp
directory with commands used by uucico internally
.TP
/usr/spoool/uucp
spool directory
E 2
I 2
.ta \w'/usr/spool/uucp/D.hostnameX/  'u
.nf
/usr/lib/uucp/	UUCP internal files/utilities
/usr/lib/uucp/L-devices	Local device descriptions
/usr/lib/uucp/L-dialcodes	Phone numbers and prefixes
/usr/lib/uucp/L.aliases	Hostname aliases
/usr/lib/uucp/L.cmds	Remote command permissions list
/usr/lib/uucp/L.sys	Host connection specifications
/usr/lib/uucp/USERFILE	Remote directory tree permissions list
.PP
/usr/spool/uucp/	Spool directory
/usr/spool/uucp/AUDIT/*	Debugging audit trails
/usr/spool/uucp/C./	Control files directory
/usr/spool/uucp/D./	Incoming data file directory
/usr/spool/uucp/D.hostname/	Outgoing data file directory
/usr/spool/uucp/D.hostnameX/	Outgoing execution file directory
/usr/spool/uucp/CORRUPT/	Place for corrupted C. and D. files
/usr/spool/uucp/ERRLOG	UUCP internal error log
/usr/spool/uucp/LOGFILE	UUCP system activity log
/usr/spool/uucp/LCK/LCK..*	Device lock files
/usr/spool/uucp/SYSLOG	File transfer statistics log
/usr/spool/uucp/STST/*	System status files
/usr/spool/uucp/TM./	File transfer temp directory
/usr/spool/uucp/X./	Incoming execution file directory
.PP
/usr/spool/uucppublic	Public access directory
.fi
E 2
.SH SEE ALSO
I 2
uucp(1C), uuq(1C), uux(1C), L-devices(5), L-dialcodes(5), L.aliases(5),
L.cmds(5), L.sys(5), uuclean(8C), uupoll(8C), uusnap(8C), uuxqt(8C)
.PP
D. A. Nowitz and M. E. Lesk,
.IR "A Dial-Up Network of UNIX Systems" .
.PP
E 2
D. A. Nowitz,
D 2
Uucp Implementation Description
E 2
I 2
.IR "Uucp Implementation Description" .
E 2
E 1
