abs0/4.3BSD-Quasijarus/man/man8/SCCS/s.uuxqt.8c
h56479
s 00051/00000/00000
d D 6.1 86/04/24 22:25:14 mckusick 1 0
c from rfg
e
u
U
t
T
I 1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	%W% (Berkeley) %G%
.\"
.TH UUXQT 8C "%Q%"
.UC 6
.SH NAME
uuxqt \- \s-1UUCP\s+1 execution file interpreter
.SH SYNOPSIS
.B /usr/lib/uucp/uuxqt
[
.BI \-x debug
]
.SH DESCRIPTION
.I Uuxqt
interprets
.I "execution files"
created on a remote system via
.IR uux (1C)
and transferred to the local system via
.IR uucico (8C).
When a user uses
.I uux
to request remote command execution, it is
.I uuxqt
that actually executes the command. 
Normally,
.I uuxqt
is forked from
.I uucico
to process queued execution files;
for debugging, it may also be run manually by the \s-1UUCP\s+1 administrator.
.PP
.I Uuxqt
runs in its own subdirectory,
.IR /usr/spool/uucp/XTMP .
It copies intermediate files to this directory when necessary.
.SH FILES
.ta \w'/usr/spool/uucp/LCK/LCK.XQT   'u
.nf
/usr/lib/uucp/L.cmds	Remote command permissions list
/usr/lib/uucp/USERFILE	Remote directory tree permissions list
/usr/spool/uucp/LOGFILE	UUCP system activity log
/usr/spool/uucp/LCK/LCK.XQT	\fIUuxqt\fP lock file
/usr/spool/uucp/X./	Incoming execution file directory
/usr/spool/uucp/XTMP	\fIUuxqt\fP running directory
.fi
.SH SEE ALSO
uucp(1C), uux(1C), L.cmds(5), USERFILE(5), uucico(8C)
E 1
